{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/context-aware-analytics/",
  "title": "Overview of context-aware analytics",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nOverview of context-aware analytics\nSupported in:\nGoogle secops\nSIEM\nGoogle SecOps lets you view telemetry, entity context, relationships, \nand vulnerabilities as a single detection within your Google SecOps account. \nIt provides entity contextualization to enable you to understand both the \nbehavioral patterns in telemetry and the context of those impacted entities \nfrom those patterns.\nExamples:\nSurfacing the permissions for an account on which a brute force login is being \nattempted.\nImportance of data hosted by an asset that is also the source of outbound \nnetwork activity.\nCustomers can use this contextualization for detection filtering, heuristic \nalert prioritization, triage, and investigation.\nSecurity analysts and detection engineers typically work to craft a detection on \na basic pattern of event telemetry (an outbound network connection), creating \nnumerous detections for their analysts to triage. The analysts attempt to stitch \ntogether an understanding of what happened to trigger the alert and how \nsignificant the threat is.\nContext-aware analytics incorporates advanced enrichment capabilities earlier in \nthe detection authoring and execution workflow, enabling you to provide the \nfollowing additional capabilities:\nMaking relevant context available for heuristic-driven contextual risk scoring \nof detections at detection execution time rather than at the human triage stage\nReducing time spent on triage and manually stitching together information from \ndisparate IT security systems (EDR consoles, firewall or proxy logs, CMDB and \nIAM context, vulnerability scan results)\nEnabling analysts and detection engineers to filter out entire clusters of \nthreats that may be expected or represent little or no danger to the enterprise \n(malware testing in a sandbox environment, vulnerabilities and anomalous activity \nin a development network with no sensitive data or access, and more)\nWriting rules for context-aware analytics\nYou can use Detection Engine rules to search for entity context data in your \nGoogle SecOps account.\nTo search for entity context data, complete the following:\nSpecify a source using either the udm or entity.\n$eventname.[<source>].field1.field2\nFor an entity context, <source> is 'graph'. For a UDM event, <source> is \n'udm'.\nIf omitted, the <source> defaults to udm.\nSpecify the entity data:\n$e1.graph.entity.hostname = \"my-hostname\"\n$e1.graph.entity.relations.relationship = \"OWNS\"\nSpecify UDM event data. The following statements are equivalent.\n$e1.udm.principal.asset_id = \"my_asset_id\"\n$e1.principal.asset_id = \"my_asset_id\"\nYou can create many of the same types of rules for entity contexts as you would \nfor UDM events, including the following:\nMultiple event rules\nComparing entity contexts to other entity contexts\nComparing entity contexts to UDM events\nRepeated fields in entity contexts\nSliding windows\nCalculating a risk score for detections\nUnlike a UDM event, an entity context does not have a specific timestamp.\nEach entity context record has a time interval, entity.metadata.interval, over\nwhich the entity context is valid. This time interval may not be a day boundary\nand can be any duration.\nA UDM event will be correlated with an entity context record only when the\ntimestamp of the UDM event falls within the time interval of the entity context\nrecord. If this condition is not met, the UDM and entity are not evaluated for\ndetections. The detection engine implicitly enforces this and you don't need\nto specify it as a condition in a rule.\nWhen comparing UDM events to an entity context with windowing, an entity context \nrepresents a constant value over a specified window.\nIf there are adjacent day buckets where the entity context changes its value, \nGoogle SecOps attempts to match on all of the entity context values, and \nreturn any and all matches that are found.\nExample rules\nSearching for entities with administrator context\nThe following rule searches for entities that are also tied to administrator \nprivileges. It is looking for times when someone with administrator privilege \nattempted to sign in to or log out of the system.\nrule LoginLogout {\n  meta:\n  events:\n    ($log_inout.metadata.event_type = \"USER_LOGIN\" or  $log_inout.metadata.event_type = \"USER_LOGOUT\")\n    $log_inout.principal.user.user_display_name = $user\n\n    $context.graph.entity.user.user_display_name = $user\n    $context.graph.entity.resource.attribute.roles.type = \"ADMINISTRATOR\"\n\n  match:\n    $user over 2m\n\n  condition:\n    $log_inout and $context\n}\nSliding window example\nThe following sliding window example is valid.\nrule Detection {\n  meta:\n  events:\n    $e1.graph.entity.hostname = $host\n    $e2.udm.principal.hostname = $host\n\n  match:\n    // Using e2 (a UDM event) as a pivot.\n    $host over 3h after $e2\n\n  condition:\n    $e1 and $e2\n}\nInvalid sliding window example\nThe following sliding window example is invalid. Entity context cannot be used \nas a pivot for a sliding window.\nrule Detection {\n  meta:\n  events:\n    $e1.graph.entity.hostname = $host\n    $e2.udm.principal.hostname = $host\n\n  match:\n    // Attempting to use $e1 (an entity context) as a pivot. Invalid.\n    $host over 3h after $e1\n\n  condition:\n    $e1 and $e2\n}\nLogin example using outcome section\nThe following example uses the\noutcome\nsection to calculate a risk score for\nthe detection.\nrule Detection {\n  meta:\n  events:\n    $auth.metadata.event_type = \"USER_LOGIN\"\n    $auth.metadata.vendor_name = \"Acme\"\n    $auth.metadata.product_name = \"Acme SSO\"\n    $auth.target.user.userid = $user\n    $auth.metadata.event_timestamp.seconds >\n       $context.graph.entity.user.termination_date.seconds\n\n    $context.graph.metadata.vendor_name = \"Microsoft\"\n    $context.graph.metadata.product_name = \"Azure Active Directory\"\n    $context.graph.metadata.entity_type = \"USER\"\n    $context.graph.entity.user.userid = $user\n    $context.graph.entity.user.termination_date.seconds > 0\n\n  match:\n    $user over 15m\n\n  outcome:\n    $risk_score = max(\n        if ( $auth.metadata.event_type = \"USER_LOGIN\", 50) +\n        if (\n            $context.graph.entity.user.title = \"Remote\" nocase or\n            $context.graph.entity.user.title = \"Temp\" nocase or\n            $context.graph.entity.user.title = \"Vendor\" nocase, 40) +\n        if ( $context.graph.entity.user.title = \"Legal\" nocase, 10)\n    )\n\n  condition:\n    $auth and $context\n}\nSuspicious process launch example\nThe following example evaluates UDM event process data against IOC context data\nstored as an entity context.\nrule ProcessLaunch {\n  meta:\n  events:\n    $ioc.graph.metadata.vendor_name = \"ACME\"\n    $ioc.graph.metadata.product_name = \"IOCs\"\n    $ioc.graph.metadata.entity_type = \"FILE\"\n    $ioc.graph.entity.file.sha256 = $hash\n\n    $process.metadata.event_type = \"PROCESS_LAUNCH\"\n    $process.principal.hostname = $hostname\n    (\n        not $process.target.process.file.sha256 = \"\" and\n        $process.target.process.file.sha256 = $hash\n    )\n\n  match:\n    $hash over 15m\n\n  condition:\n    $ioc and $process\n}\nAdditional qualifiers for entity context\nTo create an event variable that uses an entity context, you must provide a\n<source>\nafter the event name. \nThe\n<source>\nmust be\ngraph\n.\nThe following pattern refers to an entity context:\n$e.graph.entity.hostname\nNote that there are two equivalent methods of referring to a UDM event:\n$u.udm.principal.asset_id\n$u.principal.asset_id\nYou can mix and match all of these qualifiers in rule text. You can use \ndifferent qualifiers for the same event as well.\nOutcome section\nDetection engine supports an\noutcome\nsection that lets you derive more\ninformation from a rule. The logic defined in the\noutcome\nsection is evaluated\nagainst each detection. If a rule generates\nN\ndetections, each of the\nN\ndetections may result in a different set of outcomes.\nYou can find an example rule that uses the\noutcome\nsection under\nrule with outcome selection\n.\nDetailed usage and syntax of an\noutcome\nsection can be found in\nthe outcome section\n.\nOutcome section and detection deduplication / detection grouping\nFor rules with a match section, recall that detections are \"grouped by\" the\nmatch variables. This causes detections to be deduplicated, such that one row\nis returned for each unique set of match variables and time window.\nThe outcome variables are ignored when doing this deduplication. Thus, if\nthere are two different detections with the same values for the match variables\nand time window, but with different values for outcome variables, these will\nbe deduplicated and you will see only one detection. This can happen when a\ndetection was created due to late arriving data, for example. Here's an example\nthat illustrates this case.\nrule ExampleOutcomeRule {\n  ...\n  match:\n    $hostname over <some window>\n  outcome:\n    $risk_score = <some logic here>\n  ...\n}\nThis rule results in the following matches:\nDetection 1:\n  hostname: test-hostname\n  time window: [t1, t2]\n  risk_score: 10\nDetection 2:\n  hostname: test-hostname\n  time window: [t1, t2]\n  risk_score: 73\nBecause the match variables and the time window are the same for\nDetection 1 and Detection 2, these are deduplicated and you will\nsee only one detection, even though the outcome variable, risk_score, is\ndifferent.\nWhat's next\nFor information about how Google SecOps ingests contextual data and\nenriches entities, see\nHow Google SecOps enriches event and entity data\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:04.940950Z"
}