{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/metrics-functions/",
  "title": "Use metrics functions for Risk Analytics rules",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse metrics functions for Risk Analytics rules\nUse metrics functions for Risk Analytics rules\nSupported in:\nGoogle secops\nSIEM\nThis document describes the major elements of YARA-L 2.0 syntax features, specifically designed for risk analytics. It provides a detailed overview of how to use specialized metric functions to aggregate large amounts of historical data, enabling more sophisticated detection and risk scoring. For more information about YARA-L, see\nYARA-L 2.0 overview\n.\nGoogle Security Operations supports a number of metric functions, which can aggregate\nlarge amounts of historical data. All rules that use the metric function are automatically categorized as\nmulti-event rules\n, even if they don't have a\nmatch\nsection and use only one event variable. This means that they count against multi-event rule quota.\nMetric function parameters\nYou can use the metric functions for rules that perform entity behavioral\nanalytics.\nExample: Calculate maximum daily outbound bytes per IP\nThe following example demonstrates a rule that calculates the maximum number of daily bytes sent by a specific IP address over the past month. In this instance, the IP address is represented by the placeholder variable (\n$ip\n). Learn more about\nplaceholder variables\n.\n$max_bytes_per_day = max(metrics.network_bytes_outbound(\n    period:1d, window:30d,\n    metric:value_sum,\n    agg:max,\n    principal.asset.ip:$ip\n))\nDue to the large number of arguments used in these functions, the example uses named\nparameters, which can be specified in any order. The parameters are as follows:\nPeriod\nThe length of time over which individual log events are combined into a single\nobservation. The only values allowed are\n1h\nand\n1d\n.\nWindow\nThe length of time over which individual observations are aggregated into a\nsingle value, such as the average and the maximum. The allowed values for\nwindow\nare based on the period of the metric. The valid mapping is as follows:\nperiod:1h\n:\nwindow:today\nperiod:1d\n:\nwindow:30d\nExample: Identify peak daily failed authentications for a specific user\nExample: Identifying peak daily failed authentications for a specific user\nThe following example demonstrates a rule that identifies the greatest number of failed authentication attempts (\nmax(metrics.auth_attempts_fail\n) recorded for a specific user (\nalice\n) within a single day (\n1d\n), calculated over a 30-day (\n30d\n) lookback period:\n$user = \"alice\"\n$max_fail = max(metrics.auth_attempts_fail(\n    period:1d, window:30d,\n        metric:event_count_sum,\n        agg:max,\n        target.user.userid:$user\n))\nExample: Detect first-seen user logins using hourly and daily metrics\nThe following example demonstrates how to combine hourly and daily metric functions to identify \"first-seen\" behaviors. This rule determines if a user is logging into a specific application for the first time by checking both the current day's hourly increments and a broader 30-day historical window.\nevents:\n    $e.metadata.event_type = \"USER_LOGIN\"\n    $e.security_result.action = \"ALLOW\"\n    $userid = $e.target.user.userid\n    $app = $e.target.application\nmatch:\n    // find events from now - 4h ago, which is the recommended look-back period\n    $userid, $app over 4h\noutcome:\n    // check hourly analytics until daily analytics are available\n    $first_seen_today = max(metrics.auth_attempts_success(\n        period:1h, window:today, metric:first_seen, agg:max,\n        target.user.userid:$userid, target.application:$app))\n    $first_seen_monthly = max(metrics.auth_attempts_success(\n        period:1d, window:30d, metric:first_seen, agg:max,\n        target.user.userid:$userid, target.application:$app))\ncondition:\n    $e and ($first_seen_today = 0) and ($first_seen_monthly = 0)\nMetric\nWithin each period, each observation has a number of metrics associated with it.\nOne of these must be selected for aggregation over the entire window. Five\nmetric\ntypes are supported:\nevent_count_sum\n: Number of unique log events within each period.\nfirst_seen\n: First seen timestamp of a matching log event within each\nperiod.\nlast_seen\n: Last seen timestamp of a matching log event within each\nperiod.\nvalue_sum\n: Represents the sum of the number of bytes in all the log\nevents combined within the period. You can only use this value for a metric\nfunction with\nbytes\nin its name.\nnum_unique_filter_values\n: Metric that is not pre-computed by\nGoogle SecOps but can be computed during rule execution. For details, see\nCount unique metrics\n.\nAgg\nWhich aggregation is applied to the metric. Aggregations are applied over the\nentire window (e.g. the highest daily value over the past 30 days). The allowed\nvalues are:\navg\n—Average value per period. This is a statistical mean, which does not\ninclude values of zero.\nmax\n—Greatest value per period.\nmin\n—Smallest value per period.\nnum_metric_periods\n—Number of periods within the time window that had a\nnon-zero metric value.\nstddev\n—Standard deviation of the value per period. This is a statistical\nstandard deviation which does not include zero values.\nsum\n—Sum of each value per period, over the entire window.\nFor example, the following rule tells you the average number of failed\nauthentication attempts seen for a specific user (Alice) in any given day over\nthe last 30 days:\n$user = \"alice\"\n$avg_fail = max(metrics.auth_attempts_fail(\n        period:1d, window:30d,\n        metric:event_count_sum,\n        agg:avg,\n        target.user.userid:$user\n))\nThe following rule tells you how many successful authentications a specific user\nhad over the last 30 days:\n$total_success = max(metrics.auth_attempts_success(\n        period:1d, window:30d,\n        metric:event_count_sum,\n        agg:sum,\n        target.user.userid:$user\n))\nThe following rule tells you whether a specific user successfully logged in at\nleast once over the last 30 days:\n$days_success = max(metrics.auth_attempts_success(\n        period:1d, window:30d,\n        metric:event_count_sum,\n        agg:num_metric_periods,\n        target.user.userid:$user\n))\nThe following rule tells you the first or last time a specific user logged in\nsuccessfully:\n$first_seen = max(metrics.auth_attempts_success(\n        period:1d, window:30d,\n        metric:first_seen,\n        agg:min,\n        target.user.userid:$user\n))\n$last_seen = max(metrics.auth_attempts_success(\n        period:1d, window:30d,\n        metric:last_seen,\n        agg:max,\n        target.user.userid:$user\n))\nThe following rule tells you the maximum number of bytes sent by a user in any\ngiven day over the last 30 days:\n$max_daily_bytes = max(metrics.network_bytes_outbound(\n        period:1d, window:30d,\n        metric:value_sum,\n        agg:max,\n        target.user.userid:$user\n))\nFilter\nFilters allow filtering a metric before aggregation by a value in the\npre-computed metric (see values in\nMetric\n). Filters can be any valid\nevents expression (a single line in the event section) which does not contain\nany event fields or placeholders. The only variables that can be included in\nthis condition are metric types.\nThe following rule includes only metrics where\nvalue_sum > 10 AND\nevent_count_sum > 2\n:\n$max_bytes_per_day = max(metrics.network_bytes_outbound(\n    period:1d, window:30d,\n    metric:value_sum,\n    agg:max,\n    principal.asset.ip:$ip\n    filter:value_sum > 10 AND event_count_sum > 2\n))\nValid examples of filters\nfilter:value_sum > 10 AND event_count_sum != 5\nfilter:event_count_sum = 100 OR event_count_sum > 1000\nfilter:timestamp.get_day_of_week(first_seen) = 3\nInvalid examples of filters\n// No placeholders in filter expressions.\nfilter:value_sum > $ph\n\n// No event fields in filter expressions.\nfilter:event_count_sum + $e.field > 10\n\n// No event fields in filter expressions.\nfilter:timestamp.subtract(first_seen, $e.metadata.timestamp)\nUDM fields\nA metric is filtered by 1, 2, or 3 UDM fields, depending on the function. For\nmore information, see\nFunctions\n.\nThe following types of UDM fields are used for metric functions:\nDimensions—(Required) Different combinations are listed in this\ndocumentation. You cannot join a metric with a default value (\n\"\"\nfor\nstring and\n0\nfor int).\nNamespaces—(Optional) You can only use namespaces for entities that\nyou specify in dimensions. For example, if you use\nprincipal.asset.hostname\nfilter\n, you can use a\nprincipal.namespace filter\nas well. If you don't\ninclude a namespace filter, the data across all namespaces is aggregated\ntogether. You can use a default value as a namespace filter.\nWindow calculations\nGoogle Security Operations calculates metrics using either a daily or hourly metric\nwindow.\nDaily windows\nAll daily windows, such as\n30d\n, are determined the same way.\nGoogle Security Operations uses the latest available metrics data that has been\ngenerated that does not overlap with the rule time range. Calculation of the\ndaily metrics can take up to 6 hours to complete and doesn't start until the end\nof the day in UTC. Metric data for the day before will be available at or\nbefore 6:00 UTC each day.\nFor example, for a rule that is running over event data from 2023-10-31 4:00 UTC\nto 2023-10-31 7:00 UTC, the daily metrics for 2023-10-31 will likely have been\ngenerated, so the metric calculation will use the data from 2023-10-01 to\n2023-10-30 (inclusive). Whereas for a rule that is running over event data from\n2023-10-31 1:00 UTC to 2023-10-31 3:00 UTC, the daily metrics for 2023-10-30\nwill likely not have been generated, so the metric calculation will use the data\nfrom 2023-09-30 to 2023-10-29 (inclusive).\nHourly\ntoday\nwindow\nThe hourly metric window is calculated differently from the window for\ndaily metrics. The hourly metric window of\ntoday\nis not a static size like the\n30d\nwindow for daily metrics. The hourly metric window\ntoday\nfills in as\nmuch data as possible between the end of the daily window and the start of the\nrule time window.\nFor example, for a rule that is running over event data from 2023-10-31 4:00:00\nUTC to 2023-10-31 7:00:00 UTC, the daily metric calculation will use the data\nfrom 2023-10-01 to 2023-10-30 (inclusive) and the hourly metric window will use\ndata from 2023-10-31 00:00:00 UTC to 2023-10-31 4:00:00 UTC.\nCount unique metrics\nThere is a special type of metric\nnum_unique_filter_values\nthat is not\npre-computed by Google SecOps\nand is instead computed during a rule execution. This is done by aggregating\nover an existing dimension in a pre-computed metric. For example, the metric\ndaily total count of distinct countries that a user attempted to authenticate\nin can be derived from the pre-computed\nauth_attempts_total\nmetric on the\ndimensions\ntarget.user.userid\nand\nprincipal.ip_geo_artifact.location.country_or_region\nby performing a count\nunique aggregation over the latter dimension.\nThe following example rule counts unique metrics:\n$outcome_variable = max(metrics.auth_attempts_total(\n    period: 1d,\n    window: 30d,\n    // This metric type indicates any filter with a wildcard value should be\n    // aggregated over each day to produce a new metric on-the-fly.\n    metric: num_unique_filter_values,\n    agg: max,\n    target.user.userid: $userid,\n    // Filter whose value should be counted over each day to produce the\n    // num_unique_filter_values metric.\n    principal.ip_geo_artifact.location.country_or_region: *\n))\nFunctions\nThis section includes documentation on the specific metrics functions supported\nby Google Security Operations.\nAlert Events\nmetrics.alert_event_name_count\nprecomputes historical values for UDM events\nthat have had alerts generated by Carbon Black, CrowdStrike Falcon, Microsoft\nGraph API Alerts, or Microsoft Sentinel.\nThe full list of UDM fields available as filters\nprincipal.asset.asset_id, principal.process.file.full_path, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.full_path, principal.user.employee_id, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.full_path, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.full_path, principal.user.userid, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.full_path, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.full_path, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.sha256, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.sha256, principal.user.employee_id, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.sha256, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.sha256, principal.user.userid, security_result.rule_name\nprincipal.asset.asset_id, principal.process.file.sha256, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.asset_id, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.full_path, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.full_path, principal.user.employee_id, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.full_path, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.full_path, principal.user.userid, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.full_path, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.full_path, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.sha256, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.sha256, principal.user.employee_id, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.sha256, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.sha256, principal.user.userid, security_result.rule_name\nprincipal.asset.hostname, principal.process.file.sha256, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.hostname, security_result.rule_name\nprincipal.asset.ip, principal.process.file.full_path, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.ip, principal.process.file.full_path, principal.user.employee_id, security_result.rule_name\nprincipal.asset.ip, principal.process.file.full_path, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.ip, principal.process.file.full_path, principal.user.userid, security_result.rule_name\nprincipal.asset.ip, principal.process.file.full_path, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.ip, principal.process.file.full_path, security_result.rule_name\nprincipal.asset.ip, principal.process.file.sha256, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.ip, principal.process.file.sha256, principal.user.employee_id, security_result.rule_name\nprincipal.asset.ip, principal.process.file.sha256, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.ip, principal.process.file.sha256, principal.user.userid, security_result.rule_name\nprincipal.asset.ip, principal.process.file.sha256, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.ip, security_result.rule_name\nprincipal.asset.mac, principal.process.file.full_path, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.mac, principal.process.file.full_path, principal.user.employee_id, security_result.rule_name\nprincipal.asset.mac, principal.process.file.full_path, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.mac, principal.process.file.full_path, principal.user.userid, security_result.rule_name\nprincipal.asset.mac, principal.process.file.full_path, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.mac, principal.process.file.full_path, security_result.rule_name\nprincipal.asset.mac, principal.process.file.sha256, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.mac, principal.process.file.sha256, principal.user.employee_id, security_result.rule_name\nprincipal.asset.mac, principal.process.file.sha256, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.mac, principal.process.file.sha256, principal.user.userid, security_result.rule_name\nprincipal.asset.mac, principal.process.file.sha256, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.mac, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.full_path, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.full_path, principal.user.employee_id, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.full_path, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.full_path, principal.user.userid, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.full_path, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.full_path, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.sha256, principal.user.email_addresses, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.sha256, principal.user.employee_id, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.sha256, principal.user.product_object_id, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.sha256, principal.user.userid, security_result.rule_name\nprincipal.asset.product_object_id, principal.process.file.sha256, principal.user.windows_sid, security_result.rule_name\nprincipal.asset.product_object_id, security_result.rule_name\nAuthentication Attempts\nmetrics.auth_attempts_total\nprecomputes historical values for UDM events with\na\nUSER_LOGIN\nevent\ntype\n.\nmetrics.auth_attempts_success\nfurther requires that the event had at least one\nSecurityResult.Action\nof\nALLOW\n.\nmetrics.auth_attempts_fail\nrequires instead that none of the\nSecurityResult.Actions\nwere\nALLOW\n.\nThe full list of UDM fields available as filters\nprincipal.asset.asset_id\nprincipal.asset.asset_id\n,\ntarget.asset.asset_id\nprincipal.asset.asset_id\n,\ntarget.asset.hostname\nprincipal.asset.asset_id\n,\ntarget.asset.ip\nprincipal.asset.asset_id\n,\ntarget.asset.mac\nprincipal.asset.asset_id\n,\ntarget.asset.product_object_id\nprincipal.asset.hostname\nprincipal.asset.hostname\n,\ntarget.asset.asset_id\nprincipal.asset.hostname\n,\ntarget.asset.hostname\nprincipal.asset.hostname\n,\ntarget.asset.ip\nprincipal.asset.hostname\n,\ntarget.asset.mac\nprincipal.asset.hostname\n,\ntarget.asset.product_object_id\nprincipal.asset.ip\nprincipal.asset.ip\n,\ntarget.asset.asset_id\nprincipal.asset.ip\n,\ntarget.asset.hostname\nprincipal.asset.ip\n,\ntarget.asset.ip\nprincipal.asset.ip\n,\ntarget.asset.mac\nprincipal.asset.ip\n,\ntarget.asset.product_object_id\nprincipal.asset.mac\nprincipal.asset.mac\n,\ntarget.asset.asset_id\nprincipal.asset.mac\n,\ntarget.asset.hostname\nprincipal.asset.mac\n,\ntarget.asset.ip\nprincipal.asset.mac\n,\ntarget.asset.mac\nprincipal.asset.mac\n,\ntarget.asset.product_object_id\nprincipal.asset.product_object_id\nprincipal.asset.product_object_id\n,\ntarget.asset.asset_id\nprincipal.asset.product_object_id\n,\ntarget.asset.hostname\nprincipal.asset.product_object_id\n,\ntarget.asset.ip\nprincipal.asset.product_object_id\n,\ntarget.asset.mac\nprincipal.asset.product_object_id\n,\ntarget.asset.product_object_id\nprincipal.user.email_addresses\nprincipal.user.email_addresses\n,\ntarget.asset.asset_id\nprincipal.user.email_addresses\n,\ntarget.asset.hostname\nprincipal.user.email_addresses\n,\ntarget.asset.ip\nprincipal.user.email_addresses\n,\ntarget.asset.mac\nprincipal.user.email_addresses\n,\ntarget.asset.product_object_id\nprincipal.user.employee_id\nprincipal.user.employee_id\n,\ntarget.asset.asset_id\nprincipal.user.employee_id\n,\ntarget.asset.hostname\nprincipal.user.employee_id\n,\ntarget.asset.ip\nprincipal.user.employee_id\n,\ntarget.asset.mac\nprincipal.user.employee_id\n,\ntarget.asset.product_object_id\nprincipal.user.product_object_id\nprincipal.user.product_object_id\n,\ntarget.asset.asset_id\nprincipal.user.product_object_id\n,\ntarget.asset.hostname\nprincipal.user.product_object_id\n,\ntarget.asset.ip\nprincipal.user.product_object_id\n,\ntarget.asset.mac\nprincipal.user.product_object_id\n,\ntarget.asset.product_object_id\nprincipal.user.userid\nprincipal.user.userid\n,\ntarget.asset.asset_id\nprincipal.user.userid\n,\ntarget.asset.hostname\nprincipal.user.userid\n,\ntarget.asset.ip\nprincipal.user.userid\n,\ntarget.asset.mac\nprincipal.user.userid\n,\ntarget.asset.product_object_id\nprincipal.user.windows_sid\nprincipal.user.windows_sid\n,\ntarget.asset.asset_id\nprincipal.user.windows_sid\n,\ntarget.asset.hostname\nprincipal.user.windows_sid\n,\ntarget.asset.ip\nprincipal.user.windows_sid\n,\ntarget.asset.mac\nprincipal.user.windows_sid\n,\ntarget.asset.product_object_id\ntarget.application\ntarget.user.email_addresses\ntarget.user.email_addresses\n,\nnetwork.tls.client.certificate.sha256\ntarget.user.email_addresses\n,\nprincipal.ip_geo_artifact.location.country_or_region\ntarget.user.email_addresses\n,\nprincipal.ip_geo_artifact.network.organization_name\ntarget.user.email_addresses\n,\ntarget.application\ntarget.user.employee_id\ntarget.user.employee_id\n,\nnetwork.tls.client.certificate.sha256\ntarget.user.employee_id\n,\nprincipal.ip_geo_artifact.location.country_or_region\ntarget.user.employee_id\n,\nprincipal.ip_geo_artifact.network.organization_name\ntarget.user.employee_id\n,\ntarget.application\ntarget.user.product_object_id\ntarget.user.product_object_id\n,\nnetwork.tls.client.certificate.sha256\ntarget.user.product_object_id\n,\nprincipal.ip_geo_artifact.location.country_or_region\ntarget.user.product_object_id\n,\nprincipal.ip_geo_artifact.network.organization_name\ntarget.user.product_object_id\n,\ntarget.application\ntarget.user.userid\ntarget.user.userid\n,\nnetwork.tls.client.certificate.sha256\ntarget.user.userid\n,\nprincipal.ip_geo_artifact.location.country_or_region\ntarget.user.userid\n,\nprincipal.ip_geo_artifact.network.organization_name\ntarget.user.userid\n,\ntarget.application\ntarget.user.windows_sid\ntarget.user.windows_sid\n,\nnetwork.tls.client.certificate.sha256\ntarget.user.windows_sid\n,\nprincipal.ip_geo_artifact.location.country_or_region\ntarget.user.windows_sid\n,\nprincipal.ip_geo_artifact.network.organization_name\ntarget.user.windows_sid\n,\ntarget.application\nmetrics.auth_attempts_total\nhas additional UDM fields available as filters\ntarget.application\n,\ntarget.asset.asset_id\ntarget.application\n,\ntarget.asset.hostname\ntarget.application\n,\ntarget.asset.ip\ntarget.application\n,\ntarget.asset.mac\ntarget.application\n,\ntarget.asset.product_object_id\nmetrics.auth_attempts_success\nhas additional UDM fields available as filters\nnetwork.http.user_agent\nprincipal.asset.asset_id\n,\nmetadata.event_type\nprincipal.asset.hostname\n,\nmetadata.event_type\nprincipal.asset.ip\n,\nmetadata.event_type\nprincipal.asset.mac\n,\nmetadata.event_type\nprincipal.asset.product_object_id\n,\nmetadata.event_type\nDNS Bytes Outbound\nmetrics.dns_bytes_outbound\nprecomputes historical values for UDM events where\nnetwork\n.sent_bytes\nis greater than 0,\nand the target port is\n53/udp\n,\n53/tcp\n, or\n3000/tcp\n.\nnetwork\n.sent_bytes\nis\navailable as\nvalue_sum\n.\nThe full list of UDM fields available as filters\nprincipal.asset.asset_id\nprincipal.asset.asset_id\n,\ntarget.ip\nprincipal.asset.hostname\nprincipal.asset.hostname\n,\ntarget.ip\nprincipal.asset.ip\nprincipal.asset.ip\n,\ntarget.ip\nprincipal.asset.mac\nprincipal.asset.mac\n,\ntarget.ip\nprincipal.asset.product_object_id\nprincipal.asset.product_object_id\n,\ntarget.ip\nprincipal.user.email_addresses\nprincipal.user.email_addresses\n,\ntarget.ip\nprincipal.user.employee_id\nprincipal.user.employee_id\n,\ntarget.ip\nprincipal.user.product_object_id\nprincipal.user.product_object_id\n,\ntarget.ip\nprincipal.user.userid\nprincipal.user.userid\n,\ntarget.ip\nprincipal.user.windows_sid\nprincipal.user.windows_sid\n,\ntarget.ip\ntarget.ip\nDNS Queries\nmetrics.dns_queries_total\nprecomputes historical values for UDM events that\nhave a value in\nnetwork\n.\ndns.id\n.\nmetrics.dns_queries_success\nfurther requires that the\nnetwork\n.\ndns.response_code\nwas\n0\n(\nNoError\n).\nmetrics.dns_queries_fail\nonly considers events with a\nnetwork\n.\ndns.response_code\ngreater than\n0\n.\nThe full list of UDM fields available as filters\nprincipal.asset.asset_id\nprincipal.asset.asset_id\n,\nnetwork.dns_domain\nprincipal.asset.asset_id\n,\nnetwork.dns.questions.type\nprincipal.asset.hostname\nprincipal.asset.hostname\n,\nnetwork.dns_domain\nprincipal.asset.hostname\n,\nnetwork.dns.questions.type\nprincipal.asset.ip\nprincipal.asset.ip\n,\nnetwork.dns_domain\nprincipal.asset.ip\n,\nnetwork.dns.questions.type\nprincipal.asset.mac\nprincipal.asset.mac\n,\nnetwork.dns_domain\nprincipal.asset.mac\n,\nnetwork.dns.questions.type\nprincipal.asset.product_object_id\nprincipal.asset.product_object_id\n,\nnetwork.dns_domain\nprincipal.asset.product_object_id\n,\nnetwork.dns.questions.type\nprincipal.user.email_addresses\nprincipal.user.email_addresses\n,\nnetwork.dns_domain\nprincipal.user.email_addresses\n,\nnetwork.dns.questions.type\nprincipal.user.employee_id\nprincipal.user.employee_id\n,\nnetwork.dns_domain\nprincipal.user.employee_id\n,\nnetwork.dns.questions.type\nprincipal.user.product_object_id\nprincipal.user.product_object_id\n,\nnetwork.dns_domain\nprincipal.user.product_object_id\n,\nnetwork.dns.questions.type\nprincipal.user.userid\nprincipal.user.userid\n,\nnetwork.dns_domain\nprincipal.user.userid\n,\nnetwork.dns.questions.type\nprincipal.user.windows_sid\nprincipal.user.windows_sid\n,\nnetwork.dns_domain\nprincipal.user.windows_sid\n,\nnetwork.dns.questions.type\nFile Executions\nmetrics.file_executions_total\nprecomputes historical values for UDM events\nwith a\nPROCESS_LAUNCH\nevent\ntype\n.\nmetrics.file_executions_success\nfurther requires that the event had at least\none\nSecurityResult.Action\nof\nALLOW\n.\nmetrics.file_executions_fail\ninstead requires that none of the\nSecurityResult.Actions\nwere\nALLOW\n.\nThe full list of UDM fields available as filters\nmetadata.event_type\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.asset.asset_id\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.asset.hostname\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.asset.ip\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.asset.mac\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.asset.product_object_id\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.user.email_addresses\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.user.employee_id\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.user.product_object_id\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.user.userid\n,\nprincipal.process.file.sha256\nmetadata.event_type\n,\nprincipal.user.windows_sid\n,\nprincipal.process.file.sha256\nHTTP Queries\nmetrics.http_queries_total\nprecomputes historical values for UDM events that\nhave a value in\nnetwork\n.\nhttp.method\n.\nmetrics.http_queries_success\nfurther requires that\nnetwork\n.\nhttp.response_code\nis less than 400.\nmetrics.http_queries_fail\nonly considers events with a\nnetwork\n.\nhttp.response_code\nis greater than or equal to 400.\nThe full list of UDM fields available as filters\nprincipal.asset.asset_id\nprincipal.asset.asset_id\n,\nnetwork.http.user_agent\nprincipal.asset.hostname\nprincipal.asset.hostname\n,\nnetwork.http.user_agent\nprincipal.asset.ip\nprincipal.asset.ip\n,\nnetwork.http.user_agent\nprincipal.asset.mac\nprincipal.asset.mac\n,\nnetwork.http.user_agent\nprincipal.asset.product_object_id\nprincipal.asset.product_object_id\n,\nnetwork.http.user_agent\nprincipal.user.email_addresses\nprincipal.user.email_addresses\n,\nnetwork.http.user_agent\nprincipal.user.employee_id\nprincipal.user.employee_id\n,\nnetwork.http.user_agent\nprincipal.user.product_object_id\nprincipal.user.product_object_id\n,\nnetwork.http.user_agent\nprincipal.user.userid\nprincipal.user.userid\n,\nnetwork.http.user_agent\nprincipal.user.windows_sid\nprincipal.user.windows_sid\n,\nnetwork.http.user_agent\nNetwork Bytes\nmetrics.network_bytes_inbound\nprecomputes historical values for UDM events\nthat have a non-zero value for\nnetwork\n.\nreceived_bytes\n,\nand makes that field available as\nvalue_sum\n.\nmetrics.network_bytes_outbound\nrequires a non-zero value for\nnetwork\n.\nsent_bytes\n, and\nmakes that field available as\nvalue_sum\n.\nmetrics.network_bytes_total\nconsiders events that have a non-zero value for\neither\nnetwork\n.received_bytes\nor\nnetwork\n.sent_bytes\n(or\nboth), and make the sum of those two fields available as\nvalue_sum\n.\nThe full list of UDM fields available as filters\nprincipal.asset.asset_id\nprincipal.asset.asset_id\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.asset.asset_id\n,\nsecurity_result.category\nprincipal.asset.asset_id\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.asset.hostname\nprincipal.asset.hostname\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.asset.hostname\n,\nsecurity_result.category\nprincipal.asset.hostname\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.asset.ip\nprincipal.asset.ip\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.asset.ip\n,\nsecurity_result.category\nprincipal.asset.ip\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.asset.mac\nprincipal.asset.mac\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.asset.mac\n,\nsecurity_result.category\nprincipal.asset.mac\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.asset.product_object_id\nprincipal.asset.product_object_id\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.asset.product_object_id\n,\nsecurity_result.category\nprincipal.asset.product_object_id\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.user.email_addresses\nprincipal.user.email_addresses\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.user.email_addresses\n,\nsecurity_result.category\nprincipal.user.email_addresses\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.user.employee_id\nprincipal.user.employee_id\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.user.employee_id\n,\nsecurity_result.category\nprincipal.user.employee_id\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.user.product_object_id\nprincipal.user.product_object_id\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.user.product_object_id\n,\nsecurity_result.category\nprincipal.user.product_object_id\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.user.userid\nprincipal.user.userid\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.user.userid\n,\nsecurity_result.category\nprincipal.user.userid\n,\ntarget.ip_geo_artifact.network.organization_name\nprincipal.user.windows_sid\nprincipal.user.windows_sid\n,\nprincipal.ip_geo_artifact.location.country_or_region\nprincipal.user.windows_sid\n,\nsecurity_result.category\nprincipal.user.windows_sid\n,\ntarget.ip_geo_artifact.network.organization_name\nResource Creation\nmetrics.resource_creation_total\nprecomputes historical values for UDM events\nwith a\nRESOURCE_CREATION\nevent\ntype\nor a\nUSER_RESOURCE_CREATION\nevent\ntype\n.\nFor a list of equivalent event types, see\nMetadata Event Types\nmetrics.resource_creation_success\nfurther requires that the event have at\nleast one\nSecurityResult.Action\nof\nALLOW\n.\nThe full list of UDM fields available as filters\nprincipal.user.email_addresses\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.email_addresses\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.employee_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.product_object_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.userid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.windows_sid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nResource Deletion\nmetrics.resource_deletion_success\nprecomputes historical values for UDM events\nwith a\nRESOURCE_DELETION\nevent\ntype\nand further\nrequires that the event have at least one\nSecurityResult.Actions\nof\nALLOW\n.\nThe full list of UDM fields available as filters\nprincipal.user.email_addresses\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.email_addresses\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.employee_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.product_object_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.userid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.windows_sid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nResource Read\nmetrics.resource_read_success\nprecomputes historical values for UDM events\nwith a\nRESOURCE_READ\nevent\ntype\nand further\nrequires that the event have at least one\nSecurityResult.Action\nof\nALLOW\n.\nmetrics.resource_read_fail\ninstead requires that none of the\nSecurityResult.Actions\nare\nALLOW\n.\nThe full list of UDM fields available as filters\nprincipal.user.email_addresses\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\nprincipal.ip\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.application\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.application\n,\ntarget.location.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.resource.name\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.email_addresses\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.employee_id\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.product_object_id\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.userid\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nprincipal.user.windows_sid\n,\ntarget.resource.name\n,\ntarget.resource_type\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.email_addresses\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.employee_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.product_object_id\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.userid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\ntarget.user.windows_sid\n,\nmetadata.vendor_name\n,\nmetadata.product_name\nLimitations with metrics\nWhen creating YARA-L rules with metrics, be aware of the following limitations:\nYou cannot join a metric with a default value (\n\"\"\nfor string and\n0\nfor\nint).\nDefault values:\nIf there is no metric data that corresponds to an event, the returned\nvalue from the metric function is 0.\nIf there is an event in the detection which has no metric data, using\nmin\nto aggregate over the function might return 0.\nTo check whether there is data for an event, you can use the metric\nnum_metric_periods\naggregation on that same event with the same filters.\nMetric functions can only be used in the outcome section.\nSince metric functions are only used in the outcome section, they must be\naggregated just like any other value in rules with a match section.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:15.798839Z"
}