{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/generate-yara-l-with-gemini/",
  "title": "Generate a YARA-L 2.0 rule using Gemini",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nGenerate a YARA-L 2.0 rule using Gemini\nSupported in:\nGoogle secops\nSIEM\nOn the Gemini pane, use a natural language prompt to generate a\nrule (for example,\nCreate a rule to count how many DNS responses were\ntruncated per principal asset host.\n), and then click\nEnter\n.\nGemini generates a rule to detect the behavior you've searched for\nin the Gemini pane.\nClick\nOpen in rule editor\nto view and modify the new rule in the Rules\nEditor. You can only create single-event rules using this feature.\nFor example, using the previous rule prompt, Gemini could generate\nthe following rule:\nrule gemini_rule {\n  meta:\n    author = \"Gemini in Google SecOps\"\n    description = \"Prompt: Create a rule to count how many DNS responses were truncated per principal asset host.\"\n\n  events:\n    $e.metadata.event_type = \"NETWORK_DNS\"\n    $e.network.dns.response = true\n    $e.network.dns.truncated = true\n    $ph_principal_asset_hostname = $e.principal.asset.hostname\n\n  match:\n    $ph_principal_asset_hostname over 1h\n\n  outcome:\n    $event_count = count($e.metadata.id)\n\n  condition:\n    $e\n}\nTo activate the rule, click\nSave New Rule\n. The rule appears in the list\nof rules to the left. Hold the pointer over the rule, click the menu icon,\nand toggle the\nLive Rule\noption to the right (green). For more\ninformation, see\nManage rules using Rules\nEditor\n.\nDelete a chat session\nYou can delete your chat conversation session or delete all chat sessions.\nGemini maintains all user conversation histories privately and adheres\nto Google Cloud's\nresponsible AI\npractices\n. User history is never used to train models.\nIn the Gemini pane, select\nDelete chat\nfrom the menu at the\ntop right.\nClick\nDelete chat\nat the bottom right to delete the current chat\nsession.\nOptional: To delete all chat sessions, select\nDelete all chat sessions\nand then click\nDelete all chats\n.\nProvide feedback\nYou can provide feedback to responses generated by the Gemini AI\ninvestigation assistance. Your feedback helps Google improve the feature and the\noutput generated by Gemini.\nIn the Gemini pane, click\nthumb_up\nThumb Up\nor\nthumb_down\nThumb Down\n.\nOptional: Click\nthumb_down\nThumb Down\nand provide feedback.\nClick\nSend feedback\n.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:11:49.774692Z"
}