{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/usecase-dlp-high-risk-user-download/",
  "title": "Use Sensitive Data Protection data in context-aware analytics",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse Sensitive Data Protection data in context-aware analytics\nSupported in:\nGoogle secops\nSIEM\nThis document demonstrates how to use entity context data from\nSensitive Data Protection\nand additional log sources\nto add contextual understanding about the impact and\nscope of a potential threat when performing an investigation.\nThe use case described in this document detects the execution of a malicious\nfile by a user (MITRE ATT&CK Technique\nT1204.002\n)\nand whether that user also has access to sensitive data elsewhere on the\nnetwork.\nThis example requires that the following data has been ingested and normalized\nin Google Security Operations:\nUser activity data using network and EDR logs.\nResource relationships from data sources like Google Cloud IAM Analysis.\nSensitive Data Protection logs that contain labels about the type and sensitivity of the stored data.\nGoogle SecOps must be able to parse the raw data into Unified Data Model (UDM)\nentity and event records.\nFor information about ingesting Sensitive Data Protection data into Google SecOps, see\nExporting Sensitive Data Protection data to Google SecOps\n.\nGoogle Cloud IAM Analysis data\nThe Google Cloud IAM Analysis log data in this example identifies users in the\norganization and captures relationships each user has to other systems on the\nnetwork. The following is a snippet of an IAM Analysis log stored as a UDM\nentity record. It stores information about the user,\nmikeross\n, who\nadministers a BigQuery table called\nanalytics:claim.patients\n.\nmetadata.vendor_name: \"Google Cloud Platform\"\nmetadata.product_name: \"GCP IAM Analysis\"\nmetadata.entity_type: \"USER\"\nentity.user.userid: \"mikeross\"\nrelations[2].entity.resource.name: \"analytics:claim.patients\"\nrelations[2].entity.resource.resource_type: \"TABLE\"\nrelations[2].entity_type: \"RESOURCE\"\nrelations[2].relationship: \"ADMINISTERS\"\nSensitive Data Protection data\nThe Sensitive Data Protection log data in this example stores information about a BigQuery\ntable. The following is a snippet of a Sensitive Data Protection log stored as a UDM entity\nrecord. It represents the BigQuery table called\nanalytics:claim.patients\nwith\nthe\nPredicted InfoType\nlabel\nUS_SOCIAL_SECURITY_NUMBER\n, indicating that the\ntable stores United States Social Security numbers.\nmetadata.vendor_name: \"Google Cloud Platform\"\nmetadata.product_name: \"GCP DLP CONTEXT\"\nmetadata.entity_type: \"RESOURCE\"\nmetadata.description: \"RISK_HIGH\"\nentity.resource.resource_type: \"TABLE\"\nentity.resource.resource_subtype: \"BigQuery Table\"\nentity.resource.attribute.cloud.environment\"GOOGLE_CLOUD_PLATFORM\"\nentity.resource.attribute.labels[0].key: \"Sensitivity Score\"\nentity.resource.attribute.labels[0].value: \"SENSITIVITY_HIGH\"\nentity.resource.attribute.labels[1].key: \"Predicted InfoType\"\nentity.resource.attribute.labels[1].value: \"US_SOCIAL_SECURITY_NUMBER\"\nentity.resource.product_object_id: \"analytics:claim.patients\"\nWeb proxy events\nThe web proxy event in this example captures network activity. The following\nsnippet is of a Zscaler web proxy log stored as a UDM event record. It captures\na network download event of an executable file by user with the\nuserid\nvalue\nmikeross\nwhere the\nreceived_bytes\nvalue is 514605.\nmetadata.log_type = \"ZSCALER_WEBPROXY\"\nmetadata.product_name = \"NSS\"\nmetadata.vendor_name = \"Zscaler\"\nmetadata.event_type = \"NETWORK_HTTP\"\nnetwork.http.response_code = 200\nnetwork.received_bytes = 514605\nprincipal.user.userid = \"mikeross\"\ntarget.url = \"http://manygoodnews.com/dow/Client%20Update.exe\"\nEDR events\nThe EDR event in this example captures activity on an endpoint device. The\nfollowing snippet is of a CrowdStrike Falcon EDR log stored as a UDM event\nrecord. It captures a network event involving the Microsoft Excel application\nand a user with the\nuserid\nvalue\nmikeross\n.\nmetadata.log_type = \"CS_EDR\"\nmetadata.product_name = \"Falcon\"\nmetadata.vendor_name = \"Crowdstrike\"\nmetadata.event_type = \"NETWORK_HTTP\"\ntarget.process.file.full_path = \"\\\\Device\\\\HarddiskVolume1\\\\Program Files\\\\C:\\\\Program Files\\\\Microsoft Office\\\\Office16\\\\EXCEL.exe\"\ntarget.url = \"http://manygoodnews.com/dow/Client%20Update.exe\"\ntarget.user.userid = \"mikeross\"\nNotice that there is common information across these records, both the user identifier\nmikeross\nand table name,\nanalytics:claim.patients\n. The next section in this document\ndemonstrates how these values are used in the rule to join the records.\nDetection engine rule in this example\nThis example rule detects the execution of a malicious file by a user (MITRE\nATT&CK Technique\nT1204.002\n.\nThe rule assigns a higher risk score to a detection when the user also has\naccess to sensitive data elsewhere on the network. The rule correlates the\nfollowing information:\nUser activity, such as the download or launch of an executable.\nThe relationship between resources, for example the user's relationship to a\nBigQuery table.\nPresence of sensitive information in the resource a user has access to, for\nexample the type of data stored in the BigQuery table.\nHere is a description of each section in the example rule.\nThe\nevents\nsection specifies the pattern of data that the rule looks\nfor and includes the following:\nGroup 1 and Group 2 identify network and EDR events that\ncapture the download of a large amount of data or an executable that is also related to\nactivity in the Excel application.\nGroup 3 identifies records where the user identified in the\nnetwork and EDR events also has permission to a BigQuery table.\nGroup 4 identifies Sensitive Data Protection records for the BigQuery table\nthat the user has access to.\nEach group of expressions uses either the\n$table_name\nvariable or the\n$user\nvariable\nto join records related to the same user and database table.\nIn the\noutcome\nsection, the rule creates a\n$risk_score\nvariable and sets a value\nbased on the sensitivity of the data in the table. In this case, it checks whether\nthe data is labeled with the\nUS_SOCIAL_SECURITY_NUMBER\nSensitive Data Protection infoType\n.\nThe\noutcome\nsection also sets additional variables such as\n$principalHostname\nand\n$entity_resource_name\n. These variables are\nreturned and stored with the detection, so that when you view it in Google SecOps you can\nalso display the variable values as columns.\nThe\ncondition\nsection indicates that the pattern looks for all UDM records specified\nin the\nevents\nsection.\nrule high_risk_user_download_executable_from_macro {\n meta:\n   author = \"Google Cloud Security Demos\"\n   description = \"Executable downloaded by Microsoft Excel from High Risk User\"\n   severity = \"High\"\n   technique = \"T1204.002\"\n\n events:\n   //Group 1. identify a proxy event with suspected executable download\n   $proxy_event.principal.user.userid = $user\n   $proxy_event.target.url =  /.*\\.exe$/ or\n   $proxy_event.network.received_bytes > 102400\n\n   //Group 2. correlate with an EDR event indicating Excel activity\n   $edr_event.target.user.userid  = $user\n   $edr_event.target.process.file.full_path = /excel/ nocase\n   $edr_event.metadata.event_type = \"NETWORK_HTTP\"\n\n   //Group 3. Use the entity to find the permissions\n   $user_entity.graph.entity.user.userid = $user\n   $user_entity.graph.relations.entity.resource.name = $table_name\n\n   //Group 4. the entity is from Cloud DLP data\n   $table_context.graph.entity.resource.product_object_id = $table_name\n   $table_context.graph.metadata.product_name = \"GCP DLP CONTEXT\"\n\n match:\n    $user over 5m\n\n outcome:\n   //calculate risk score\n   $risk_score = max(\n       if( $table_context.graph.entity.resource.attribute.labels.value = \"US_SOCIAL_SECURITY_NUMBER\", 80)\n       )\n   $technique = array_distinct(\"T1204.002\")\n   $principalHostname = array_distinct($proxy_event.principal.hostname)\n   $principalIp = array_distinct($proxy_event.principal.ip)\n   $principalMac = array_distinct($proxy_event.principal.mac)\n   $targetHostname = array_distinct($proxy_event.target.hostname)\n   $target_url = array_distinct($proxy_event.target.url)\n   $targetIp = array_distinct($proxy_event.target.ip)\n   $principalUserUserid =  array_distinct($proxy_event.principal.user.userid)\n   $entity_resource_name = array_distinct($table_context.graph.entity.resource.name)\n\ncondition:\n   $proxy_event and $edr_event and $user_entity and $table_context\n}\nAbout the detection\nIf you test the rule against existing data and it identifies the pattern of\nactivity specified in the definition, it generates a detection. The\nDetection\npanel displays the detection generated after testing the rule. The\nDetection\npanel also displays the event and entity records that caused the\nrule to create a detection. In this example, the following records are\ndisplayed:\nGoogle Cloud IAM Analysis UDM entity\nSensitive Data Protection UDM entity\nZscaler web proxy UDM event\nCrowdStrike Falcon EDR UDM event\nIn the\nDetection\npanel, select any event or entity record to see details.\nThe detection also stores the variables defined in the\noutcome\nsection of the rule. To display the variables in the\nDetection\npanel, select\nColumns\n, and then select one or more variable names from the\nColumns\nmenu. The selected columns appear in the\nDetection\npanel.\nWhat's next\nTo write custom rules, see\nOverview of the YARA-L 2.0 language\n.\nTo create custom context-aware analytics, see\nCreate context-aware analytics\nTo use predefined threat analytics, see\nUsing Google SecOps curated detections\n.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:06.257804Z"
}