{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/risk-analytics-ueba-category/",
  "title": "Overview of Risk Analytics for UEBA category",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nOverview of Risk Analytics for UEBA category\nSupported in:\nGoogle secops\nSIEM\nThis document provides an overview of the rule sets in the Risk Analytics for UEBA category, the\nrequired data, and configuration you can use to tune the alerts generated\nby each rule set. These rule sets help identify threats by evaluating the\nsupported log sources.\nRule set descriptions\nThe following rule sets are available in the Risk Analytics for UEBA category and are\ngrouped by the type of patterns detected:\nAuthentication\nNew Login by User to Device\n: a user logged in to a new device.\nAnomalous Authentication Events by User\n: a single user entity had anomalous\nauthentication events recently, compared to historical usage.\nFailed Authentications by Device\n: a single-device entity had many\nfailed login attempts recently, compared to historical usage.\nFailed Authentications by User\n: a single-user entity had many failed\nlogin attempts recently, compared to historical usage.\nNetwork traffic analysis\nAnomalous Inbound Bytes by Device\n: significant amount of data recently\nuploaded to single device entity, compared to historical usage.\nAnomalous Outbound Bytes by Device\n: significant amount of data recently\ndownloaded from a single device entity, compared to historical usage.\nAnomalous Total Bytes by Device\n: a device entity recently uploaded\nand downloaded a significant amount of data, compared to historical usage.\nAnomalous Inbound Bytes by User\n: a single-user entity recently downloaded\na significant amount of data, compared to historical usage.\nAnomalous Total Bytes by User\n: a user entity recently uploaded and\ndownloaded a significant amount of data recently, compared to historical usage.\nBrute Force then Successful Login by User\n: a single-user entity from one\nIP address had several failed authentication attempts to a certain application\nbefore successfully logging in.\nPeer group-based detections\nAnomalous or Excessive Logins for a Newly Created User\n: anomalous or excessive\nauthentication activity for a recently created user. This uses creation time from\nAD Context data.\nAnomalous or Excessive Suspicious Actions for a Newly Created User\n:\nanomalous or excessive activity (including, but not limited to, HTTP telemetry,\nprocess execution, and group modification) for a recently created\nuser. This uses creation time from AD Context data.\nSuspicious actions\nExcessive Account Creation by Device\n: a device entity created several\nnew user accounts.\nExcessive Alerts by User\n: a large number of security alerts from an antivirus\nor endpoint device (for example,\nconnection was blocked\n,\nmalware was detected\n)\nwere reported about a user entity, which was much greater than historical patterns.\nThese are events where the\nsecurity_result.action\nUDM field is set to\nBLOCK\n.\nData loss prevention-based detections\nAnomalous or Excessive Processes with Data Exfiltration Capabilities\n: anomalous or\nexcessive activity for processes associated with data exfiltration capabilities\nsuch as keyloggers, screenshots, and remote access. This uses file metadata enrichment\nfrom VirusTotal.\nRequired data needed by Risk Analytics for UEBA category\nThis section details the data required by each rule set category for optimal \nperformance. While UEBA detections are designed to work with all supported default \nparsers, using the following specific data types maximizes their benefit. \nFor a complete list of supported default parsers, see\nSupported log types and default parsers\n.\nAuthentication\nTo use any of these rule sets, collect log data from either\nAzure AD Directory Audit (\nAZURE_AD_AUDIT\n) or Windows Event (\nWINEVTLOG\n).\nFor\nWINEVTLOG\n, you must configure your data collection configuration to include the following Windows\nEvent IDs\nin the\nSecurity\nevent log\nChannel\n.\n These events map directly to the\nEvent types\n(for example,\nUSER_LOGIN\nor\nPROCESS_LAUNCH\n) used by the detection engine.\nWindows Event ID requirements\nEvent type\nWindows Event ID\nUSER_LOGIN\n529, 4624, 4625, 4626, 4648, 4672, 4768, 4769, 4770, 4771, 4777, 4820, 4821, 4964\nUSER_CREATION\n4720\nNETWORK_CONNECTION\n4096, 4097, 4321, 5156, 5632, 5633, 5157\nGROUP_MODIFICATION\n4728, 4729, 4732, 4733, 4735, 4737, 4745, 4746, 4747, 4750, 4751, 4752, 4755, 4756, 4757, 4760, 4761, 4762, 4764, 4784, 4785, 4786, 4787, 4788, 4791\nPROCESS_LAUNCH\n4688\nPROCESS_OPEN\n4663, 4670, 4691, 8002\nNetwork traffic analysis\nTo use any of these rule sets, collect log data that captures network activity.\nFor example, from devices such as FortiGate (\nFORTINET_FIREWALL\n),\nCheck Point (\nCHECKPOINT_FIREWALL\n), Zscaler (\nZSCALER_WEBPROXY\n), CrowdStrike Falcon (\nCS_EDR\n),\nor Carbon Black (\nCB_EDR\n).\nPeer group-based detections\nTo use any of these rule sets, collect log data from either\nAzure AD Directory Audit (\nAZURE_AD_AUDIT\n) or Windows Event (\nWINEVTLOG\n).\nSuspicious actions\nRule sets in this group each use a different type of data.\nExcessive Account Creation by Device rule set\nTo use this rule set, collect log data from either\nAzure AD Directory Audit (\nAZURE_AD_AUDIT\n) or Windows Event (\nWINEVTLOG\n).\nExcessive Alerts by User rule set\nTo use this rule set, collect log data that captures endpoint activities or\naudit data, such as that recorded by CrowdStrike Falcon (\nCS_EDR\n),\nCarbon Black (\nCB_EDR\n), or Azure AD Directory Audit (\nAZURE_AD_AUDIT\n).\nData loss prevention-based detections\nTo use any of these rule sets, collect log data that captures process and file activities,\nsuch as that recorded by CrowdStrike Falcon (\nCS_EDR\n), Carbon Black (\nCB_EDR\n),\nor SentinelOne EDR (\nSENTINEL_EDR\n).\nRule sets in this category depend on events with the following\nmetadata.event_type\nvalues:\nPROCESS_LAUNCH\n,\nPROCESS_OPEN\n,\nPROCESS_MODULE_LOAD\n.\nTuning alerts returned by rule sets this category\nYou can reduce the number of detections a rule or rule set generates using\nrule exclusions\n.\nA rule exclusion defines the criteria used to exclude an event from being evaluated by\nthe rule set, or by specific rules in the rule set. Create one or more rule exclusions\nto help reduce the volume of detections. See\nConfigure rule exclusions\nfor information about how to do this.\nExample of a rule for Risk Analytics for UEBA category\nThe following example shows how to create a rule to generate detections on\nany entity hostname whose risk score is greater than\n100\n:\nrule EntityRiskScore {\n  meta:\n  events:\n    $e1.principal.hostname != \"\"\n    $e1.principal.hostname = $hostname\n\n    $e2.graph.entity.hostname = $hostname\n    $e2.graph.risk_score.risk_window_size.seconds = 86400 // 24 hours\n    $e2.graph.risk_score.risk_score >= 100\n\n    // Run deduplication across the risk score.\n    $rscore = $e2.graph.risk_score.risk_score\n\n  match:\n    // Dedup on hostname and risk score across a 4 hour window.\n    $hostname, $rscore over 4h\n\n  outcome:\n    // Force these risk score based rules to have a risk score of zero to\n    // prevent self feedback loops.\n    $risk_score = 0\n\n  condition:\n    $e1 and $e2\n}\nThis example rule also performs a self deduplication using the match\nsection. If a rule detection might trigger, but the hostname and risk score\nremain unchanged within a 4-hour window, no new detections are created.\nThe only possible risk windows for entity risk score rules are either 24 hours\nor 7 days (86,400 or 604,800 seconds respectively). If you don't include the\nrisk window size in the rule, the rule returns inaccurate results.\nEntity risk score data is stored separately from entity context data. To use\nboth in a rule, the rule must have two separate entity events, one for the\nentity context and one for the entity risk score, as shown as in the following\nexample:\nrule EntityContextAndRiskScore {\n  meta:\n  events:\n    $log_in.metadata.event_type = \"USER_LOGIN\"\n    $log_in.principal.hostname = $host\n\n    $context.graph.entity.hostname = $host\n    $context.graph.metadata.entity_type = \"ASSET\"\n\n    $risk_score.graph.entity.hostname = $host\n    $risk_score.graph.risk_score.risk_window_size.seconds = 604800\n\n  match:\n    $host over 2m\n\n  outcome:\n    $entity_risk_score = max($risk_score.graph.risk_score.normalized_risk_score)\n\n  condition:\n    $log_in and $context and $risk_score and $entity_risk_score > 100\n}\nWhat's next\nInvestigate risk using the Risk Analytics dashboard\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:34.381058Z"
}