{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/use-enriched-data-in-rules/",
  "title": "Use context-enriched data in rules",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse context-enriched data in rules\nSupported in:\nGoogle secops\nSIEM\nTo enable security analysts during an investigation, Google Security Operations ingests contextual\ndata from different sources, performs analysis on the ingested data, and\nprovides additional context about artifacts in a customer environment. This\ndocument provides examples of how analysts use contextually-enriched data\nin Detection Engine rules.\nFor more information about data enrichment, see\nHow Google SecOps enriches event and entity data\n.\nUse prevalence enriched fields in rules\nThe following examples demonstrate how to use the prevalence-related enriched\nfields in Detection Engine. For reference, see the list of\nprevalence-related enriched fields\n.\nIdentify low prevalence domain access\nThis detection rule generates a detection event, not a detection alert, when a match is found. It is primarily meant as a secondary indicator when\ninvestigating an asset. For example, there are other higher severity alerts that triggered an incident.\n$enrichment.graph.metadata.entity_type = \"FILE\"\n$enrichment.graph.metadata.product_name = \"VirusTotal Relationships\"\n$enrichment.graph.metadata.vendor_name = \"VirusTotal\"\nSee\nAdd an event type filter\nfor more information about adding a filter to improve rule performance.\nFor information about each enrichment type, see\nHow Google SecOps enriches event and entity data\n.\nUse prevalence enriched fields in rules\nThe following examples demonstrate how to use the prevalence-related enriched\nfields in Detection Engine. For reference, see the list of\nprevalence-related enriched fields\n.\nIdentify access to domains with a low prevalence score\nThis rule can be used to detect access to domains with a low prevalence score.\nTo be effective, a baseline of prevalence scores for artifacts must exist. The\nfollowing example uses\nreference lists\nto tune the result and applies a\nthreshold prevalence value.\nrule network_prevalence_low_prevalence_domain_access {\n  meta:\n    author = \"Google Security Operations\"\n    description = \"Detects access to a low prevalence domain. Requires baseline of prevalence be in place for effective deployment.\"\n    severity = \"LOW\"\n\n  events:\n        $e.metadata.event_type = \"NETWORK_HTTP\"\n        $e.principal.ip = $ip\n\n        // filter out URLs with RFC 1918 IP addresses, internal assets\n        not re.regex($e.target.hostname, `(127(?:\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$)|(10(?:\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$)|(192\\.168(?:\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){2}$)|(172\\.(?:1[6-9]|2\\d|3[0-1])(?:\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){2})`)\n\n        // used an explicit exclusion reference list\n        not $e.target.hostname in %exclusion_network_prevalence_low_prevalence_domain_access\n\n        // only match valid FQDN, filter out background non-routable noise\n        re.regex($e.target.hostname, `(?:[a-z0-9](?:[a-z0-9-]{0,61}[a-z0-9])?\\.)+[a-z0-9][a-z0-9-]{0,61}[a-z0-9]`)\n\n        $domainName = $e.target.hostname\n\n        //join event ($e) to entity graph ($d)\n        $e.target.hostname = $d.graph.entity.domain.name\n\n        $d.graph.metadata.entity_type = \"DOMAIN_NAME\"\n\n        // tune prevalence as fits your results\n        $d.graph.entity.domain.prevalence.rolling_max > 0\n        $d.graph.entity.domain.prevalence.rolling_max <= 10\n\n  match:\n        $ip over 1h\n\n  outcome:\n    $risk_score = max(\n        // increment risk score based upon rolling_max prevalence\n        if ( $d.graph.entity.domain.prevalence.rolling_max >= 10, 10) +\n        if ( $d.graph.entity.domain.prevalence.rolling_max >= 2 and $d.graph.entity.domain.prevalence.rolling_max <= 9 , 20) +\n        if ( $d.graph.entity.domain.prevalence.rolling_max = 1, 30)\n    )\n\n    $domain_list = array_distinct($domainName)\n    $domain_count = count_distinct($domainName)\n\n  condition:\n    $e and #d > 10\n}\nIdentify low prevalence domains with an IOC match\nThis detection rule generates a detection alert and provides a high fidelity\nmatch comparing a low prevalence domain that is also a known IOC.\nrule network_prevalence_uncommon_domain_ioc_match {\n\n  meta:\n    author = \"Google Security Operations\"\n    description = \"Lookup Network DNS queries against Entity Graph for low prevalence domains with a matching IOC entry.\"\n    severity = \"MEDIUM\"\n\n  events:\n    $e.metadata.event_type = \"NETWORK_DNS\"\n    $e.network.dns.questions.name = $hostname\n\n    //only match FQDNs, such as: exclude chrome dns access tests and other internal hosts\n    $e.network.dns.questions.name = /(?:[a-z0-9](?:[a-z0-9-]{0,61}[a-z0-9])?\\.)+[a-z0-9][a-z0-9-]{0,61}[a-z0-9]/\n\n    //prevalence entity graph lookup\n    $p.graph.metadata.entity_type = \"DOMAIN_NAME\"\n    $p.graph.entity.domain.prevalence.rolling_max > 0\n    $p.graph.entity.domain.prevalence.rolling_max <= 3\n    $p.graph.entity.domain.name = $hostname\n\n    //ioc entity graph lookup\n    $i.graph.metadata.vendor_name = \"ET_PRO_IOC\"\n    $i.graph.metadata.entity_type = \"DOMAIN_NAME\"\n    $i.graph.entity.hostname = $hostname\n\n  match:\n    $hostname over 10m\n\n  outcome:\n    $risk_score = max(\n        //increment risk score based upon rolling_max prevalence\n        if ( $p.graph.entity.domain.prevalence.rolling_max = 3, 50) +\n        if ( $p.graph.entity.domain.prevalence.rolling_max = 2, 70) +\n        if ( $p.graph.entity.domain.prevalence.rolling_max = 1, 90)\n    )\n\n  condition:\n    $e and $p and $i\n}\nUse an entity's first seen time in a rule\nYou can write rules that include the\nfirst_seen_time\nor\nlast_seen_time\nfields\nfrom entity records.\nThe\nfirst_seen_time\nand\nlast_seen_time\nfields are populated with entities that\ndescribe a domain, IP address, and file (hash). For entities that describe a user\nor asset, only the\nfirst_seen_time\nfield is populated. These values are not\ncalculated for entities that describe other types, such as a group or resource.\nFor a list of UDM fields that are populated, see\nCalculate the first seen and last seen time of entities\n.\nHere is an example showing how to use the\nfirst_seen_time\nin a rule:\nrule first_seen_data_exfil {\n    meta:\n        author = \"Google Security Operations\"\n        description = \"Example usage first_seen data\"\n        severity = \"LOW\"\n\n    events:\n        $first_access.metadata.event_type = \"NETWORK_HTTP\"\n        $ip = $first_access.principal.ip\n\n        // Join first_access event with entity graph to use first/last seen data.\n        $ip = $first_last_seen.graph.entity.ip\n        $first_last_seen.graph.metadata.entity_type = \"IP_ADDRESS\"\n\n        // Check that the first_access UDM event is the first_seen occurrence in the enterprise.\n        $first_last_seen.graph.entity.artifact.first_seen_time.seconds = $first_access.metadata.event_timestamp.seconds\n        $first_last_seen.graph.entity.artifact.first_seen_time.nanos   = $first_access.metadata.event_timestamp.nanos\n\n        // Check for another access event that appears shortly after the first_seen event,\n        // where lots of data is being sent.\n        $next_access_data_exfil.metadata.event_type = \"NETWORK_CONNECTION\"\n        // Next access event goes to the same IP as the first.\n        $next_access_data_exfil.principal.ip = $ip\n\n        // Next access occurs within 60 seconds after first access.\n        $next_access_data_exfil.metadata.event_timestamp.seconds > $first_access.metadata.event_timestamp.seconds\n        60 > $next_access_data_exfil.metadata.event_timestamp.seconds  - $first_access.metadata.event_timestamp.seconds\n\n        // Lots of data is being sent over the next access event.\n        $next_access_data_exfil.network.sent_bytes > 10 * 1024 * 1024 * 1024 // 10GB\n\n        // Extract hostname of next access event, for match section.\n        $hostname = $next_access_data_exfil.principal.hostname\n\n    match:\n        $hostname over 1h\n\n    condition:\n        $first_access and $next_access_data_exfil and $first_last_seen\n}\nUse geolocation-enriched fields in rules\nUDM fields that store geolocation-enriched data can be used in Detection Engine rules.\nFor a list of UDM fields that are populated, see\nEnrich events with geolocation data\n.\nThe following example illustrates how to detect if a user entity is authenticating\nfrom multiple distinct states.\nrule geoip_user_login_multiple_states_within_1d {\n\n  meta:\n    author = \"Google Security Operations\"\n    description = \"Detect multiple authentication attempts from multiple distinct locations using geolocation-enriched UDM fields.\"\n    severity = \"INFORMATIONAL\"\n\n  events:\n    $geoip.metadata.event_type = \"USER_LOGIN\"\n    (\n      $geoip.metadata.vendor_name = \"Google Workspace\" or\n      $geoip.metadata.vendor_name = \"Google Cloud Platform\"\n    )\n    /* optionally, detect distinct locations at a country */\n    (\n      $geoip.principal.ip_geo_artifact.location.country_or_region != \"\" and\n      $geoip.principal.ip_geo_artifact.location.country_or_region = $country\n    )\n    (\n      $geoip.principal.ip_geo_artifact.location.state != \"\" and\n      $geoip.principal.ip_geo_artifact.location.state = $state\n    )\n\n    $geoip.target.user.email_addresses = $user\n\n  match:\n    $user over 1d\n\n  condition:\n    $geoip and #state > 1\n}\nUse Safe Browsing enriched fields in rules\nGoogle SecOps ingests data from threat lists related to file hashes.\nThis enriched information is stored as Entities in Google SecOps.\nFor a list of UDM fields that are populated, see\nEnrich entities with information from Safe Browsing threat lists\n.\nYou can create Detection Engine rules to identify matches against entities\ningested from Safe Browsing. The following is an example Detection Engine\nrule that queries against this enriched information to build context-aware analytics.\nrule safe_browsing_file_execution {\n    meta:\n        author = \"Google Security Operations\"\n        description = \"Example usage of Safe Browsing data, to detect execution of a file that's been deemed malicious\"\n        severity = \"LOW\"\n\n    events:\n        // find a process launch event, match on hostname\n        $execution.metadata.event_type = \"PROCESS_LAUNCH\"\n        $execution.principal.hostname = $hostname\n\n        // join execution event with Safe Browsing graph\n        $sb.graph.entity.file.sha256 = $execution.target.process.file.sha256\n\n        // look for files deemed malicious\n        $sb.graph.metadata.entity_type = \"FILE\"\n        $sb.graph.metadata.threat.severity = \"CRITICAL\"\n        $sb.graph.metadata.product_name = \"Google Safe Browsing\"\n        $sb.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n\n    match:\n        $hostname over 1h\n\n    condition:\n        $execution and $sb\n}\nUse WHOIS enriched fields in a rule\nYou can write rules that search WHOIS enriched fields in entities that\nrepresent a domain. These entities have the\nentity.metadata.entity_type\nfield\nset to\nDOMAIN_NAME\n. For a list of UDM fields that are populated, see\nEnrich entities with WHOIS data\n.\nThe following is an example rule showing how to do this. This rule includes the\nfollowing filter fields in the\nevents\nsection to help optimize performance of the rule.\n$whois.graph.metadata.entity_type = \"DOMAIN_NAME\"\n$whois.graph.metadata.product_name = \"WHOISXMLAPI Simple Whois\"\n$whois.graph.metadata.vendor_name = \"WHOIS\"\nrule whois_expired_domain_executable_download {\n meta:\n   author = \"Google Security Operations\"\n   description = \"Example usage of WHOIS data, detecting an executable file download from a domain that's recently expired\"\n   severity = \"LOW\"\n\n events:\n        $access.metadata.event_type = \"NETWORK_HTTP\"\n        $hostname = $access.principal.hostname\n\n        // join access event to entity graph to use WHOIS data\n        $whois.graph.entity.domain.name = $access.target.hostname\n\n        // use WHOIS data to look for expired domains\n        $whois.graph.metadata.entity_type = \"DOMAIN_NAME\"\n        $whois.graph.metadata.product_name = \"WHOISXMLAPI Simple Whois\"\n        $whois.graph.metadata.vendor_name = \"WHOIS\"\n        $whois.graph.entity.domain.expiration_time.seconds < $access.metadata.event_timestamp.seconds\n\n        // join access event with executable file creation event by principal hostname\n        $creation.principal.hostname = $access.principal.hostname\n        $creation.metadata.event_type = \"FILE_CREATION\"\n        $creation.target.file.full_path = /exe/ nocase\n\n        // file creation comes after expired domain access\n        $creation.metadata.event_timestamp.seconds >\n           $access.metadata.event_timestamp.seconds\n\n   match:\n       $hostname over 1h\n\n condition:\n        $access and $whois and $creation\n}\nQuery Google Cloud Threat Intelligence data\nGoogle SecOps ingests data from Google Cloud Threat Intelligence (GCTI)\ndata sources that provide you with contextual information you can use when\ninvestigating activity in your environment. You can query the following data sources:\nGCTI Tor Exit Nodes\nGCTI Benign Binaries\nGCTI Remote Access Tools\nFor a description of these threat feeds and all fields populated, see\nIngest and store Google Cloud Threat Intelligence data\n.\nIn this document, the placeholder\n<variable_name>\nrepresents the unique variable name\nused in a rule to identify a UDM record.\nQuery Tor exit node IP addresses\nThe following example rule returns a detection when a\nNETWORK_CONNECTION\nevent contains an IP address stored in the\ntarget.ip\nfield that is also found\nin the GCTI\nTor Exit Nodes\ndata source. Make sure to include the\n<variable_name>.graph.metadata.threat.threat_feed_name\n,\n<variable_name>.graph.metadata.vendor_name\n,\nand\n<variable_name>.graph.metadata.product_name\nfields in the rule.\nThis is a timed data source. Events will match with the snapshot of the data source at\nthat point in time.\nrule gcti_tor_exit_nodes {\n  meta:\n    author = \"Google Cloud Threat Intelligence\"\n    description = \"Alert on known Tor exit nodes.\"\n    severity = \"High\"\n\n  events:\n    // Event\n    $e.metadata.event_type = \"NETWORK_CONNECTION\"\n    $e.target.ip = $tor_ip\n\n    // Tor IP search in GCTI Feed\n    $tor.graph.entity.artifact.ip = $tor_ip\n    $tor.graph.metadata.entity_type = \"IP_ADDRESS\"\n    $tor.graph.metadata.threat.threat_feed_name = \"Tor Exit Nodes\"\n    $tor.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n    $tor.graph.metadata.vendor_name = \"Google Cloud Threat Intelligence\"\n    $tor.graph.metadata.product_name = \"GCTI Feed\"\n\n  match:\n    $tor_ip over 1h\n\n  outcome:\n    $tor_ips = array_distinct($tor_ip)\n    $tor_geoip_country = array_distinct($e.target.ip_geo_artifact.location.country_or_region)\n    $tor_geoip_state = array_distinct($e.target.ip_geo_artifact.location.state)\n\n  condition:\n    $e and $tor\n}\nQuery for benign operating system files\nThe following example rule combines the\nBenign Binaries\nand\nTor Exit Nodes\ndata sources\nto return an alert when a benign binary contacts a Tor exit node. The rule calculates\na risk score using the\ngeolocation data\nthat Google SecOps enriched using the target IP address. Make sure to include the\n<variable_name>.graph.metadata.vendor_name\n,\n<variable_name>.graph.metadata.product_name\n,\nand\n<variable_name>.graph.metadata.threat.threat_feed_name\nfor both the\nBenign Binaries\nand\nTor Exit Nodes\ndata sources in the rule.\nThis is a timeless data source. Events will always match with the latest snapshot\nof the data source, regardless of time.\nrule gcti_benign_binaries_contacts_tor_exit_node {\n meta:\n   author = \"Google Cloud Threat Intelligence\"\n   description = \"Alert on Benign Binary contacting a Tor IP address.\"\n   severity = \"High\"\n\n events:\n   // Event\n   $e.metadata.event_type = \"NETWORK_CONNECTION\"\n   $e.principal.process.file.sha256 = $benign_hash\n   $e.target.ip = $ip\n   $e.principal.hostname = $hostname\n\n   // Benign File search in GCTI Feed\n   $benign.graph.entity.file.sha256 = $benign_hash\n   $benign.graph.metadata.entity_type = \"FILE\"\n   $benign.graph.metadata.threat.threat_feed_name = \"Benign Binaries\"\n   $benign.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n   $benign.graph.metadata.vendor_name = \"Google Cloud Threat Intelligence\"\n   $benign.graph.metadata.product_name = \"GCTI Feed\"\n\n   // Tor IP search in GCTI Feed\n   $tor.graph.entity.artifact.ip = $ip\n   $tor.graph.metadata.entity_type = \"IP_ADDRESS\"\n   $tor.graph.metadata.threat.threat_feed_name = \"Tor Exit Nodes\"\n   $tor.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n   $tor.graph.metadata.vendor_name = \"Google Cloud Threat Intelligence\"\n   $tor.graph.metadata.product_name = \"GCTI Feed\"\n\n match:\n   $hostname over 1h\n\n outcome:\n   $risk_score = max(\n       if($tor.graph.metadata.threat.confidence = \"HIGH_CONFIDENCE\", 70) +\n       // Unauthorized target geographies\n       if($e.target.ip_geo_artifact.location.country_or_region = \"Cuba\", 20) +\n       if($e.target.ip_geo_artifact.location.country_or_region = \"Iran\", 20) +\n       if($e.target.ip_geo_artifact.location.country_or_region = \"North Korea\", 20) +\n       if($e.target.ip_geo_artifact.location.country_or_region = \"Russia\", 20) +\n       if($e.target.ip_geo_artifact.location.country_or_region = \"Syria\", 20)\n   )\n   $benign_hashes = array_distinct($benign_hash)\n   $benign_files = array_distinct($e.principal.process.file.full_path)\n   $tor_ips = array_distinct($ip)\n   $tor_geoip_country = array_distinct($e.target.ip_geo_artifact.location.country_or_region)\n   $tor_geoip_state = array_distinct($e.target.ip_geo_artifact.location.state)\n\n condition:\n   $e and $benign and $tor\n}\nQuery data about remote access tools\nThe following example rule returns a detection when a\nPROCESS_LAUNCH\nevent type\ncontains a hash that is also found in the Google Cloud Threat Intelligence\nRemote Access Tools data source.\nThis is a timeless data source. Events will always match with the latest snapshot of\nthe data source, regardless of time.\nrule gcti_remote_access_tools {\n meta:\n   author = \"Google Cloud Threat Intelligence\"\n   description = \"Alert on Remote Access Tools.\"\n   severity = \"High\"\n\n events:\n    // find a process launch event\n    $e.metadata.event_type = \"PROCESS_LAUNCH\"\n    $e.target.process.file.sha256 != \"\"\n    $rat_hash = $e.target.process.file.sha256\n\n    // join graph and event hashes\n    $gcti.graph.entity.file.sha256 = $rat_hash\n\n    // look for files identified as likely remote access tools\n    $gcti.graph.metadata.entity_type = \"FILE\"\n    $gcti.graph.metadata.vendor_name = \"Google Cloud Threat Intelligence\"\n    $gcti.graph.metadata.product_name = \"GCTI Feed\"\n    $gcti.graph.metadata.threat.threat_feed_name = \"Remote Access Tools\"\n\n  match:\n    $rat_hash over 5m\n\n outcome:\n   $remote_hash = array_distinct($e.target.process.file.sha256)\n\n  condition:\n    $e and $gcti\n\n}\nUse VirusTotal enriched metadata fields in rules\nThe following rule detects file creation or process launch of a specific file\ntype, indicating that some watchlisted hashes are on the system. The risk score\nis set when the files are tagged as\nexploit\nusing VirusTotal file metadata\nenrichment.\nFor a list of all UDM fields that are populated, see\nEnrich events with VirusTotal file metadata\n.\nrule vt_filemetadata_hash_match_ioc {\n meta:\n   author = \"Google Cloud Threat Intelligence\"\n   description = \"Detect file/process events that indicate watchlisted hashes are on a system\"\n   severity = \"High\"\n\n events:\n   // Process launch or file creation events\n   $process.metadata.event_type = \"PROCESS_LAUNCH\" or $process.metadata.event_type =\"FILE_CREATION\"\n   $process.principal.hostname = $hostname\n   $process.target.file.sha256 != \"\"\n   $process.target.file.sha256 = $sha256\n   $process.target.file.file_type = \"FILE_TYPE_DOCX\"\n\n   // IOC matching\n   $ioc.graph.metadata.product_name = \"MISP\"\n   $ioc.graph.metadata.entity_type = \"FILE\"\n   $ioc.graph.metadata.source_type = \"ENTITY_CONTEXT\"\n   $ioc.graph.entity.file.sha256 = $sha256\n\n match:\n   $hostname over 15m\n\n outcome:\n   $risk_score = max(\n       // Tag enrichment from VirusTotal file metadata\n       if($process.target.file.tags = \"exploit\", 90)\n   )\n   $file_sha256 = array($process.target.file.sha256)\n   $host = array($process.principal.hostname)\n\n condition:\n   $process and $ioc\n}\nUse VirusTotal relationship data in rules\nGoogle SecOps ingests data from VirusTotal related connections. This data\nprovides information about the relation between file hashes and files, domains,\nIP addresses, and URLs. This enriched information is stored as Entities in Google SecOps.\nYou can create Detection Engine rules to identify matches against entities ingested\nfrom VirusTotal. The following rule sends an alert on downloading a known file hash\nfrom a known IP address with VirusTotal relationships. The risk score is based on\nfile type and tags from VirusTotal file metadata.\nThis data is only available for certain VirusTotal and Google SecOps licenses. \nCheck your entitlements with your account manager. For a list\nof all UDM fields that are populated, see\nEnrich entities with VirusTotal relationship data\n.\nrule virustotal_file_downloaded_from_url {\n  meta:\n    author = \"Google Cloud Threat Intelligence\"\n    description = \"Alerts on downloading a known file hash from a known IP with VirusTotal relationships. The risk score is based on file type and tags from VirusTotal file metadata.\"\n    severity = \"High\"\n\n  events:\n    // Filter network HTTP events\n    $e1.metadata.event_type = \"NETWORK_HTTP\"\n    $e1.principal.user.userid = $userid\n    $e1.target.url = $url\n\n    // Filter file creation events\n    $e2.metadata.event_type = \"FILE_CREATION\"\n    $e2.target.user.userid = $userid\n    $e2.target.file.sha256 = $file_hash\n\n    // The file creation event timestamp should be equal or greater than the network http event timestamp\n    $e1.metadata.event_timestamp.seconds <= $e2.metadata.event_timestamp.seconds\n\n    // Join event file hash with VirusTotal relationships entity graph\n    $vt.graph.metadata.entity_type = \"FILE\"\n    $vt.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n    $vt.graph.metadata.vendor_name = \"VirusTotal\"\n    $vt.graph.metadata.product_name = \"VirusTotal Relationships\"\n    $vt.graph.entity.file.sha256 = $file_hash\n\n    // Join network HTTP target URL with VirusTotal relationships entity graph\n    $vt.graph.relations.entity_type = \"URL\"\n    $vt.graph.relations.relationship = \"DOWNLOADED_FROM\"\n    $vt.graph.relations.entity.url = $url\n\n  match:\n    $userid over 1m\n\n  outcome:\n      $risk_score = max(\n        // Tag enrichment from VirusTotal file metadata\n        if($e2.target.file.tags = \"via-tor\" or $e2.target.file.tags = \"malware\" or $e2.target.file.tags = \"crypto\", 50) +\n        // File types enrichment from VirusTotal file metadata\n        if($e2.target.file.file_type = \"FILE_TYPE_HTML\", 5) +\n        if($e2.target.file.file_type = \"FILE_TYPE_ELF\", 10) +\n        if($e2.target.file.file_type = \"FILE_TYPE_PE_DLL\",15) +\n        if($e2.target.file.file_type = \"FILE_TYPE_PE_EXE\", 20)\n    )\n\n  condition:\n    $e1 and $e2 and $vt and $risk_score >= 50\n}\nEventual consistency\nEnrichment-dependent rules rely on additional data to be processed before a rule can be fully evaluated. Over time, the enrichment process completes and the rule is re-evaluated with the latest, accurate data. This process of eventual consistency is expected and means that while there might be initial inconsistencies, the system ensures that all events will eventually be fully enriched and rules will be accurately evaluated. Learn\nhow Google SecOps enriches event and entity data\n.\nWhat's next\nFor information about how to use enriched data with other Google SecOps\nfeatures, see the following:\nUse context-enriched data in UDM Search\n.\nUse context-enriched data in reports\n.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:07.492710Z"
}