{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/yara-l-best-practices/",
  "title": "YARA-L 2.0 rule structure and best practices",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nYARA-L 2.0 rule structure and best practices\nSupported in:\nGoogle secops\nSIEM\nThis document describes Google Security Operations's recommended best practices for writing rules in YARA-L 2.0.\nFilter out zero values\nFields might be automatically omitted in the events you run your rules against. When fields are omitted, they default to their zero values.\nFor example, an omitted string value defaults to\n\"\"\n.\nIf you equate two fields that are both omitted, they might both default to their zero values. This might lead to unintended matches where two fields match because they both have zero values. You can avoid this behavior by explicitly specifying the zero value.\nFor example, if you have a rule that equates two events based on two fields, there is a chance that both of those fields are empty, causing a match:\n$e1.field1 = $e2.field2\nIf both\ne1.field1\nand\ne2.field2\nare omitted in the data,\n\"\" = \"\"\nis true, causing a match.\nThe following comparison expressions ensure that you don't get a match because\ne1.field1\nand\ne2.field2\ndon't include any data:\n$e1.field1 = $e2.field2\n $e1.field != \"\"\nZero values and enrichment-dependent rules\nIf a rule depends on enriched data it hasn't been updated yet, the value might be null or zero.\nTherefore, it is good practice to filter out zero values (null checks) on enrichment-dependent rules. Learn\nhow Google SecOps enriches event and entity data\nand\nhow to use context-enriched data in rules\n.\nAdd an event type filter\nIn the following example, the IP addresses for each UDM event are checked against\nthe reference list, consuming a lot of resources:\nevents:\n// For every UDM event, check if the target.ip is listed in\n// the suspicious_ip_addresses reference list.\n$e.target.ip in %suspicious_ip_addresses\nIf your YARA-L rule only detects on UDM events of a certain event type, adding an event type filter can help to optimize your rule by reducing the number of events the rule needs to evaluate.\nevents:\n// For every UDM event of type NETWORK_DNS, check if the target.ip is\n// listed in the suspicious_ip_addresses reference list.\n$e.metadata.event_type = \"NETWORK_DNS\"\n$e.target.ip in %suspicious_ip_addresses\nAdd these filters to the beginning of the events section. You should also put equality filters before regular expression or other comparisons. Filters are applied in the order they appear in the rule.\nFor Community blogs on working with YARA-L, see:\nYARA-L basics\nYARA-L rule variables\nYARA-L operators and modifiers\nBuilding a single event rule using a regular expression\nAggregating events in rules\nSetting a threshold in conditions\nRules editor navigation\nYARA-L Rule Options\nBuilding a Single Event Rule - String Match\nBuilding a Multi Event Rule - Joining Events\nBuilding a Multi Event Rule - Ordering Events\nBuilding a Multi Event Rule - Multiple Joins and Counts in Conditions\nBuilding a Multi Event Rule - Sliding Windows\nIntroducing Outcomes in a Single Event Rule\nOutcomes in a Multi Event Rule - Counts\nOutcomes in Multi Event Rules - Arrays\nOutcomes in a Multi Event Rule - Max, Min, Sum\nOutcomes - Risk Score, Conditional Logic and Mathematical Operators\nFunctions - strings.concat\nFunctions - strings.coalesce\nFunctions - Network\nReference List\nCIDR Reference Lists\nRegex Reference Lists\nStrings Function - Upper or Lower Case\nRegular Expression Function - re.regex\nRegular Expression Function - re.capture\nString Function - strings.base64_decode\nRegular Expression Function - re.replace\nGetting started with Statistical Search\nStatistical Search - More Than a Count\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:14:12.656094Z"
}