{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/yara-l-2-0-overview/",
  "title": "Examples: YARA-L 2.0 queries",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nExamples: YARA-L 2.0 queries\nSupported in:\nGoogle secops\nSIEM\nThe following examples show queries written in YARA-L 2.0. Each example demonstrates how to correlate events within the query rule language.\nRules and tuning\nThe following rule checks for specific patterns in event data and creates a detection\nif it finds the patterns. This rule includes a variable\n$e1\nfor tracking event\ntype and\nmetadata.event_type\nUDM field. The rule checks for specific occurrences\nof regular expression matches with\ne1\n. When the event\n$e1\ntakes place, a detection is created.\nA\nnot\ncondition is included in the rule to exclude certain non-malicious paths.\nYou can add\nnot\nconditions to prevent false positives.\nrule suspicious_unusual_location_svchost_execution\n{\n\n meta:\n   author = \"Google Cloud Security\"\n   description = \"Windows 'svchost' executed from an unusual location\"\n   yara_version = \"YL2.0\"\n   rule_version = \"1.0\"\n\n events:\n\n   $e1.metadata.event_type = \"PROCESS_LAUNCH\"\n   re.regex($e1.principal.process.command_line, `\\bsvchost(\\.exe)?\\b`) nocase\n   not re.regex($e1.principal.process.command_line, `\\\\Windows\\\\System32\\\\`) nocase\n\ncondition:\n\n   $e1\n}\nLogins from different cities\nThe following rule searches for users that have logged in to your enterprise from two or more cities in less than 5 minutes:\nrule DifferentCityLogin {\n  meta:\n\n  events:\n    $udm.metadata.event_type = \"USER_LOGIN\"\n    $udm.principal.user.userid = $user\n    $udm.principal.location.city = $city\n\n  match:\n    $user over 5m\n\n  condition:\n    $udm and #city > 1\n}\nMatch variable\n:\n$user\nEvent variable\n:\n$udm\nPlaceholder variable\n:\n$city\nand\n$user\nThe following describes how this rule works:\nGroups events with username (\n$user\n) and returns it (\n$user\n) when a match is found.\nTimespan is 5 minutes, meaning only events that are less than 5 minutes apart are correlated.\nSearching for an event group (\n$udm\n) whose event type is\nUSER_LOGIN\n.\nFor that event group, the rule calls the user ID as\n$user\nand the login city as\n$city\n.\nReturns a match if the distinct number of\ncity\nvalues (denoted by\n#city\n) is greater than 1 in the event group (\n$udm\n) within the 5 minute time range.\nRapid user creation and deletion\nThe following rule searches for users that have been created and then deleted within 4 hours:\nrule UserCreationThenDeletion {\n  meta:\n\n  events:\n    $create.target.user.userid = $user\n    $create.metadata.event_type = \"USER_CREATION\"\n\n    $delete.target.user.userid = $user\n    $delete.metadata.event_type = \"USER_DELETION\"\n\n    $create.metadata.event_timestamp.seconds <=\n       $delete.metadata.event_timestamp.seconds\n\n  match:\n    $user over 4h\n\n  condition:\n    $create and $delete\n}\nEvent variables\n:\n$create\nand\n$delete\nMatch variable\n:\n$user\nPlaceholder variable\n: N/A\nThe following describes how this rule works:\nGroups events with username (\n$user\n) and returns it (\n$user\n) when a match is found.\nTime window is 4 hours, meaning only events separated by less than 4 hours are correlated.\nSearches for two event groups (\n$create\nand\n$delete\n, where\n$create\nis equivalent to\n#create >= 1\n).\n$create\ncorresponds to\nUSER_CREATION\nevents and calls the user ID as\n$user\n.\n$user\nis used to join the two groups of events together.\n$delete\ncorresponds to\nUSER_DELETION\nevents and calls the user ID as\n$user\n. This rule looks for a match where the user identifier in the two event groups is the same.\nThis rule looks for cases where the event from\n$delete\nhappens later than the event from\n$create\n, returning a match when discovered.\nSingle event rule\nSingle event rules are rules that correlate over a single event. A single event rule can be:\nAny rule without a match section.\nRule with a\nmatch\nsection and a\ncondition\nsection only checking for the existence of 1 event (for example, \"$e\", \"#e > 0\", \"#e >= 1\", \"1 <= #e\", \"0 < #e\").\nFor example, the following rule searches for a user login event and would return the first one it encounters within the enterprise data stored within your Google SecOps account:\nrule SingleEventRule {\n  meta:\n    author = \"noone@altostrat.com\"\n\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n\n  condition:\n    $e\n}\nThis example shows a single-event rule that uses the\nmatch\nsection to find any user with at least one login event occurring within a 5-minute time window.It checks for the existence of a user login event.\nrule SingleEventRule {\n  meta:\n    author = \"alice@example.com\"\n    description = \"windowed single event example rule\"\n\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n    $e.principal.user.userid = $user\n\n  match:\n    $user over 5m\n\n  condition:\n    #e > 0\n}\nrule MultiEventRule{\n  meta:\n    author = \"alice@example.com\"\n    description = \"Rule with outcome condition and simple existence condition on one event variable\"\n\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n    $e.principal.user.userid = $user\n\n  match:\n    $user over 10m\n\n  outcome:\n    $num_events_in_match_window = count($e.metadata.id)\n\n  condition:\n    #e > 0 and $num_events_in_match_window >= 10 // Could be rewritten as #e >= 10\n}\nMultiple event rule\nUse multiple event rules to group many events over a specified time window and try to find correlations between events. A typical multiple event rule will have the following:\nA\nmatch\nsection which specifies the time range over which events need to be grouped.\nA\ncondition\nsection specifying what condition should trigger the detection and checking for the existence of multiple events.\nFor example, the following rule searches for a user who has logged in at least 10 times in less than 10 minutes:\nrule MultiEventRule {\n  meta:\n    author = \"noone@altostrat.com\"\n\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n    $e.principal.user.userid = $user\n\n  match:\n    $user over 10m\n\n  condition:\n    #e >= 10\n}\nSingle event within a range of IP addresses\nThe following example shows a single event rule that searches for matches\nbetween two specific hostnames and a specific range of IP addresses:\nrule OrsAndNetworkRange {\n  meta:\n    author = \"noone@altostrat.com\"\n\n  events:\n    // Checks CIDR ranges.\n    net.ip_in_range_cidr($e.principal.ip, \"203.0.113.0/24\")\n\n    // Detection when the hostname field matches either value using or.\n    $e.principal.hostname = /pbateman/ or $e.principal.hostname = /sspade/\n\n  condition:\n    $e\n}\nany and all rule example\nThe following rule searches for login events where all source IP addresses don't match an IP address known to be secure within a timespan of 5 minutes.\nrule SuspiciousIPLogins {\n  meta:\n    author = \"alice@example.com\"\n\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n\n    // Detects if all source IP addresses in an event don't match \"100.97.16.0\"\n    // For example, if an event has source IP addresses\n    // [\"100.97.16.1\", \"100.97.16.2\", \"100.97.16.3\"],\n    // it will be detected since \"100.97.16.1\", \"100.97.16.2\",\n    // and \"100.97.16.3\" all don't match \"100.97.16.0\".\n\n    all $e.principal.ip != \"100.97.16.0\"\n\n    // Assigns placeholder variable $ip to the $e.principal.ip repeated field.\n    // There will be one detection per source IP address.\n    // For example, if an event has source IP addresses\n    // [\"100.97.16.1\", \"100.97.16.2\", \"100.97.16.3\"],\n    // there will be one detection per address.\n\n    $e.principal.ip = $ip\n\n  match:\n    $ip over 5m\n\n  condition:\n    $e\n}\nRegular expressions in a rule\nThe following YARA-L 2.0 regular expression example searches for events with emails received from the altostrat.com domain. Since\nnocase\nhas been added to the\n$host\nvariable\nregex\ncomparison and the\nregex\nfunction, both these comparisons are case insensitive.\nrule RegexRuleExample {\n  meta:\n    author = \"noone@altostrat.com\"\n\n  events:\n    $e.principal.hostname = $host\n    $host = /.*HoSt.*/ nocase\n    re.regex($e.network.email.from, `.*altostrat\\.com`) nocase\n\n  match:\n    $host over 10m\n\n  condition:\n    #e > 10\n}\nComposite rule examples\nComposite detections enhance threat detection by using composite rules.\nThese composite rules use detections from other rules as their input. This enables\nthe detection of complex threats that individual rules might not detect. For\nmore information, see\nOverview of composite detections\n.\nTripwire detections\nTripwire composite detections are the simplest form of a composite detection\nthat operates on fields within detection findings, such as outcome variables or\nrule metadata. They help filter detections for conditions that may indicate\nhigher risk, such as an administrator user or a production environment.\nrule composite_admin_detection {\n  meta:\n    rule_name = \"Detection with Admin User\"\n    author = \"Google Cloud Security\"\n    description = \"Composite rule that looks for any detections where the actor is an admin user\"\n    severity = \"Medium\"\n\n  events:\n    $rule_name = $d.detection.detection.rule_name\n    $principal_user = $d.detection.detection.outcomes[\"principal_users\"]\n    $principal_user = /admin|root/ nocase\n\n  match:\n    $principal_user over 1h\n\n  outcome:\n    $risk_score = 75\n    $upstream_rules = array_distinct($rule_name)\n\n  condition:\n    $d\n}\nThreshold and aggregation detections\nAggregation composite detection rules let you group detection findings based\non shared attributes, such as a hostname or username, and analyze the aggregated\ndata. The following are common use cases:\nIdentifying users who generate a high volume of security alerts or aggregated risk.\nDetecting hosts with unusual activity patterns by aggregating related detections.\nRisk aggregation example\nrule composite_risk_aggregation {\n  meta:\n    rule_name = \"Risk Aggregation Composite\"\n    author = \"Google Cloud Security\"\n    description = \"Composite detection that aggregates risk of a user over 48 hours\"\n    severity = \"High\"\n\n  events:\n    $rule_name = $d.detection.detection.rule_name\n    $principal_user = $d.detection.detection.outcomes[\"principal_users\"]\n    $risk = $d.detection.detection.risk_score\n\n  match:\n    $principal_user over 48h\n\n  outcome:\n    $risk_score = 90\n    $cumulative_risk = sum($risk)\n    $principal_users = array_distinct($principal_users)\n    $upstream_rules = array_distinct($rule_name)\n\n  condition:\n    $d and $cumulative_risk > 500\n}\nTactic aggregation example\nrule composite_tactic_aggregation {\n  meta:\n    rule_name = \"MITRE Tactic Aggregation Composite\"\n    author = \"Google Cloud Security\"\n    description = \"Composite detection that detects if a user has triggered detections over multiple mitre tactics.\"\n    severity = \"Medium\"\n\n  events:\n    $principal_user = $d.detection.detection.outcomes[\"principal_users\"]\n    $tactic = $d.detection.detection.rule_labels[\"tactic\"]\n    $rule_name = $d.detection.detection.rule_name\n\n  match:\n    $principal_user over 48h\n\n  outcome:\n    $mitre_tactics_count = count_distinct($tactic)\n    $mitre_tactics = array_distinct($tactic)\n    $raw_score = 50 + (15 * $mitre_tactics_count)\n    $risk_score = if($raw_score > 100, 100, $raw_score)\n    $upstream_rules = array_distinct($rule_name)\n\n  condition:\n    $d and $mitre_tactics_count > 1\n}\nSequential composite detections\nSequential composite detections identify patterns of related events where the\nsequence of detections is important, such as a brute-force login attempt\ndetection, followed by a successful login. These patterns can involve multiple\nbase detections or a combination of base detections and events.\nrule composite_bruteforce_login {\n  meta:\n    rule_name = \"Bruteforce Login Composite\"\n    author = \"Google Cloud Security\"\n    description = \"Detects when an IP address associated with a Workspace brute force attempt successfully logs in\"\n    severity = \"High\"\n\n  events:\n    $bruteforce_detection.detection.detection.rule_name = /Workspace Anomalous Failed Logins/\n    $bruteforce_ip = $d.detection.detection.outcomes[\"principal_ips\"]\n\n    $login_event.metadata.product_name = \"login\"\n    $login_event.metadata.product_event_type = \"login_success\"\n    $login_event.metadata.vendor_name = \"Google Workspace\"\n    $login_ip = $login_event.principal.ip\n\n    // Ensure the brute force detection and successful login occurred from the same IP\n    $login_ip = $bruteforce_ip\n\n    $target_account = $login_event.target.user.email_addresses\n\n    // Ensure the brute force detection occurred before the successful login\n    $bruteforce_detection.detection.detection_time.seconds < $login_event.metadata.event_timestamp.seconds\n\n  match:\n    $bruteforce_ip over 24h\n\n  outcome:\n    $risk_score = 90\n    $principal_users = array_distinct($target_account)\n\n  condition:\n    $bruteforce_detection and $login_event\n}\nContext-aware detections\nContext-aware composite detections enrich detections with additional context,\nsuch as IP addresses found in threat feeds.\nrule composite_tor_enrichment {\n  meta:\n    rule_name = \"Detection with IP from TOR Feed\"\n    author = \"Google Cloud Security\"\n    description = \"Adds additional context from the TOR intel feed to detections\"\n    severity = \"High\"\n\n  events:\n    $detection_ip = $d.detection.detection.outcomes[\"principal_ips\"]\n    $gcti.graph.metadata.entity_type = \"IP_ADDRESS\"\n    $gcti.graph.metadata.vendor_name = \"Google Cloud Threat Intelligence\"\n    $gcti_feed.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n    $gcti.graph.metadata.product_name = \"GCTI Feed\"\n    $gcti.graph.metadata.threat.threat_feed_name = \"Tor Exit Nodes\"\n\n    $detection_ip = $gcti.graph.entity.ip\n\n    $rule_name = $d.detection.detection.rule_name\n    $risk = $d.detection.detection.outcomes[\"risk_score\"]\n\n  match:\n    $detection_ip, $rule_name over 1h\n\n  outcome:\n    $risk_score = 80\n    $upstream_rule = array_distinct($rule_name)\n\n  condition:\n    $d and $gcti\n}\nCo-occurrence detections\nCo-occurrence composite detections are a form of aggregation that can detect a\ncombination of related events, such as a combination of privilege escalation\nand data exfiltration detections triggered by a user.\nrule composite_privesc_exfil_sequential {\n  meta:\n    rule_name = \"Privilege Escalation and Exfiltration Composite\"\n    author = \"Google Cloud Security\"\n    description = \"Looks for a detection sequence of privilege escalation followed by exfiltration.\"\n    severity = \"High\"\n\n  events:\n    $privilege_escalation.detection.detection.rule_labels[\"tactic\"] = \"TA0004\"\n    $exfiltration.detection.detection.rule_labels[\"tactic\"] = \"TA0010\"\n\n    $pe_user = $privilege_escalation.detection.detection.outcomes[\"principal_users\"]\n    $ex_user = $exfiltration.detection.detection.outcomes[\"principal_users\"]\n\n    $pe_user = $ex_user\n\n  match:\n    $pe_user over 48h\n\n  outcome:\n    $risk_score = 75\n    $privesc_rules = array_distinct($privilege_escalation.detection.detection.rule_name)\n    $exfil_rules = array_distinct($exfiltration.detection.detection.rule_name)\n\n  condition:\n    $privilege_escalation and $exfiltration\n}\nSliding window rule example\nThe following YARA-L 2.0 sliding window example searches for the absence of\nfirewall_2\nevents after\nfirewall_1\nevents. The\nafter\nkeyword is used with\nthe pivot event variable\n$e1\nto specify that only 10 minute windows after each\nfirewall_1\nevent should be checked when correlating events.\nrule SlidingWindowRuleExample {\n  meta:\n    author = \"alice@example.com\"\n\n  events:\n    $e1.metadata.product_name = \"firewall_1\"\n    $e1.principal.hostname = $host\n\n    $e2.metadata.product_name = \"firewall_2\"\n    $e2.principal.hostname = $host\n\n  match:\n    $host over 10m after $e1\n\n  condition:\n    $e1 and !$e2\n}\nZero value exclusion example\nRules Engine implicitly filters out the zero values for all placeholders\nthat are used in the\nmatch\nsection. Use the\nallow_zero_values\noption to disable.\nFor more information, see\nZero values in match section\n.\nHowever, for other referenced event fields, zero values aren't excluded unless you explicitly specify such conditions.\nrule ExcludeZeroValues {\n  meta:\n    author = \"alice@example.com\"\n\n  events:\n    $e1.metadata.event_type = \"NETWORK_DNS\"\n    $e1.principal.hostname = $hostname\n\n    // $e1.principal.user.userid may be empty string.\n    $e1.principal.user.userid != \"Guest\"\n\n    $e2.metadata.event_type = \"NETWORK_HTTP\"\n    $e2.principal.hostname = $hostname\n\n    // $e2.target.asset_id cannot be empty string as explicitly specified.\n    $e2.target.asset_id != \"\"\n\n  match:\n    // $hostname cannot be empty string. The rule behaves as if the\n    // predicate, `$hostname != \"\"` was added to the events section, because\n    // `$hostname` is used in the match section.\n    $hostname over 1h\n\n  condition:\n    $e1 and $e2\n}\nRule with\noutcome\nsection example\nYou can add the optional\noutcome\nsection in a YARA-L 2.0 rule to extract\nadditional information of each detection. In the condition section, you can also specify\nconditionals on outcome variables. You can use the\noutcome\nsection of a detection\n rule to set variables for downstream consumption. For example, you can set a\n severity score based on data from the events being analyzed.\nFor more information, see the following:\nOutcome section syntax\nCondition section syntax\nContext-aware analysis,\noutcome\nsection\nMulti-event rule with\noutcome\nsection\nThe following rule looks at two events to get the value of\n$hostname\n. If the value of\n$hostname\nmatches over a 5-minute period,\nthen a severity score is applied. When including a time period in the\nmatch\nsection,\nthe rule checks within the specified time period.\nrule OutcomeRuleMultiEvent {\n    meta:\n      author = \"Google Cloud Security\"\n    events:\n      $u.udm.principal.hostname = $hostname\n      $asset_context.graph.entity.hostname = $hostname\n\n      $severity = $asset_context.graph.entity.asset.vulnerabilities.severity\n\n    match:\n      $hostname over 5m\n\n    outcome:\n      $risk_score =\n        max(\n            100\n          + if($hostname = \"my-hostname\", 100, 50)\n          + if($severity = \"HIGH\", 10)\n          + if($severity = \"MEDIUM\", 5)\n          + if($severity = \"LOW\", 1)\n        )\n\n      $asset_id_list =\n        array(\n          if($u.principal.asset_id = \"\",\n             \"Empty asset id\",\n             $u.principal.asset_id\n          )\n        )\n\n      $asset_id_distinct_list = array_distinct($u.principal.asset_id)\n\n      $asset_id_count = count($u.principal.asset_id)\n\n      $asset_id_distinct_count = count_distinct($u.principal.asset_id)\n\n    condition:\n      $u and $asset_context and $risk_score > 50 and not arrays.contains($asset_id_list, \"id_1234\")\n}\nrule OutcomeRuleMultiEvent {\n    meta:\n      author = \"alice@example.com\"\n    events:\n      $u.udm.principal.hostname = $hostname\n      $asset_context.graph.entity.hostname = $hostname\n\n      $severity = $asset_context.graph.entity.asset.vulnerabilities.severity\n\n    match:\n      $hostname over 5m\n\n    outcome:\n      $total_network_bytes = sum($u.network.sent_bytes) + sum($u.network.received_bytes)\n\n      $risk_score = if(total_network_bytes > 1024, 100, 50) +\n        max(\n          if($severity = \"HIGH\", 10)\n          + if($severity = \"MEDIUM\", 5)\n          + if($severity = \"LOW\", 1)\n        )\n\n      $asset_id_list =\n        array(\n          if($u.principal.asset_id = \"\",\n             \"Empty asset id\",\n             $u.principal.asset_id\n          )\n        )\n\n      $asset_id_distinct_list = array_distinct($u.principal.asset_id)\n\n      $asset_id_count = count($u.principal.asset_id)\n\n      $asset_id_distinct_count = count_distinct($u.principal.asset_id)\n\n    condition:\n      $u and $asset_context and $risk_score > 50 and not arrays.contains($asset_id_list, \"id_1234\")\n}\nSingle-event rule with\noutcome\nsection\nrule OutcomeRuleSingleEvent {\n    meta:\n        author = \"alice@example.com\"\n    events:\n        $u.metadata.event_type = \"FILE_COPY\"\n        $u.principal.file.size = $file_size\n        $u.principal.hostname = $hostname\n\n    outcome:\n        $suspicious_host = $hostname\n        $admin_severity = if($u.principal.userid in %admin_users, \"SEVERE\", \"MODERATE\")\n        $severity_tag = if($file_size > 1024, $admin_severity, \"LOW\")\n\n    condition:\n        $u\n}\nRefactor a multi-event outcome rule into a single-event outcome rule\nYou can use the\noutcome\nsection for both single-event rules (rules without a\nmatch\nsection), and multi-event rules (rules with a\nmatch\nsection).\nIf you previously designed a rule to be multi-event just so you could\nuse the outcome section, you can optionally refactor those rules by deleting\nthe\nmatch\nsection to improve performance. Be aware that because your rule no\nlonger has a\nmatch\nsection that applies grouping,\nyou might receive more detections. This refactor is only\npossible for rules that use one event variable as shown in the\nfollowing example.\nMulti-event outcome rule which uses only one event variable (a\ngood candidate for a refactor):\nrule OutcomeMultiEventPreRefactor {\n    meta:\n      author = \"alice@example.com\"\n      description = \"Outcome refactor rule, before the refactor\"\n\n    events:\n      $u.udm.principal.hostname = $hostname\n\n    match:\n      $hostname over 5m\n\n    outcome:\n      $risk_score = max(if($hostname = \"my-hostname\", 100, 50))\n\n    condition:\n      $u\n}\nYou can refactor the rule by deleting the\nmatch\nsection. Note that you\nmust also remove the aggregate in the\noutcome\nsection since the rule will now be\nsingle-event. For more information on aggregations, see\noutcome aggregations\n.\nrule OutcomeSingleEventPostRefactor {\n    meta:\n      author = \"alice@example.com\"\n      description = \"Outcome refactor rule, after the refactor\"\n\n    events:\n      $u.udm.principal.hostname = $hostname\n\n    // We deleted the match section.\n\n    outcome:\n      // We removed the max() aggregate.\n      $risk_score = if($hostname = \"my-hostname\", 100, 50)\n\n    condition:\n      $u\n}\nFunction to placeholder rule example\nYou can assign a placeholder variable to the result of a function call and\ncan use the placeholder variable in other sections of the rule, such as the\nmatch\nsection,\noutcome\nsection, or\ncondition\nsection. See the following example:\nrule FunctionToPlaceholderRule {\n    meta:\n      author = \"alice@example.com\"\n      description = \"Rule that uses function to placeholder assignments\"\n\n    events:\n        $u.metadata.event_type = \"EMAIL_TRANSACTION\"\n\n        // Use function-placeholder assignment to extract the\n        // address from an email.\n        // address@website.com -> address\n        $email_to_address_only = re.capture($u.network.email.from , \"(.*)@\")\n\n        // Use function-placeholder assignment to normalize an email:\n        // uid@??? -> uid@company.com\n        $email_from_normalized = strings.concat(\n            re.capture($u.network.email.from , \"(.*)@\"),\n            \"@company.com\"\n        )\n\n        // Use function-placeholder assignment to get the day of the week of the event.\n        // 1 = Sunday, 7 = Saturday.\n        $dayofweek = timestamp.get_day_of_week($u.metadata.event_timestamp.seconds)\n\n    match:\n        // Use placeholder (from function-placeholder assignment) in match section.\n        // Group by the normalized from email, and expose it in the detection.\n        $email_from_normalized over 5m\n\n    outcome:\n        // Use placeholder (from function-placeholder assignment) in outcome section.\n        // Assign more risk if the event happened on weekend.\n        $risk_score = max(\n            if($dayofweek = 1, 10, 0) +\n            if($dayofweek = 7, 10, 0)\n        )\n\n    condition:\n        // Use placeholder (from function-placeholder assignment) in condition section.\n        // Match if an email was sent to multiple addresses.\n        #email_to_address_only > 1\n}\nOutcome conditionals example rule\nIn the\ncondition\nsection, you can use outcome variables that were defined\nin the\noutcome\nsection. The following example demonstrates how to filter on\nrisk scores to reduce noise in detections by using outcome conditionals.\nrule OutcomeConditionalRule {\n    meta:\n        author = \"alice@example.com\"\n        description = \"Rule that uses outcome conditionals\"\n\n    events:\n        $u.metadata.event_type = \"FILE_COPY\"\n        $u.principal.file.size = $file_size\n        $u.principal.hostname = $hostname\n\n        // 1 = Sunday, 7 = Saturday.\n        $dayofweek = timestamp.get_day_of_week($u.metadata.collected_timestamp.seconds)\n\n    outcome:\n        $risk_score =\n            if($file_size > 500*1024*1024, 2) + // Files 500MB are moderately risky\n            if($file_size > 1024*1024*1024, 3) + // Files over 1G get assigned extra risk\n            if($dayofweek=1 or $dayofweek=7, 4) + // Events from the weekend are suspicious\n            if($hostname = /highly-privileged/, 5) // Check for files from highly privileged devices\n\n    condition:\n        $u and $risk_score >= 10\n}\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:11:33.245035Z"
}