{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/default-rules/",
  "title": "Default detection rules",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nDefault detection rules\nSupported in:\nGoogle secops\nSIEM\nYARA-L rules language\nYARA-L is a detection rules language developed by Google. The purpose of YARA-L\nis to move away from detections as just data queries to actual event-driven\ninvestigations. YARA-L is derived from the YARA language commonly used in\nmalware analysis. The\nL\nstands for logs. YARA-L enables you to take advantage\nof all the information from multiple sources within detections, and correlate\nthose events into actionable alerts. For more information, see the\nOverview of\nthe YARA-L 2.0 language\n.\nGoogle Security Operations sample detection rules\nTo help accelerate your adoption of the Google SecOps Detection Engine,\nthere is a\nGitHub repository with sample\nrules\n. This repository contains\nseveral different categories of detection rules, including the following:\nGoogle Cloud CloudAudit\nGoogle Workspace\nInformational warnings\nMalware\nMITRE ATT&CK\nSOC prime rules\nSuspicious events\nEach category takes a specific approach in how it views data sources and\nspecifies what events and matching statements to use.\nExample rules and tuning\nThe following rule creates an event variable\n$e1\nwhich is used to track the\nevent type. The event variable can be any value which has meaning to the data\nbeing evaluated. The UDM field being evaluated in this event is\nmetadata.eventype\nso it makes sense to just call it\ne1\n. The next lines\nsearches for specific occurrences of regular expression matches within\ne1\n. The condition that\ncreates a detection in Google SecOps is any time the event\n$e1\ntakes\nplace. For tuning purposes, a\nnot\ncondition is provided to exclude certain\nnon-malicious paths for the command line argument. Further\nnot\nconditions\ncould be added to this rule if you identify frequent false positives coming from\nother known file paths.\nrule suspicious_unusual_location_svchost_execution\n\n{\n meta:\n   author = \"Google Cloud Security\"\n   description = \"Windows 'svchost' executed from an unusual location\"\n   yara_version = \"YL2.0\"\n   rule_version = \"1.0\"\n\n events:\n   $e1.metadata.event_type = \"PROCESS_LAUNCH\"\n   re.regex($e1.principal.process.command_line, `\\bsvchost(\\.exe)?\\b`) nocase\n   not re.regex($e1.principal.process.command_line, `\\\\Windows\\\\System32\\\\`) nocase\n\ncondition:\n   $e1\n}\nSpecify more than one event variable\nYARA-L enables you to have more than one event variable in a rule. In the\nfollowing example, the rule has events\n$e1\nand\n$e2\n. The condition states the\nlogical condition that triggers the detection.\nrule ExcludeZeroValues {\n  meta:\n    author = \"noone@google.com\"\n\n  events:\n    $e1.metadata.event_type = \"NETWORK_DNS\"\n    $e1.principal.hostname = $hostname\n\n    // $e1.principal.user.userid may be empty string.\n    $e1.principal.user.userid != \"Guest\"\n\n    $e2.metadata.event_type = \"NETWORK_HTTP\"\n    $e2.principal.hostname = $hostname\n\n    // $e2.target.asset_id cannot be empty string as explicitly specified.\n    $e2.target.asset_id != \"\"\n\n  match:\n    // $hostname cannot be empty string.\n    $hostname over 1h\n\n  condition:\n    $e1 and $e2\n}\nRules outcome section\nUse the outcome section to set holding variables within the rule detection to\nprovide enrichment for downstream consumption. For example, you can add severity\nscoring information that relies on data from the events being analyzed. The\nfollowing detection examines two events to attribute the\n$hostname\nvalue. If\nthe value\n$hostnames\nmatch over a 5 minute period, a severity score is\napplied. When using time periods, the Google SecOps Detection Engine only\nexamines the discrete blocks of time you specify.\nrule OutcomeRuleMultiEvent {\n    meta:\n      author = \"noone@google.com\"\n    events:\n      $u.udm.principal.hostname = $hostname\n      $asset_context.graph.entity.hostname = $hostname\n\n      $severity = $asset_context.graph.entity.asset.vulnerabilities.severity\n\n    match:\n      $hostname over 5m\n\n    outcome:\n      $risk_score =\n        max(\n            100\n          +   if($hostname = \"my-hostname\", 100, 50)\n          +   if($severity = \"HIGH\", 10)\n          +   if($severity = \"MEDIUM\", 5)\n          +   if($severity = \"LOW\", 1)\n        )\n\n      $asset_id_list =\n        array(\n          if($u.principal.asset_id = \"\",\n             \"Empty asset id\",\n             $u.principal.asset_id\n          )\n        )\n\n      $asset_id_distinct_list = array_distinct($u.principal.asset_id)\n\n      $asset_id_count = count($u.principal.asset_id)\n\n      $asset_id_distinct_count = count_distinct($u.principal.asset_id)\n\n    condition:\n      $u and $asset_context and $risk_score > 50 and not arrays.contains($asset_id_list, \"id_1234\")\n}\nConclusion\nYARA-L is a flexible detection language which enables you to examine security\nevents and not simply just return a data query. The event variable is used to\ntrack what field values are being used in the condition section of the rule. You\ncan use a single event, multiple events over time, correlate sources for a\nsingle value (such as $hostname from different data sources), and even use tools\nsuch as regular expressions to provide matches. It is essential to tune the rules to your own\nenvironment and this can be done by specifying exclusions within the logic. You\ncan also use reference lists to group items together and then reference that\nlist in the rule. Don't forget that Google SecOps does not need every\ndetection to be alerted on. You can keep track of detections for multiple\npurposes and only alert on those you determine are most critical in your\nenvironment.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:09.083364Z"
}