{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/yara-l-entity-risk-score/",
  "title": "Specify entity risk score in rules",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nSpecify entity risk score in rules\nSupported in:\nGoogle secops\nSIEM\nThis document describes how to use entity risk scores in rules. In rules, entity\nrisk scores behave in a way that is similar to entity context. You can write YARA-L\n2.0 rules to use risk scores as the main detection method. For more\ninformation about rules on risk analytics, see\nCreate rules for Risk \nAnalytics\n. For more information \non more risk-based context, see\nCreating context-aware\nanalytics\n.\nTo retrieve an entity risk score, join an entity with a UDM event and retrieve\nthe specified field from\nEntityRisk\n.\nThe following example shows how to create a rule to generate detections on\nany entity hostname whose risk score is greater than 100.\nrule EntityRiskScore {\n  meta:\n  events:\n    $e1.principal.hostname != \"\"\n    $e1.principal.hostname = $hostname\n\n    $e2.graph.entity.hostname = $hostname\n    $e2.graph.risk_score.risk_window_size.seconds = 86400 // 24 hours\n    $e2.graph.risk_score.risk_score >= 100\n\n    // Run deduplication across the risk score.\n    $rscore = $e2.graph.risk_score.risk_score\n\n  match:\n    // Dedup on hostname and risk score across a 4 hour window.\n    $hostname, $rscore over 4h\n\n  outcome:\n    // Force these risk score based rules to have a risk score of zero to\n    // prevent self feedback loops.\n    $risk_score = 0\n\n  condition:\n    $e1 and $e2\n}\nThis example rule also performs a self deduplication using the match\nsection. If a rule detection might trigger, but the hostname and risk score\nremain unchanged within a 4-hour window, no new detections will be created.\nThe only supported risk windows for entity risk score rules are either 24 hours \n(86,400 seconds) or 7 days (604,800 seconds), respectively. If you don't specify \na risk window size in the rule, it will be set by default to either 24 hours or \n7 days.\nEntity risk score data is stored separately from entity context data. To use\nboth in a rule, the rule must have two separate entity events, one for the\nentity context and one for the entity risk score, as shown as in the following\nexample:\nrule EntityContextAndRiskScore {\n  meta:\n  events:\n    $log_in.metadata.event_type = \"USER_LOGIN\"\n    $log_in.principal.hostname = $host\n\n    $context.graph.entity.hostname = $host\n    $context.graph.metadata.entity_type = \"ASSET\"\n\n    $risk_score.graph.entity.hostname = $host\n    $risk_score.graph.risk_score.risk_window_size.seconds = 604800\n\n  match:\n    $host over 2m\n\n  outcome:\n    $entity_risk_score = max($risk_score.graph.risk_score.normalized_risk_score)\n\n  condition:\n    $log_in and $context and $risk_score and $entity_risk_score > 100\n}\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:16.911076Z"
}