{
  "url": "https://docs.cloud.google.com/chronicle/docs/detection/risk-based-alerting/",
  "title": "Risk-based alerting with entity-only rules",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nRisk-based alerting with entity-only rules\nSupported in:\nGoogle secops\nSIEM\nWith the\nENTITY_RISK_CHANGE\nUnified Data Model (UDM) event type, you can write YARA-L detection rules that trigger independently of ingested events. This capability lets you focus specifically on changes in an entity's risk score, significantly decreasing the time required for Google Security Operations to detect and alert on shifting entity risk levels. This document explains how to monitor risk scores using this UDM event type in your rules.\nIn Search, you can display events tagged with\nENTITY_RISK_CHANGE\nusing the following YARA-L syntax. Be aware that raw log search doesn't support entity search.\nmetadata.event_type = \"ENTITY_RISK_CHANGE\"\nExamples: ENTITY_RISK_CHANGE rules\nThis section shows two single-event rule examples for efficient risk tracking, which helps you avoid the complexity and lower limits of multi-event rules. For information on your Rules quota, see\nDisplay Rules quota\n.\nDetect when an entity's risk score exceeds 100\nThe following example rule uses the\nENTITY_RISK_CHANGE\nevent type to detect when an entity's risk score exceeds 100:\nrule entity_only_risk_change {\n  meta:\n    author = \"test@google.com\"\n    description = \"Alert on entities crossing a threshold\"\n  events:\n    // Check only Entity Risk Change events\n    $e1.metadata.event_type = \"ENTITY_RISK_CHANGE\"\n\n    // Check for a Risk Score change with 100 as the threshold \n    $e1.extensions.entity_risk.risk_score >= 100\n\n  outcome:\n    // Reset risk score to prevent feedback\n    $risk_score = 0\n\n  condition:\n    $e1\n}\nFilter entities with risk scores over 0\nThe following example rule uses the\nENTITY_RISK_CHANGE\nevent type to track when the risk scores of entities exceed 0:\nrule entity_only_risk {\n  meta:\n     author = \"test@google.com\"\n     description = \"Track changing risk per hostname\"\n  events:\n     // Filter for Risk Change events with risk scores greater than 0\n     $e1.metadata.event_type = \"ENTITY_RISK_CHANGE\"\n     $e1.extensions.entity_risk.risk_score > 0\n\n     // Deduplication\n     $e1.extensions.entity_risk.risk_window_has_new_detections = true\n\n     // Aggregation data\n     $hostname = $e1.about.hostname\n     $risk_score = $e1.extensions.entity_risk.risk_score\n  match:\n     $hostname over 5m\n  outcome:\n     $calculated_risk_score = sum($risk_score)\n     $single_risk_score = max($risk_score)\n  condition:\n     $e1\n}\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:11:37.109918Z"
}