{
  "url": "https://docs.cloud.google.com/chronicle/docs/event-processing/entity-graph/",
  "title": "Using the Entity Context Graph (ECG)",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUsing the Entity Context Graph (ECG)\nSupported in:\nGoogle secops\nSIEM\nThis document is a comprehensive overview of the Entity Context Graph (ECG), its\ndata sources, processing pipeline, and applications in rules and search. The ECG\nis a core entity data model providing essential context for advanced threat\ndetection, investigation, and threat hunting in detection rules, search, and\ndashboards\n. The ECG processing\npipeline (\nmerges\n) contextual information across each\nGoogle SecOps environment.\nAdditionally, the ECG calculates summary metrics for entities such as prevalence (how often a specific entity occurs in your UDM data compared to other entities), an entity's\nfirst-seen-time\nand\nlast-seen-time\n, as well as key enrichment sources and indicators of compromise (IOC) sources like Google Threat Intelligence (GTI), Safe Browsing, WHOIS, and VirusTotal data.\nThe ECG uses UDM events to do the following:\nBuild an enriched, correlated, and comprehensive view of internal entities\n(assets and users) and external entities (IOCs).\nIdentify the relationships between these entities.\nData sources for the ECG\nThe ECG combines data from the following sources:\nContext source\nSource\nDescription\nEntity context\nCustomer-provided\nGoogle SecOps directly ingests structured organizational data, such as authoritative details on users and assets, from external systems. These sources include Identity Providers (IDPs), Configuration Management Database (CMDB) systems (such as ServiceNow CMDB, Duo User Context), and vulnerability management systems.\nDerived context\nGoogle SecOps-generated\nGoogle SecOps generates statistical data based on analysis of ingested activity. It enriches events and entities from various sources within your environment (for example, Windows AD, Azure AD, Okta, Google Cloud, IAM).\nFor example:\nCalculates and enriches each entity with a\nprevalence statistic\nthat indicates its popularity in the environment.\nCalculates and enriches the\nentity first-seen-time and last-seen-time\n.\nGlobal context\nGoogle-sourced\nGlobal sources provide internal and external threat intelligence and reputation data.\nFor example:\nIngests and stores\nGoogle Threat Intelligence data\n.\nEnriches entities with information from\nSafe Browsing threat lists\n.\nEnriches entities with\nWHOIS data\n.\nECG data processing pipeline\nFirst, the UDM aliasing and enrichment pipeline ingests and normalizes raw security events into UDM structures.\nThen, ECG merging builds a rich, authoritative profile for each entity by merging\ncontext from multiple origins (such as identity providers, Configuration\nManagement Databases (CMDBs), threat intelligence feeds, and derived context)\ninto a single, consolidated entity profile. ECG merging adds new connections,\nproperties, and relationships to the ECG, and creates and updates derived\ncontext.\nThe ECG constructs both\ntimed\n(temporal) and\ntimeless\n(non-temporal)\nentities. The ECG evaluates\ntimed\nentities within the specified rule and search\ntime ranges, while it evaluates\ntimeless\nentities without considering the time range of the search or rule.\nThe ECG merges context records by matching common key identifiers, such as\nhostname\n,\nMAC address\n,\nuser ID\n, or\nemail address\n, across these different\ndata sources. It merges records that match across any of these values to build\none comprehensive and enriched view of an entity.\nECG aliasing uses the following UDM fields as \"merge keys\":\nAsset\nentity.asset.product_object_id\nentity.asset.hostname\nentity.asset.asset_id\nentity.asset.mac\nUser\nentity.user.product_object_id\nentity.user.userid\nentity.user.windows_sid\nentity.user.email_addresses\nentity.user.employee_id\nResource\nentity.resource.product_object_id\nentity.resource.name\nGroup\nentity.group.product_object_id\nentity.group.email_addresses\nentity.group.windows_sid\nWhen there are conflicting values with any of the above fields during the merge process, the ECG pipeline will \nselect the value with the latest start time for updating the entity.\nThe ECG creates entity-context data with a five-day look-back window. This\nprocess handles late-arriving data and creates an implicit time to live for\nentity-context data.\nThe ECG distinguishes between contextual data (assets, users, resources, groups) and indicators of compromise (IOCs).\nExample: Merging user data with ECG merging\nGoogle SecOps ingests user data for\njdoe\nfrom three sources: Okta, Azure\n  AD, and a vulnerability scanner. ECG merges these three records based\n  on matching identifiers (such as\njdoe@example.com\n) to create one unified\njdoe\nuser entity in the ECG, containing attributes from all three sources.\nExample: Eliminating redundant data to create a common entity\nTo create a common combined entity, the ECG eliminates redundant data through deduplication. It does this by generating time intervals rather than matching exact timestamps.\nFor example, consider two entities\ne1\nand\ne2\nwith timestamps\nt1\nand\nt2\n, respectively. If\ne1\nand\ne2\nare otherwise identical, the ECG deduplicates them by ignoring timestamp differences in the following fields:\ncollected_timestamp\ncreation_timestamp\ninterval\nCritical entity and event context ECG data sources\nGoogle SecOps requires several specific data sources to create and update entities.\nCritical entity context ECG data sources\nAuthoritative data sources for your environment's users and assets provide the most\ncritical log data for building an\nentity data model\n. For example:\nCategory\nCritical data sources\nEntities populated\nIdentity and access management\nActive Directory, Azure AD, Okta, Google Cloud Identity\nuser\n,\ngroup\nAsset inventory\nCMDBs, JAMF, Microsoft Intune\nasset\nThreat intelligence\nCustom or third-party feeds, Google Threat Intelligence (GTI)\nip_address\n,\ndomain_name\n,\nfile\nExample search\nTo list parsers that support each category:\nGo to\nSupported log types with a default parser\n.\nType a category in the search bar, for example:\nFor parsers relevant to asset inventory, type\ninventory\nor\nasset\n.\nFor parsers relevant to identity and access management, type\nidentity\n.\nFor parsers relevant to threat intelligence, type\nIOC\n.\nData sources and critical UDM fields for entity profiling\nGoogle SecOps enhances entity profiles based on authoritative entity context data sources and critical UDM fields:\nEntity Type\nData sources\nCritical UDM fields (for aliasing and indexing)\nProcess\nEndpoint logs provide the PSPI (`principal.process.product_specific_process_id`), a stable identifier crucial for robust process aliasing.\nExamples include CrowdStrike EDR (CS_EDR) and Windows Sysmon (WINDOWS_SYSMON).\nsource.process.product_specific_process_id\nUser\nThese sources provide user attributes and identity information.\nFor example, Duo Entity context data (DUO_CONTEXT) and Okta (OKTA).\nsource.user.userid\n,\nsource.user.email_address\n,\nsource.user.windows_sid\n,\nsource.user.product_object_id\nAsset or Endpoint\nThese sources provide authoritative asset information.\nFor example, ServiceNow CMDB (SERVICENOW_CMDB) and Tanium Asset (TANIUM_ASSET).\nsource.ip\n,\nsource.hostname\n,\nsource.asset_id\n,\nprincipal.asset.hostname\nFile hash\nProvides a unique \"digital fingerprint\" of the data content to verify data integrity.\nsource.file.sha256\n,\nsource.file.sha1\n,\nsource.file.md5\nCritical event context data UDM fields\nGoogle SecOps requires several critical event context data UDM fields.\nThe most critical UDM fields are those that act as stable\nidentifiers\nand\nrelationship indicators\n(\nprincipal.*\n,\ntarget.*\n,\nsrc_*\n, and\ndst_*\nfields).\nSee the list of\nkey UDM fields\nbelonging to the\nEntity graph\nfeature area.\nTo build a comprehensive ECG, prioritize data sources that contribute\nhigh-value identifiers and relationship data. For example:\nEntity type\nCritical data sources\nCritical UDM fields for entity building\nAsset (host)\nEDR and XDR, DNS and DHCP, Firewall, Google Cloud console Audit Logs\nmetadata.event_type\n,\nprincipal.asset.asset_id\n,\nprincipal.asset.hostname\n,\nprincipal.ip\nUser\nIdentity Provider (IdP) logs, HR Feed (context), Cloud Identity Logs,\nEmail Gateway\nprincipal.user.userid\n,\nprincipal.user.email_addresses\n,\ntarget.user.userid\n,\nprincipal.ip\nNetwork\nFirewall, VPN, DNS, VPC Flow Logs\nprincipal.ip\n,\ntarget.ip\n,\nsrc_ip\n,\ndst_ip\n,\nnetwork.direction\nFile and process\nEDR and XDR, Application Logs\ntarget.file.full_path\n,\ntarget.process.file.full_path\n,\ntarget.process.command_line\nExample\nECG data relies on these UDM fields to join ECG data and UDM event data in rules, searches, and dashboards.\nFor example, you can join user context data in a \"brute force\" monitoring rule to only alert if the implicated user is also part of the \"Domain Admins\" group and the implicated asset is a domain controller:\nevents:\n  $fail.metadata.event_type = \"USER_LOGIN\"\n  $fail.metadata.vendor_name = \"Microsoft\"\n  $fail.principal.hostname = $hostname\n  $fail.target.user.userid = $target_user\n  $fail.security_result.action = \"BLOCK\"\n  $fail.metadata.product_event_type = \"4625\"\n \n  $fail.metadata.event_timestamp.seconds < $success.metadata.event_timestamp.seconds\n \n  $success.metadata.event_type = \"USER_LOGIN\"\n  $success.metadata.vendor_name = \"Microsoft\"\n  $success.target.user.userid = $target_user\n  $success.principal.hostname = $hostname\n  $success.security_result.action = \"ALLOW\"\n  $success.metadata.product_event_type = \"4624\"\n  $user.graph.entity.user.userid = $target_user\n  $user.graph.metadata.entity_type = \"USER\"\n  $user.graph.metadata.source_type = \"ENTITY_CONTEXT\"\n  any $user.graph.relations.entity.group.group_display_name = \"Domain Admins\"\n\n  $asset.graph.entity.asset.hostname = $hostname\n  $asset.graph.metadata.entity_type = \"ASSET\"\n  $asset.graph.metadata.source_type = \"ENTITY_CONTEXT\"\n  any $asset.graph.relations.entity.group.group_display_name = \"Domain Controllers\"\n \nmatch:\n  $target_user, $hostname over 15m\ncondition:\n  #fail > 4 and $success and $user and $asset\nDerived context enrichments\nGoogle SecOps generates dynamic event-driven inference data\nfrom your organization's event data for each entity across all namespaces. It uses alias information, data\nfrom internal enrichment processes, and security event data to establish\nrelationships (for example, an\nasset\nusing an\nIP address\n). This process adds valuable context to enhance entity profiles.\nFor example, it adds\nentity.file.sha256\nto\nfile (hash)\nentities and\n(principal or target).ip_geo_artifact.location.country_or_region\nto\nnetwork (geolocation)\nentities.\nGoogle SecOps analyzes multiple indicators in ingested activity to enrich events with context\ninformation. It runs critical enrichment functions to generate, for example,\nentity rarity metrics such as\nprevalence statistics\nand\ntemporal metrics such as\nfirst-seen-time\nand\nlast-seen-time\n.\nPrevalence statistics\nThe ECG is also responsible for analyzing existing and incoming data to calculate and store prevalence metrics as a\nderived context\nfield. These metrics\nrepresent a numeric \"popularity\" value for entities like\ndomain\n,\nfile hash\n,\nor\nIP address\nacross your environment. This helps you spot rare\nor unusual activity, as more popular entities are usually less likely to be\nmalicious.\nGoogle SecOps updates these statistics regularly and stores them in a\nseparate entity context. The detection engine can use these values, and you can\nsearch for them using UDM query syntax. However, the Console does not display\nthese values with other entity details.\nYou can use the following fields when creating detection engine rules.\nEntity type\nUDM fields\nDomain\nentity.domain.prevalence.day_count\nentity.domain.prevalence.day_max\nentity.domain.prevalence.day_max_sub_domains\nentity.domain.prevalence.rolling_max\nentity.domain.prevalence.rolling_max_sub_domains\nFile (Hash)\nentity.file.prevalence.day_count\nentity.file.prevalence.day_max\nentity.file.prevalence.rolling_max\nIP address\nentity.artifact.prevalence.day_count\nentity.artifact.prevalence.day_max\nentity.artifact.prevalence.rolling_max\nGoogle SecOps calculates the\nday_max\nand\nrolling_max\nvalues differently, as follows:\nday_max\nis the maximum prevalence score for the artifact during\nthe day (a day is defined as 12:00:00 AM to 11:59:59 PM UTC).\nrolling_max\nis the maximum per-day prevalence score (that is,\nday_max\n) for the artifact over the previous 10-day window.\nThe system uses\nday_count\nto calculate\nrolling_max\nand its value is always 10.\nWhen the system calculates these values for a\ndomain\n, the difference between\nday_max\nand\nday_max_sub_domains\n(and\nrolling_max\nversus\nrolling_max_sub_domains\n) is as follows:\nrolling_max\nand\nday_max\nrepresent the number of daily unique internal IP addresses\naccessing a given domain (subdomains excluded).\nrolling_max_sub_domains\nand\nday_max_sub_domains\nrepresent the number of unique\ninternal IP addresses accessing a given domain (subdomains included).\nGoogle SecOps calculates prevalence statistics using newly ingested entity data. Google SecOps does not\nperform calculations retroactively on previously ingested data. It takes approximately 36\nhours for Google SecOps to calculate and store the statistics.\nExample\nThe ECG requires these UDM fields to join the relevant context data into a rule or search. You must explicitly join all ECG-related data to UDM event data.\nFor example, you can use\nprevalence\ndata in ECG to determine connections to\n  \"rare\" domains in your security logs:\n$dns.metadata.event_type = \"NETWORK_DNS\"\n    $dns.network.dns.questions.name != \"\"\n    $dns.network.dns.questions.name = $domain\n    $prevalence.graph.metadata.entity_type = \"DOMAIN_NAME\"\n    $prevalence.graph.metadata.source_type = \"DERIVED_CONTEXT\"\n    $prevalence.graph.entity.hostname = $domain\n    $prevalence.graph.entity.domain.prevalence.day_count = 10\n    $prevalence.graph.entity.domain.prevalence.rolling_max > 0\n    $prevalence.graph.entity.domain.prevalence.rolling_max <= 3\n\n  match:\n    $domain over 5m\n  condition:\n    $dns and $prevalence\nFirst-seen and last-seen times of entities\nGoogle SecOps analyzes incoming data to enrich entity context\nrecords with the following critical fields:\nfirst-seen-time\n:\nThe date and time when the entity was first seen in your\nenvironment.\nlast-seen-time\n:\nThe date and time of the most recent observation.\nThese derived fields let you correlate activity across\ndomain\n,\nfile hash\n,\nasset\n,\nuser\n, or\nIP address\nentities.\nThe system stores these values in the following UDM fields:\nEntity type\nUDM fields\nDomain\nentity.domain.first_seen_time\nentity.domain.last_seen_time\nFile (hash)\nentity.file.first_seen_time\nentity.file.last_seen_time\nIP address\nentity.artifact.first_seen_time\nentity.artifact.last_seen_time\nAsset\nentity.asset.first_seen_time\nUser\nentity.user.first_seen_time\nExceptions for first-seen-time and last-seen-time calculations:\nFor\nasset\nand\nuser\nentities, Google SecOps only populates the\nfirst_seen_time\nfield, but not the\nlast_seen_time\nfield.\nGoogle SecOps doesn't calculate the statistics for each entity within individual namespaces.\nGoogle SecOps doesn't export these statistics to the\nGoogle SecOps\nevents\nschema in BigQuery\n.\nGoogle SecOps doesn't calculate these values for other entity types, such as a\ngroup\nor\nresource\n.\nGlobal context enrichments\nThese sources include external threat intelligence and reputation data from\n  internal and third-party global sources.\nIngest Google Threat Intelligence data\nGoogle SecOps ingests data from Google Threat Intelligence (GTI)\ndata sources and provides contextual information for investigating activity in your environment.\nQuery the following data sources:\nGTI Tor Exit Nodes:\nIP addresses that are known\nTor\nexit nodes.\nGTI Benign Binaries:\nFiles that are either part of the original operating system\ndistribution or were updated by an official operating system patch.\nSome official operating system binaries that have been abused by an adversary\nthrough activity common in living-off-the-land attacks are excluded from this\ndata source, such as those focused on initial entry vectors.\nGTI Remote Access Tools:\nFiles that have frequently been used by malicious actors.\nThese tools are generally legitimate applications that are sometimes abused to\nremotely connect to compromised systems.\nThe system stores this contextual data globally as entities. You can query the data using\n  detection engine rules. Include the following UDM fields and values in the rule to query these global entities:\ngraph.metadata.vendor_name\n=\nGoogle Threat Intelligence\ngraph.metadata.product_name\n=\nGTI Feed\nTimed versus timeless Google Threat Intelligence data sources\nGoogle Threat Intelligence data sources include\ntimed\nor\ntimeless\ntypes.\nEach entry in\ntimed\ndata sources has an associated time range. If Google SecOps generates a detection on day 1, then on any day in the\nfuture, Google SecOps expects to generate the same detection for day 1 during a\nretrohunt.\nTimeless\ndata sources have no associated time range. This\nis because you only need to consider the latest dataset. The system typically uses\ntimeless\ndata sources for data that isn't expected to change, such as file hashes. If Google SecOps doesn't generate a detection on day 1, a detection might be generated for day 1 during a retrohunt on day 2 because a new entry was added to the timeless data source.\nData about Tor exit node IP addresses\nGoogle SecOps ingests and stores IP addresses that are known Tor exit nodes.\nTor exit nodes are points where traffic exits the Tor network. Tor exit node data is\ntimed\n.\nGoogle SecOps stores information ingested\nfrom this data source in the following UDM fields:\nUDM field\nDescription\n<variable_name>\n.graph.metadata.vendor_name\nStores the value\nGoogle Threat Intelligence\n.\n<variable_name>\n.graph.metadata.product_name\nStores the value\nGTI Feed\n.\n<variable_name>\n.graph.metadata.threat.threat_feed_name\nStores the value\nTor Exit Nodes\n.\n<variable_name>\n.graph.entity.artifact.ip\nStores the IP address ingested from the GTI data source.\nExample search\ngraph.metadata.source_type =\"GLOBAL_CONTEXT\"\ngraph.metadata.product_name = \"GTI Feed\"\ngraph.metadata.threat.threat_feed_name = \"Tor Exit Nodes\"\nData about benign operating system files\nGoogle SecOps ingests and stores file hashes from the GTI Benign Binaries\ndata source. Google SecOps stores information ingested from this data source in the following\nUDM fields. Benign binaries data is\ntimeless\n.\nUDM field\nDescription\n<variable_name>\n.graph.metadata.vendor_name\nStores the value\nGoogle Threat Intelligence\n.\n<variable_name>\n.graph.metadata.product_name\nStores the value\nGTI Feed\n.\n<variable_name>\n.graph.metadata.threat.threat_feed_name\nStores the value\nBenign Binaries\n.\n<variable_name>\n.graph.entity.file.sha256\nStores the SHA256 hash value of the file.\n<variable_name>\n.graph.entity.file.sha1\nStores the SHA-1 hash value of the file.\n<variable_name>\n.graph.entity.file.md5\nStores the MD5 hash value of the file.\nExample search\ngraph.metadata.source_type =\"GLOBAL_CONTEXT\"\ngraph.metadata.product_name = \"GTI Feed\"\ngraph.metadata.threat.threat_feed_name = \"Benign Binaries\"\nData about remote access tools\nRemote access tools include file hashes for known remote access tools such as\nVNC clients that malicious actors have frequently used. These tools are\ngenerally legitimate applications that are sometimes abused to remotely connect\nto compromised systems. Google SecOps stores information ingested from this data source in\nthe following UDM fields. Remote access tools data is\ntimeless\n.\nUDM field\nDescription\n<variable_name>\n.graph.metadata.vendor_name\nStores the value\nGoogle Threat Intelligence\n.\n<variable_name>\n.graph.metadata.product_name\nStores the value\nGTI Feed\n.\n<variable_name>\n.graph.metadata.threat.threat_feed_name\nStores the value\nRemote Access Tools\n.\n<variable_name>\n.graph.entity.file.sha256\nStores the SHA256 hash value of the file.\n<variable_name>\n.graph.entity.file.sha1\nStores the SHA-1 hash value of the file.\n<variable_name>\n.graph.entity.file.md5\nStores the MD5 hash value of the file.\nExample search\ngraph.metadata.source_type =\"GLOBAL_CONTEXT\"\ngraph.metadata.product_name = \"GTI Feed\"\ngraph.metadata.threat.threat_feed_name = \"Remote Access Tools\"\nEnrich entities with information from Safe Browsing threat lists\nGoogle SecOps ingests data from Safe Browsing that is related to file hashes.\nGoogle SecOps stores the data for each file as an entity and provides additional context about the file.\nYou can create detection engine rules that query this entity context\n data to build context-aware analytics.\nGoogle SecOps stores the following information with the entity context record.\nUDM field\nDescription\nentity.metadata.product_entity_id\nA unique identifier for the entity.\nentity.metadata.entity_type\nThis value is\nFILE\n, indicating that the entity describes a file.\nentity.metadata.collected_timestamp\nThe date and time that the entity was observed or the event occurred.\nentity.metadata.interval\nStores the start time and end time for which this data is valid. Because threat list content changes over time, the\nstart_time\nand\nend_time\nreflect the time interval during which the data about the entity is valid. For example, a file hash was observed to be malicious or suspicious between\nstart_time\nand\nend_time\n.\nentity.metadata.threat.category\nThe Google SecOps\nSecurityCategory\n. The system sets this to one or more of the following values:\nSOFTWARE_MALICIOUS\n: indicates that the threat is related to malware.\nSOFTWARE_PUA\n: indicates that the threat is related to unwanted software.\nentity.metadata.threat.severity\nThis is the Google SecOps\nProductSeverity\n.\n      If the value is\nCRITICAL\n, this indicates that the artifact appears malicious.\n      If the value isn't specified, there isn't enough confidence to indicate that the artifact is malicious.\nentity.metadata.product_name\nStores the value\nGoogle Safe Browsing\n.\nentity.file.sha256\nThe SHA256 hash value for the file.\nExample rule\nevents:\n    // find a process launch event, match on hostname\n    $execution.metadata.event_type = \"PROCESS_LAUNCH\"\n    $execution.target.process.file.sha256 != \"\"\n    $execution.principal.hostname = $hostname\n\n    // join execution event with Safe Browsing graph\n    $sb.graph.entity.file.sha256 = $execution.target.process.file.sha256\n\n    // look for files deemed malicious\n    $sb.graph.metadata.entity_type = \"FILE\"\n    $sb.graph.metadata.threat.severity = \"CRITICAL\"\n    $sb.graph.metadata.product_name = \"Google Safe Browsing\"\n\n  match:\n    $hostname over 5m\n\n  condition:\n    $execution and $sb\nEnrich entities with WHOIS data\nThe system runs WHOIS data enrichment daily as a critical function. WHOIS data is both\ntimed\nand\ntimeless\n.\nDuring ingestion of your device data, Google SecOps evaluates domains against WHOIS data. When domains match, Google SecOps stores the related WHOIS data with the domain's entity record. For each entity with\nentity.metadata.entity_type = DOMAIN_NAME\n, Google SecOps enriches it with WHOIS information.\nGoogle SecOps populates enriched WHOIS data into the following fields in the entity record:\nentity.domain.admin.attribute.labels\nentity.domain.audit_update_time\nentity.domain.billing.attribute.labels\nentity.domain.billing.office_address.country_or_region\nentity.domain.contact_email\nentity.domain.creation_time\nentity.domain.expiration_time\nentity.domain.iana_registrar_id\nentity.domain.name_server\nentity.domain.private_registration\nentity.domain.registrant.company_name\nentity.domain.registrant.office_address.state\nentity.domain.registrant.office_address.country_or_region\nentity.domain.registrant.email_addresses\nentity.domain.registrant.user_display_name\nentity.domain.registrar\nentity.domain.registry_data_raw_text\nentity.domain.status\nentity.domain.tech.attribute.labels\nentity.domain.update_time\nentity.domain.whois_record_raw_text\nentity.domain.whois_server\nentity.domain.zone\nGoogle SecOps enriches\ndomain\nentities (\nentity.metadata.entity_type = \"DOMAIN_NAME\"\n) with\nregistrant\n,\ncreation\n, and\nexpiration time\ndata from\nglobal context\nWHOIS records.\nFor descriptions of these fields, see the\nUnified Data Model field list document\n.\nExample search\ngraph.metadata.source_type =\"GLOBAL_CONTEXT\"\ngraph.metadata.product_name = \"WHOISXMLAPI Simple Whois\"\ngraph.entity.domain.registry_data_raw_text != b\"\"\nBest practices: Identify global context enriched data sources\nTo improve rule performance, include a filter in rules that use data from\nGlobal context enrichment sources\nto identify the specific enrichment type or source.\nThe following filter parameters identify the enrichment type or source:\nentity_type\n,\nproduct_name\n, and\nvendor_name\n.\nFor example, include the following filter fields in the\nevents\nsection of the rule that joins WHOIS data:\n$enrichment.graph.metadata.entity_type = \"DOMAIN_NAME\"\n$enrichment.graph.metadata.product_name = \"WHOISXMLAPI Simple Whois\"\n$enrichment.graph.metadata.vendor_name = \"WHOIS\"\nEntity Context Graph limitations and suggestions\nWhen you use contextually enriched data, consider the following ECG behavior:\nDon't add intervals to entity data; instead, let the ECG\ncreate intervals. This is because Google SecOps generates intervals during deduplication unless\notherwise specified.\nIf you specify the intervals, Google SecOps deduplicates only the same events and\nretains the most recent entity.\nTo ensure that live rules and retrohunts work as expected, you must ingest entities\nat least once daily.\nIf you don't ingest entities daily, but only once in two or more days,\nlive rules might work as expected; however, retrohunts might lose some event contexts.\nIf you ingest identical entities more than once daily, Google SecOps deduplicates them into a single entity.\nIf event data is missing for a day, Google SecOps temporarily uses data from the previous day\nto ensure that live rules work correctly.\nFor details about general Google SecOps service limits, see\nService limits\n.\nRelated external content\nUsing Entity Graph as a Multi-dimensional List\nAliasing in Chronicle SIEM\nExpiring IOCs in Entity Graph\nGoogle Safe Browsing in Chronicle SIEM\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:11:09.527168Z"
}