{
  "url": "https://docs.cloud.google.com/chronicle/docs/investigation/alert-suppression/",
  "title": "Configure alert suppression",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nConfigure alert suppression\nSupported in:\nGoogle secops\nSIEM\nThis document describes the mechanisms available in Google Security Operations to\nsuppress noisy alerts and prioritize critical threats. Alert suppression\nautomatically filters duplicative and low-value alerts based on predefined\ncriteria. This suppression gives your SOC team the ability to focus on\nhigh-priority security incidents.\nYou can use alert suppression to manage volume generated by various triggers,\nsuch as duplicate alerts from\nthe same underlying activity, false positives resulting from misconfigured\nsystems, broad rule logic that triggers on known, benign activity, or planned\nmaintenance windows.\nGoogle SecOps provides the following methods to manage alert\nvolume:\nThrottling\n: Suppresses repetitive detections of the same activity for a\ndefined time window (for example, 1 hour) after the initial alert triggers.\nExclusions\n: An exclusion prevents specific detections by filtering matches\nbefore they trigger an alert. Events that meet the rule logic, but don't meet\nthe exclusion criteria trigger detections normally.\nSOAR playbooks\n: Provides time-bound alert suppression based on specific\nentity lookups, such as IP addresses or hostnames.\nSOAR alert grouping\n: Automatically clusters similar alerts into a single\ncase based on your criteria to streamline investigations.\nSuppress alerts through throttling\nThrottling suppresses detections for a specified duration after an initial rule\nmatch. When you use the\nsuppression_window\nand\nsuppression_key\noptions in\nthe rule logic, the system generates a detection only for the first unique\ncombination of the suppression key. Google SecOps suppresses all\nsubsequent matches for that same combination until the defined window expires.\nThis method effectively reduces duplicate detections caused by the same\nunderlying activity.\nUse cases\nPowerShell execution\n: Suppress repetitive alerts for the same user and\nhost for one hour after the initial event.\nNetwork scanning\n: Suppress repetitive alerts from a malicious port scanner\nfor six hours after the first detection.\nMonitor for noisy rules\nTo identify noisy rules, do the following:\nSign in to Google SecOps\n.\nClick\nMenu\n, select\nDetection\n>\nRules and Detections\n.\nOn the\nRules Editor\ntab, select the rule, and click\nTest\n.\nAdjust the time range selector to analyze the last seven days of data. If a\nrule generates over 100 detections daily, it's likely too broad.\nClick\nmore_vert\nMenu\nand click\nView rule detections\n. The\ndetection details page appears.\nIn the\nProcedural Filtering\npanel, identify\ncontributing UDM fields.\nModify the\nmatch\nsection or\n$suppressi_key\nto reduce the volume of\ndetections.\nExample: Identify unique logins by location\nTo identify unique logins by location while preventing alert\nfatigue, you can suppress detections from the same state. Look for the UDM field\nevent.principal.location.state\nto see the detection count per state.\nIf a specific state shows an excessively high count, add that field to your\nsuppression\nor\nmatch\nkey. This ensures the system fires only a single\ndetection for each unique login location.\nConfigure detections throttling\nThrottling suppresses detections for a specified duration after an initial\nalert triggers. To limit duplicate detections, add a\nsuppression_window\nto\nthe rule's\noptions\nsection of your rule. The following guidelines apply:\nSingle event rules\n: Define the\n$suppression_key\nvariable in the\noutcome\nsection to act as the deduplication key.\nMulti-event rules\n: Use the variables in the\nmatch\nsection as the\ndeduplication key.\nWindow duration\n: Make sure the\nsuppression_window\nis greater than or\nequal to the\nmatch\nwindow size. If you set it to the same duration, the rule\nbehaves as if no suppression is applied.\nLimit\n: There's no maximum limit for the suppression window duration.\nCompatibility\n: Throttling applies to single and multi-event rules, and\nboth custom and curated rules.\nExample: Monitor Windows file share activity\nThe following rule monitors windows file share activity. It creates one\ndetection for every unique user and hostname within a 60-minute (\n1hr\n) window,\nthen suppresses repetitive matches for the same combination for 24 hours (\n24h\n).\nrule rule_noisy_winshares {\n\n  meta:\n   author = \"Google Cloud Security\"\n\n  events:\n    $e.metadata.event_type = \"NETWORK_CONNECTION\"\n    $e.target.resource.name = /(C|ADMIN|IPC)\\$/ nocase\n    $user = $e.principal.user.userid\n    $hostname = $e.target.hostname\n\n  match:\n    $hostname, $user over 1h\n\n  outcome:\n    $sharename = array_distinct($e.target.resource.name)\n\n  condition:\n    $e\n\n  options:\n    suppression_window = 24h\n}\nThis configuration lets analysts investigate the initial activity without\nprocessing duplicate alerts for the same user and host during the suppression\nwindow.\nSuppress alerts using rule exclusions\nAn exclusion prevents specific detections by filtering matches before they\ntrigger an alert. If a match satisfies the exclusion logic, the system\nsuppresses the detection. Events that meet the rule logic, but don't meet the\nexclusion criteria, continue to trigger detections normally. Once applied,\nexclusions remain active until you manually disable them.\nYou can view, manage, and audit the\ncomplete list of exclusions and the associated metadata on the\nExclusions\ntab on the\nRules and Detections\npage. You can also use the\nTest Exclusion\nfeature to assess how specific filters impact your\ndetection volume before applying them.\nTo create exclusions using the API, see\nManage rule exclusion using the API\n.\nUse cases\nSuppress legitimate PowerShell execution by authorized IT tools.\nExclude internal vulnerability scanners performing high-volume port scans.\nCreate rule exclusions\nTo create exclusions for a noisy rule, follow these steps:\nSign in to Google SecOps\n.\nGo to\nMenu\n>\nDetection\n>\nRules and Detections\n.\nOn the\nRules Dashboard\ntab, look for rules with high detection counts.\nClick the\nRule Name\nto open the\nDetections\npage.\nClick\nRule Options\n>\nExclude\n.\nSpecify these details to add the exclusion filter:\nExclusion name\nRules or rules sets that it applies to\nThe exclusion criteria to suppress detections when the specified conditions\nare met. To add multiple conditions, follow these guidelines:\nTo create a logical OR relationship, enter multiple values in a single\nrow using the\nEnter\nkey.\nFor example,\nprincipal.ip IS 192.158.1.38 OR principal.ip IS 192.186.0.2\nClick\n+ Conditional Statement\nto add a new statement that has a\nlogical\nAND\nrelationship with the previous statement.\nFor example,\n(principal.ip IS 192.158.1.38 OR principal.ip IS 192.186.0.2) AND (principal.user.userid CONTAINS sensitive)\nOptional: Click\nTest Exclusion\nto view how the filter measures the\nreduced detections over the last 30 days. Adjust your criteria based on the\nresults.\nClick\nCreate\nto activate the exclusion.\nManage rule exclusions\nTo manage the exclusions, follow these steps:\nSign in to Google SecOps\n.\nGo to\nMenu\n>\nDetection\n>\nRules and Detections\n.\nGo to the\nExclusions\ntab to see the list of exclusions. You can do the\nfollowing:\nTo enable or disable an exclusion, flip the\nEnabled\ntoggle.\nTo filter the exclusions, click\nfilter_alt\nFilter\n.\nTo edit an exclusion, click\nmore_vert\nMenu\n>\nEdit\n.\nTo archive an exclusion, click\nmore_vert\nMenu\n>\nArchive\n.\nTo restore an exclusion, click\nmore_vert\nMenu\n>\nUnarchive\n.\nTo create and manage rule exclusions using API, see\nManage rule exclusion through API\n.\nLimitations\nWhen you configure exclusions, note these functional differences between the\nconsole and the API:\nRule scope\n: In the console, you can apply exclusions to multiple curated\nrules simultaneously, but you can only apply to a single custom rule at a time.\nOutcome variables\n: To create exclusions that use logic based on outcome\nvariables, you must use the API.\nSuppress alerts through SOAR playbooks\nSOAR playbooks\nhelp identify and suppress duplicate alerts based\non specific lookup criteria. The playbook suppresses alerts until a predefined\nexpiration time, after which it automatically removes the alerts from the table.\nAnalysts use this method to suppress alerts for specific entities, such as\nIP addresses or hostnames, for a set duration.\nUnlike other methods, this mechanism tracks historical data and provides an\nexplicit audit trail of suppression actions within the case details.\nUse case\nSuppress subsequent alerts for incoming connection requests from a suspicious\nIP address after the initial alert, while maintaining a suppression audit trail.\nGroup alerts in SOAR\nAlert grouping automatically clusters similar alerts generated within a 24-hour\nwindow based on your defined criteria. The system consolidates grouped alerts\ninto a single case for investigation.\nFor more information, see\nAlert grouping mechanism\n.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:41.914092Z"
}