{
  "url": "https://docs.cloud.google.com/chronicle/docs/investigation/select-unselect/",
  "title": "Control columns using select and unselect keywords",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nControl columns using select and unselect keywords\nSupported in:\nGoogle secops\nSIEM\nIn Search and Dashboards, you can use the\nselect\nand\nunselect\nkeywords to\ncustomize the columns displayed in the\nEvents\ntable on the\nResults\ntab\nin Search, and the tables within dashboard widgets.\nThe default columns are\nTimestamp\nand\nEvent\nand are always displayed. The\nselect\nand\nunselect\nkeywords add and remove columns respectively next to the\nEvent\ncolumn.\nselect\n: adds the specified columns to the\nEvents\ntable\nunselect\n: removes the specified columns from the\nEvents\ntable\nThese keywords alter how events are displayed only.\nUsage examples\nThe examples in this section demonstrate common syntax for using the\nselect\nand\nunselect\nkeywords in Search queries.\nFor example, the following query searches for events tied to\nalex-laptop\nand adds\nsecurity_result.about.email\nas a column to the\nEvents\ntable:\nprincipal.hostname = \"alex-laptop\"\nlimit: 10\nselect: security_result.about.email\nMultiple column example\nThe\nEvents\ntable includes\ntarget.asset.hostname\nas the first column (after the\nTimestamp\nand\nEvent\ncolumns).\nFor example, you can add multiple columns:\nprincipal.hostname = \"alex-laptop\"\nlimit: 10\nselect: network.sent_bytes, security_result.about.email\nOutcome variable example\nYou can use a variable with the\nselect\nkeyword. The following example declares\n$seconds\nas an outcome variable equal to the\nmetadata.event_timestamp.seconds\nUnified Data Model (UDM) field value. You can then specify it\nusing the\nselect\nkeyword and the\nSeconds\nvalue is displayed as one of the\ncolumns.\nprincipal.hostname = \"alex-laptop\"\noutcome:\n  $seconds = metadata.event_timestamp.seconds\nlimit: 10\nselect: $seconds, security_result.about.email\nAggregation and event example\nThe\nselect\nand\nunselect\nsections are mutually exclusive and let users include or exclude outcome\nvariables, match variables, event fields, or entity fields.\nAll UDM searches are either single event searches or aggregated searches (also\nknown as\nevent statistics\n). Aggregate searches specify the\nmatch\nkeyword or\nuse aggregate functions in the output (for example,\nsum\nor\ncount\n).\nSingle event search\nThis example adds a column for\nmetadata.event_timestamp\n:\nevents:\n  principal.hostname = \"alex-laptop\"\n  metadata.event_type = \"NETWORK_CONNECTION\"\nselect:\n  metadata.event_timestamp\nAggregated search\nIn this example, columns representing\n$hostname\nand\n$count_id\nare added to\nthe\nEvents\ntable:\nevents:\n    $e.metadata.event_type != \"RESOURCE_CREATION\"\n    $e.principal.hostname = $hostname\n    $id = $e.network.session_id\nmatch:\n    $hostname over 1h\noutcome:\n    $count_hostname = count($hostname)\n    $count_id = count($id)\nunselect:\n    $count_hostname\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:54.865470Z"
}