{
  "url": "https://docs.cloud.google.com/chronicle/docs/investigation/investigate-alert/",
  "title": "Investigate an alert",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nInvestigate an alert\nSupported in:\nGoogle secops\nSIEM\nAlerts are tied to data identified as a threat by your security systems.\nInvestigating alerts gives you context about the alert and related entities.\nWhen you click an alert, you are directed to a page that contains alert details organized into the following three tabs:\nOverview\n: provides a summary of important details about the alert,\nincluding alert status and detection window.\nGraph\n: visualizes alerts that are generated from a YARA-L rule. It\nprovides a graph of the alert's relationship to other entities. When an\nalert is triggered, entities associated with the alert are displayed on the\ngraph and on the left side of the screen, each with its own card. The alert\ngraph uses the following entities in a UDM event:\nprincipal\n,\ntarget\n,\nsrc\n,\nobserver\n,\nintermediary\n, and\nabout\n.\nAlert history\n: lists all the changes that have happened to this alert,\nincluding when the status of an alert has changed or a note has been added.\nBelow the graph that visualizes the relationships between the entities and the\nalert are the following three subtabs that provide more context about the alert:\nEvents\n: contains details about the events related to the alert.\nEntities\n: contains details about each entity associated with the alert.\nAlert context\n: provides\nadditional context\nabout the\nalert.\nBefore you begin\nTo populate the alert graph, you need to\ncreate a YARA-L\nrule\nthat generates alerts. The\nquality of the alert graph is tied to the context that is built into the YARA-L\nrule. The\noutcome section\nof a rule\nprovides context to the detections triggered by the rule.\nWe recommend adding the following\nUDM\nnouns\nto the\noutcome section, because they are used in the alert graph:\nprincipal\n,\ntarget\n,\nsrc\n,\nobserver\n,\nintermediary\n, and\nabout\n. For these\nUDM nouns, the following fields are used in the alert graph:\nartifact.ip\nasset.asset_id\nasset.hostname\nasset.ip\nasset.mac\nasset.product_object_id\nasset_id\ndomain.name\nfile.md5\nfile.sha1\nfile.sha256\nhostname\nip\nmac\nprocess.file.md5\nprocess.file.sha1\nprocess.file.sha256\nresource.name\nurl\nuser.email_addresses\nuser.employee_id\nuser.product_object_id\nuser.userid\nuser.windows_sid\nThe values in the preceding list of UDM fields also link to UDM search from the\nAlert context\nsubtab. For more information, see\nView context about the alert\n.\nIn the following YARA-L rule, an alert is generated when a significant number of Google Cloud service APIs have been disabled within a short time frame (1 hour).\nrule gcp_multiple_service_apis_disabled {\n\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detect when multiple Google Cloud Service APIs are disabled in a short period of time.\"\n    severity = \"High\"\n    priority = \"High\"\n\n  events:\n    $gcp.metadata.event_type = \"USER_RESOURCE_UPDATE_CONTENT\"\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.metadata.product_event_type = \"google.api.serviceusage.v1.ServiceUsage.DisableService\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.target.application = \"serviceusage.googleapis.com\"\n    $gcp.principal.user.userid = $userid\n\n  match:\n    $userid over 1h\n\n  outcome:\n    $risk_score = max(75)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_user_id = array_distinct($gcp.principal.user.userid)\n    $principal_user_display_name = array_distinct($gcp.principal.user.user_display_name)\n    $target_resource_name = array_distinct($gcp.target.resource.name)\n    $dc_target_resource_name = count_distinct($gcp.target.resource.name)\n\n  condition:\n    $gcp and $dc_target_resource_name > 5\n}\nAfter an alert is generated, you can navigate to the\nAlert graph\npage to\nobtain more context about the alert and to further investigate it.\nNavigate to the Alert graph\nYou can access the\nGraph\nfrom the\nAlerts and IOCs\npage or the\nUDM Search\npage.\nAccess the Alert graph from Alerts and IOCs\nThe\nAlerts and Indicators of Compromise (IOC)\npage enables you to filter and\nview all the alerts and IOCs that are currently affecting your enterprise. To\nlearn more about this page and how to view IOC matches, visit\nView Alerts and\nIOCs\n.\nTo view more information about an alert from the Alerts and IOCs page, complete\nthe following steps:\nFrom the navigation bar, click\nDetections > Alerts and IOCs\n.\nFind the alert you want to investigate in the alerts table.\nIn that alert's row, click the text in the name column to open\nAlert\ngraph\n.\nAccess the Alert graph from UDM Search\nAt the top of the navigation bar, select\nSearch\n.\nLoad a search with\nSearch Manager\nor create a new search. Learn more\nabout conducting a search in UDM in\nUDM\nSearch\n.\nThree tabs are displayed:\nOverview\n,\nEntity\n, and\nAlerts\n.\nClick\nAlerts\n.\nClick the alert you want to investigate. The Alert viewer is displayed.\nClick\nView details\nto open Alert view.\nClick the\nGraph\ntab to display Alert graph.\nView details about an alert\nIn Alert view, the\nOverview\ntab displays the following information with\nregards to the alert:\nAlert Details\n: Alert status, creation date, severity, priority, and risk\nscore.\nDetection Summary\n: Detection rule that generated the alert. You can view\nother alerts from the same detection rule.\nEvents\n: Events associated with this alert.\nInputs\n: Details the data sources that generated the alert. The contents\nvary depending on the following alert types.\nStandard detection\n: Displays the events and associated entities that\ntriggered the rule.\nComposite detection\n: Displays the events, entities, and the underlying\ndetections that served as inputs to the rule.\nAn alert is a\ncomposite detection\nwhen:\nThe\nInputs\ncolumn shows\nDetection\nas a source.\nThe\nDetection type\ncolumn displays an\nAlert\nor\nDetection\nlabel\nwith a number next to it (for example,\nAlert (3)\n).\nThis indicates that a detection, or a chain of detections, triggered the alert,\n  rather than raw events or entities alone.\nYou can view and analyze these underlying detections in the\nDetections\ntable by using the following features:\nExpand the rows to view nested detections, associated event data, and\n  related entity information.\nCustomize your view by using the column manager to select and arrange\n  columns in the table.\nIn addition to viewing important information, you can adjust the alert status.\nChange the alert status\nClick\nChange alert status\nin the upper right hand corner.\nIn the window that appears, update the severity and priority levels\naccordingly.\nClick\nSave\n.\nClose the alert\nClick\nClose alert\n.\nIn the window that appears, you have the option to leave a note to add more\ncontext about why you closed the alert.\nEnter your information and press\nSave\n.\nView entity relationships\nThe\nGraph\nshows you how different alerts and entities are connected. This\nfeature gives you a visual, interactive graph that you can use to expand\nrelationship information about existing entities to surface unknown\nrelationships. You can also expand your search by increasing the time range and\nexpanding past point-in-time alerts for richer alert paths.\nYou can also expand your search by clicking the\n+\nicon in the upper right\nhand side of any node. Doing this displays all the nodes related to that entity.\nGraph icons\nDifferent entities are represented by different icons.\nIcon\nEntity the icon represents\nExplanation\naccount_circle\nUser\nA user is a person or other entity that requests access to and uses information from your network. Examples: janedoe, cloudysanfrancisco@gmail.com\ndatabase\nResource\nResources are a generic term for entities that have their own unique resource name. Examples: BigQuery table, database, and project.\nIP Address\ndescription\nFile\nDomain name\nURL\ndevice_unknown\nUnknown entity type\nAn entity type not recognized by Google SecOps's software.\nmemory\nAsset\nAn asset is anything that produces value for your organization. This can include hostnames, MAC addresses, and internal IP addresses. Examples: 10.120.89.92 (internal IP address), 00:53:00:4a:56:07 (MAC address)\nIf two or more alerts come from the same rule, they are grouped together in a\ngroup icon. Indicators that represent the same entity are consolidated into one\nicon.\nTo learn more about each of these icons, review the following documents:\nInvestigate a user\nResource-oriented design\nInvestigate an asset\nInvestigate a Domain\nInvestigate a file\nInvestigate an IP address\nNavigate the alert graph\nWhen you click\nAlert graph\n, the graph shows all results 12 hours before and\nafter the alert. If there are no entities for the alert, only the original alert\nappears on the graph.\nThe main alert is highlighted in a red circle. Alerts are connected to entities\nwith a solid line and other alerts with a dotted line. If you hold the pointer\nover an edge (the line connecting two nodes), it shows you the outcome variable\nor match variable that connects it to a node on the graph.\nOn the left-hand side, there are cards for each node that include details about\nassociated rules, detection windows, severity and priority status, and more.\nDirectly above the graph is a button labeled\nGraph options\n. When you click\nGraph options\n, two options appear:\nNon-alerting detections\nand\nRisk\nscore\n. Both are toggled on by default and can be toggled on or off based on\nyour preference.\nTo move the nodes, simply drag the nodes around the graph. When you release the\nnode, it is pinned where you left it until you click\nRefresh\n.\nAdd and remove nodes\nIf you click a node, a table appears at the bottom of the screen. You can do the\nfollowing actions on each node:\nAlert\nSee related entities, alerts, and events\nSee outcomes and matches from the alert\nRemove any subgraph\nAdd or remove related entities and alerts from the graph by checking boxes\nin the On Graph column\nEntity\nSee all related alerts\nRemove any subgraph\nAdd or remove related alerts from the graph by checking or unchecking boxes\nin the On Graph column\nGroup\nSee all the entities or alerts that make up that group\nUngroup individual nodes by clicking\nOn Graph\non the table at the bottom\nof the page.\nTo add or remove the risk score from the nodes, check or uncheck the\nRisk\nScore\nbox above the table.\nExpand the alert graph\nTo see more related nodes, click the\n+\nicon at the bottom of the alert. The\nentities and alerts related to the icon you selected pop up. Each new alert has\na card on the side with more details.\nReset the graph\nIf you want to clear the graph, you can adjust the time range in the right hand\nwindow. The maximum range is 90 days. Resetting the time range also resets the\ngraph to its original state. Updating the time range clears the graph of any\nadditional nodes and resets the graph to its original state.\nTo move the nodes back to the default position, click\nrefresh\n.\nView context about the alert\nThe\nAlert context\nsection contains a list of values that provide additional context about the alert.\nThe alert context has a\nType\ncolumn that tells you which part of the rule\ngenerated the alert that you selected—outcome or match. The next column is\ncalled\nVariable\n. These variable names are based on the names of the match\nand outcome variables defined in the rule. Finally, the far right column is\nUDM Field\n. Variables that have a UDM field listed are also linked in the\nValues\ncolumn.\nIn addition to the UDM fields listed in the\nBefore you begin\nsection, the following UDM fields are also linked to the\nUDM search\npage:\nfile.full_path\nprocess.command_line\nprocess.file.full_path\nprocess.parent_process.product_specific_process_id\nprocess.pid\nprocess.product_specific_process_id\nresource.product_object_id\nThe specific UDM nouns that are associated with these fields are\nprincipal\n,\ntarget\n,\nsrc\n,\nobserver\n,\nintermediary\n, and\nabout\n. If\nyou click a value, a\nUDM\nsearch\nis triggered, passing the\nvalue along with the time range of the past day.\nIn the example YARA-L rule featured in the\nBefore you begin\nsection, the following UDM fields will be linked to the\nUDM search\npage:\nprincipal.ip\nprincipal.user.userid\nprincipal.user.user_display_name\ntarget.resource.name\nView alert history\nThe\nAlert History\ntab allows you to see a full history of all of the actions\nthat have taken place for this alert. This includes:\nWhen the alert first appeared\nAny notes people on your team have left about this alert\nIf the severity has changed\nIf priority has been changed\nIf the alert has been closed\nAlerts from Google Security Operations SOAR\nAlerts from Google Security Operations SOAR include additional information about the\nGoogle Security Operations SOAR case. These alerts also provides a link to open the case\nin Google Security Operations SOAR. For more information, see the\nGoogle Security Operations SOAR cases\noverview\n.\nAlert for Google Security Operations SOAR case\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:12:44.406341Z"
}