{
  "url": "https://docs.cloud.google.com/chronicle/docs/investigation/data-tables/",
  "title": "Use data tables",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse data tables\nSupported in:\nGoogle secops\nSIEM\nData tables are multicolumn data constructs that let you input your own data into Google Security Operations. \nData tables can act as lookup tables with defined columns and the data stored in rows. \nYou can create or import a data table to your Google SecOps account using the Google SecOps web interface, the data tables API, or by using a\nOverview of YARA-L 2.0\nquery.\nAssign scopes to data tables using data RBAC\nTo use data tables, you need to assign scopes to data tables using data role-based access control (data RBAC). By assigning scopes to a data table, you can control which users and resources can access and utilize it. For more information, see\nConfigure data RBAC for data tables\n.\nManage data tables using the Google SecOps web interface\nThe following sections describe how to manage data tables using the web interface, including how to access data tables, add a new data table, edit its contents, add rows, and how to remove a data table from your account.\nAccess your data tables\nTo access the\nData Tables\npage, do the following:\nOn the sidebar, select\nInvestigation\n>\nData Tables\n.\nTo find a specific data table, at the top of the\nData Tables\nsidebar, enter its name in the\nSearch\nfield.\nAdd a new data table\nWhen you add a new data table, you can enter CSV data manually, paste CSV data, or import a CSV or TSV file into the data table.\nThe following configurations are permanent and can't be changed after a new data table is saved:\nColumn headers\nData mapping\nPrimary keys\nRepeated fields\nMapping of column names to entity fields\nTo add a new data table to Google SecOps, do the following:\nOn the sidebar, select\nInvestigation\n>\nData Tables\n.\nAt the top of the\nData Tables\nsidebar, click\nadd\nCreate\n.\nIn the\nCreate New Data Table\ndialog, give the table a name and, optionally, add a description.\nDo one of the following:\nEnter CSV data manually or paste CSV data into the\nText\n(edit mode) area.\nDo the following to import data from a CSV or TSV file into the data table:\nClick\nImport File\n.\nGo to the file and click\nOpen\n. The\nImport File\ndialog opens.\nIf you selected a TSV file in the previous step, do the following:\nFrom the\nSeparator Type\nlist, select\nDetect automatically\nor\nTab\n.\nFrom the\nStart import at row\nlist, specify the row in the file from which to import the data.\nClick\nImport Data\n.\nSelect the\nTable\nedit mode and configure the following as needed:\nMap data types to data table columns\nDesignate specific columns as key columns\nDesignate specific columns to support repeated fields\nMap column names to entity fields (optional)\nClick\nSave\n. The new data table is displayed in the\nData Tables\nsidebar and is ready to accept additional data.\nMap data types to data table columns\nWhen you add a new data table, you can map data types (string, regular expression, CIDR, or number) to data table columns.\nYou can map\nsingle\ndata fields to a data column, and map repeated data fields \nto a data column using the web interface or the API, as follows:\nIn both the web interface and the API, separate the data field values using a pipe (\n|\n). In the web interface, if any value includes a pipe (\n|\n), it's treated as a repeated value by default.\nFor API requests, set\nrepeated_values\nto\ntrue\n.\nFor more information, see\nRepeated fields\n.\nIn the following example, the data table column\nField_value\ncontains values \nfor multiple fields:\nField_value\nField_name\naltostrat.com\nFQDN\n192.0.2.135\nIP\ncharlie\nuserid\nexample\nhostname\nThe preceding table is split into four columns with each column mapped to only one field type before it can be used for any of the data table use cases presented in this document.\nFQDN\nIP\nUserid\nHostname\naltostrat.com\n192.0.2.135\ncharlie\nexample\n…\n…\n…\n…\nDesignate key columns\nWhen you add a new data table, you can designate specific columns as key columns.\nMarking a column as a key column uniquely identifies the values in that column,\nprevents data duplication, and improves data discovery for rules and\nsearches.\nDesignate columns to support repeated fields\nWhen you add a new data table, you can designate specific columns to support repeated fields.\nColumns intended to store multi-value fields or\nrepeated fields\n, \nmust be explicitly designated as\nrepeated\nwhen the data table is created.\nMap column names to entity fields (optional)\nWhen you add a new data table, you can map the column names of the data table to\nentity\nfields.\nIn the following example data table, the\nUserid\nand\nRole\ncolumns are mapped \nto\nentity.user.userid\nand\nentity.user.attribute.role.name\n, respectively:\nUserid\n(map to entity.user.userid)\nEmail\nRole\n(map to entity.user.attribute.role.name)\njack\njack123@gmail.com\nadministrator\ntony\ntony123@gmail.com\nengineer\nYou can map a data table column to an entity proto field using the\nmapped_column_path\nfield of the\nDataTable\nresource.\nFor columns without a defined entity path, such as\nEmail\nin this \nexample table, you must manually specify a data type. As with\nreference lists\n, the supported data \ntypes for data tables are\nnumber\n,\nstring\n,\nregex\n, and\ncidr\n.\nYou can include both mapped and unmapped columns in a data table by specifying a\njoin\ncondition.\nUnmapped columns are stored in the\nadditional\nfield of the entity the table joins to. These are added as key-value pairs, where the\nkey\nis the column name and the\nvalue\nis the corresponding row value.\nAdd a new row to a data table\nTo add a new row, do the following:\nOn the\nDetails\ntab, select the\nTable\nedit mode.\nRight-click an existing row and select\nAdd row above\n.\nEnter data for a new row. The first row is treated as a table header. Be sure to match each data item to the appropriate data column and data type.\nClick\nSave\n.\nEdit a row in a data table\nTo edit a row, do the following:\nClick the field you want to change. The field becomes editable.\nMake your changes.\nClick\nSave\n.\nSearch data table rows\nYou can search for specific information within a data table using the web interface. On the\nDetails\ntab, enter a search string in the search field and click\nSearch\n. Rows containing your search string are displayed.\nManage the table row TTL\nTo manage the time to live (TTL) value for table rows, do the following:\nClick\nShow TTL per row\n. A TTL column displays, indicating whether each row has expired. If not expired, it shows the remaining time before expiration.\nClick the\nDefault row expiration\ntime to display the\nUpdate default row expiration\ndialog and adjust the table row TTL.\nEnter a new TTL value in\nHours\nor\nDays\n. The minimum value is 1 hour. The maximum value is 365 days.\nClick\nSave\n.\nRow-level TTL override behavior\nRows inherit the TTL applied at the table level. You can also set a specific TTL for individual rows, and this row-level TTL takes precedence over the table-level default. When you add a new row, its TTL begins from the time of creation.\nDelete a table row\nTo delete a row, right-click the row and select\nDelete row(s)\n.\nTo delete multiple rows, select each row you want to remove. Then right-click \nany selected row and choose\nDelete row(s)\n.\nRemove a data table\nTo remove a data table, do the following:\nSelect a data table from the\nData Tables\nlist in the sidebar.\nClick\nDelete\n.\nManage data tables using the Chronicle API\nYou can also use the REST resources available in the Chronicle API to manage data tables in Google SecOps. The API can replicate all of the features available in the web interface, and includes some additional features that let you manage data tables with more performance and greater scale.\nHere are the data table REST resources:\ndataTables\ndataTableRows\ndataTableOperationErrors\nExample: filter syntax\nThe following Chronicle API example shows how to use the\nfilter\nsyntax to search for\ngoogle.com\nin data table rows:\ncurl -X GET \\\n-H \"Authorization: Bearer $(gcloud auth print-access-token)\" \\\n-H \"Content-Type: application/json\" \\\n\"https://staging-chronicle.sandbox.googleapis.com/v1alpha/projects/{$PROJECT}/locations/${REGION}/instances/${INSTANCE}/dataTables/${DATA_TABLE_NAME}/dataTableRows?filter=google.com\"\nUse data tables in Google SecOps\nOnce you've added data tables to your Google SecOps instance, you can use them to filter, enhance, and enrich your data using YARA-L queries. This document includes numerous examples in YARA-L syntax, which you can incorporate into Google SecOps.\nYou can use data tables in conjunction with YARA-L queries in both Search and rules.\nData tables can be used in the following ways:\nFilter UDM event or entity data using a data table\nYou can \nfilter UDM telemetry events and entities by comparing them with entries in a \ndata table.\nUse a data table as a multicolumn reference list\nYou can use \na data table as a multicolumn reference list. While a\nreference list\ncan access data in \na single dimension, data tables let you access data in multiple dimensions, \nenabling data filtering.\nJoin a data table with an event or entity\nYou can link UDM \nevents to a data table using the equality (\n=\n) operator for\nrow-based\ncomparisons. This comparison lets you filter the data. A\nrow-based\ncomparison \nevaluates as\ntrue\nonly if all conditions in the statement match a single row \nin the data table.\nFilter UDM event and entity data using a data table\nYou can filter UDM events and entities by comparing them to entries in a data\ntable. Join the data table with a UDM event or entity using\nrow-based\nor\ncolumn-based\ncomparisons.\nRow-based and column-based comparisons in data tables\nComparison type\nKey logic\nCommon operators\nExample syntax\nWhen to use\nRow-based\nAll conditions must match within the SAME row\n=\n,\n!=\n,\n>\n,\n>=\n,\n<\n,\n<=\n$e.field = %table.col_a\nWhen the relationship between multiple column values\nin the same row\nmatters.\nColumn-based\nValue must exist ANYWHERE in the column\nIN\n,\nIN regex\n,\nIN cidr\n$e.field IN %table.col_b\nWhen checking for the presence of a value within a set of values in a single column.\nLink UDM events to data tables using\nRow-based\nor\nColumn-based\ncomparison methods:\nRow-based comparison to link UDM events to data tables\nTo link UDM events to data tables using\nrow-based\ncomparison, use\nequality operators\n(\n=\n,\n!=\n,\n>\n,\n>=\n,\n<\n,\n<=\n).\nFor example:\n$<udm_variable>.<field_path> = %<data_table_name>.<column_name>\nIf you're using multiple comparison statements, all\nfields or conditions must match on the same data table row.\nTo use operators (such as\nnot\n,\n!=\n,\n>\n,\n>=\n,\n<\n,\n<=\n) in your query, you must\ninclude at least one\njoin\ncondition between UDM fields and data table rows.\nGoogle SecOps treats any rule with a data table\njoin\nas a \nmulti-event rule, which requires a\nmatch\nsection in the rule definition.\nTo filter data by matching values from UDM events against rows in the data table, consider the following join syntax:\nCorrect join syntax:\nRow-based \"combination exclusion\" requires, for example, a\nleft outer\njoin and a\nwhere\nclause checking for\nnulls\n.\nIncorrect join syntax:\nDon't wrap\nNOT\naround multiple row-based equality conditions. This syntax does not achieve an \"exclude if this combination is found\" effect.\nFor example, don't use this syntax:\nNOT (field1 = %table.col1 AND field2 = %table.col2)\nThis is because the match is still applied row by row. If\nany\nrow fails the inner combined condition, the\nNOT\ncauses that row's evaluation to be\ntrue\n, potentially including the event rather than excluding it.\nTo use a data table column of type\nCIDR\nor\nregex\nfor\nrow-based\ncomparison, use the following syntax:\nnet.ip_in_range_cidr($e.principal.ip, %<data_table_name>.<column_name>)\n\n  re.regex($e.principal.hostname, %<data_table_name>.<column_name>)\nColumn-based comparison to link UDM events to data tables\nTo link UDM events to data tables using\ncolumn-based\ncomparison, use the\nin\nkeyword.\nFor example:\n$<udm_variable>.<field_path> in %<data_table_name>.<column_name>\nTo filter out events where the field value exists in the specified column (for example, a blocklist or allowlist), use this syntax:\nNOT (... IN %table.column)\nFor example:\nnot ($evt_username in %my_data_table.username)\nTo use a data table column of type\nCIDR\nor\nregex\nfor\ncolumn-based\ncomparison, use the following syntax:\n$e.principal.ip in cidr %cidr_data_table.column_name\n\n$e.principal.hostname in regex %regex_data_table.column_name\nWhen comparing columns in data tables that are CIDR or regular expression data types, the\ncidr\nand\nregex\nkeywords are optional.\nYou can also use the\nnot\noperator with data tables.\nThe following example query filters out entries where the IP addresses (\n$e.principal.ip\n) don't match any of the CIDR ranges listed in the\nbenign_ip\ncolumn in\ncidr_data_table\n:\nnot $e.principal.ip in %data_table.benign_ip\nUse a data table as a multicolumn reference list\nYou can use a data table as a multicolumn reference list. Although a\nreference list\ncan access data in a \nsingle dimension (one column), data tables support multiple columns, letting you \nfilter and access data across several dimensions.\nYou can link UDM events to a data table using the\nin\nkeyword for\ncolumn-based\ncomparison, letting you match values in a specific UDM field against values in a \nsingle column of the data table.\nIn the following example, the\nbadApps\ndata table contains two columns:\nhostname\nand\nip\n. The query matches both values (value based on UDM field and\nvalue based on the data table, both of string data types) independently.\nRule example:\nrule udm_in_data_table {\nmeta:\n  description = \"Use data table as multicolumn reference list\"\nevents:\n  $e.metadata.event_type = \"NETWORK_CONNECTION\"\n  $e.security_result.action = \"ALLOW\"\n  $e.target.asset.asset_id = $assetid\n\n  // Event hostname matches at least one value in table column hostname.\n  $e.target.hostname in %badApps.hostname\n\n  // Event IP matches at least one value in table column ip.\n  $e.target.ip in %badApps.ip\n\nmatch:\n  $assetid over 1h\n\ncondition:\n  $e\n}\nSearch example:\nevents:\n  $e.metadata.event_type = \"NETWORK_CONNECTION\"\n  $e.security_result.action = \"ALLOW\"\n  $e.target.asset.asset_id = $assetid\n\n  // Event hostname matches at least one value in table column hostname.\n  $e.target.hostname in %badApps.hostname\n\n  // Event IP matches at least one value in table column ip.\n  $e.target.ip in %badApps.ip\nRow-based joins between a data table and a UDM event or entity\nYou can link UDM events to a data table using equality and comparison operators (\n=, !=, >, >=,\n<, <=\n) to perform row-based comparisons. This approach lets you filter data by\nmatching values from UDM events against rows in the data table. If you're using\nmultiple comparisons statements, all fields or conditions must match on the same data\ntable row.\nYou must include at least one\njoin\ncondition between UDM fields and data\ntable rows to use operators (such as\nnot, !=, >, >=, <, <=\n) in your query.\nGoogle SecOps treats any rule with a data table\njoin\nas a \nmulti-event rule, which requires a corresponding\nmatch\nsection\nin the rule definition.\nWhen a join occurs, the linked data table rows are visible in Search. For more information, see\nView data table rows in Search\n.\nPlaceholders are supported for data tables in the\nevent\nsection of a\nquery, but they must be connected to a UDM event or a UDM entity.\nThe following example uses a data table column of\nstring\ntype.\nThis YARA-L query example checks whether a user login event matches a row in the\nexample_table\n.\nOne condition is that the\nuser ID\nexists in the\nexample_table\n.\nBoth conditions must match on the same row in the\nexample_table\nfor the rule to trigger.\n// Check if a user exists in a data table and that the user is active for all user login events.\nRule example:\n// Check if user exists in a data table and is active in all user login events.\nrule udm_join_data_table {\n\nmeta:\n  description = \"Join data table with UDM event\"\n\nevents:\n  $e.metadata.event_type = \"USER_LOGIN\"\n  $e.security_result.action = \"ALLOW\"\n  $e.principal.user.userid = $userid\n\n// Event must match at least 1 row in the data table \n// where the uid in the data table row is the userid on the event \n// and the active date in the same data table row is before the event timestamp.\n%example_table.uid = $userid\n$e.principal.hostname = %example_table.hostname\n\nmatch:\n  $userid over 1h\n\ncondition:\n  $e\n}\nSearch example:\nevents:\n$e.metadata.event_type = \"USER_LOGIN\"\n$e.security_result.action = \"ALLOW\"\n$e.principal.user.userid = $userid\n\n// Event must match at least 1 row in the data table \n// where the uid in the data table row is the userid on the event \n// and the active date in the same data table row is before the event timestamp\n\n%example_table.uid = $userid\n$e.principal.hostname = %example_table.hostname\nThe following example illustrates how a data table and UDM event data work together.\nBased on the logic in the preceding YARA-L query, a user with\nuser ID\n 32452\nsurfaces in the detection as the user's\nhostname\nfrom the system,\n and matches the\nhostname\nin the data table.\nData table\nuid\ntitle\nhostname\n32452\nHR\nhost1\n64452\nFinance\nhost2\n46364\nIT\nhost3\nUDM event table\nprincipal\nmetadata\nsecurity_result\nprincipal\n32452\nUSER_LOGIN\nALLOW\nhost1\n64589\nUSER_LOGIN\nALLOW\nhost9\n87352\nUSER_LOGIN\nALLOW\nhost4\nWrite results from YARA-L queries to data tables\nYou can write the results from YARA-L queries to a data table. Using \nthis feature, you can create data tables from your Google SecOps \ndata and use those tables to filter and enhance other data.\nYou can use the YARA-L query write syntax for the following:\nDefine YARA-L syntax for writing query results to data tables.\nUse data tables for threat intelligence, incident response, and other \nsecurity use cases.\nData should conform to YARA-L syntax and conventions.\nWrite detections and alerts to data tables using YARA-L\nYou can use a YARA-L query to send detections and alerts to data tables.\nUsing the\nwrite_row\nfunction, you can overwrite a data table row with the \nmatching key in the data table using the results from a rule. If the key is not \nfound in the table, add a new row instead.\nSpecify the\nwrite_row\nfunction in the export section of a YARA-L query. \nWriting data to the data table must be the final action of the query. This \nresults in the outcome variables being written to the data table.\nexport:\n  %<data_table_name>.write_row(\n  data_table_column_x_name: <value>,\n  data_table_column_y_name: <value>,\n  ...,\n  ...,\n  data_table_column_z_name: <value>\n)\n// depending on the key column(s), the rows will be updated for existing keys \nand appended for new keys\nExample: Export search results to data table\nevents:\n  $e.metadata.event_type = \"USER_LOGIN\"\n  $e.security_result.action = \"ALLOW\"\n\noutcome:\n  $user = $e.principal.user.userid\n  $ip = $e.target.ip[0] // Assuming target.ip is an array\n  $timestamp = $e.metadata.event_timestamp.seconds\n\nexport:\n  // Write to the data table named 'successful_logins'\n  %successful_logins.write_row(\n    user: $user,          // Maps $user variable to 'user' column\n    ip: $ip,              // Maps $ip variable to 'ip' column\n    first_seen: $timestamp // Maps $timestamp variable to 'first_seen' column\n  )\nModify a data table using YARA-L\nThe following shows how to modify a data table using YARA-L:\nTableName\n:\nip_user_domain_table\n(key columns for the primary key are defined at creation)\nIP address\nemployee_id*\ndomain\n192.0.2.10\nDana\naltostrat.com\n192.0.2.20\nQuinn\naltostrat.com\n192.0.2.30\nLee\ncymbalgroup.com\n* indicates the primary key.\nThe following query captures unique combinations of\nprincipal.ip\n,\nprincipal.user.employee_id\n, and\ntarget.domain\n. It filters the results based \non the prevalence of the\ntarget.domain\n:\nevents:\n  $e.principal.ip = $principal_ip\n  $e.principal.user.employee_id = $principal_user_employee_id\n  $e.target.domain.name = $target_domain\n  $e.target.domain.prevalence.day_count < 5\n\n// To run this query as a rule, add Condition Section here \n// condition:$e\nQuery results:\nip\nempid\ndomain\n192.0.2.10\nDana\naltostrat.com\n192.0.2.30\nLee\nexamplepetstore.com\n192.0.2.20\nQuinn\naltostrat.com\nExample: Use write_row to write query output to a data table\nRule example:\nrule udm_write_data_table {\n  meta:\n      description = \"Writeto data table\"\n  events:\n    $e.principal.user.employee_id = $principal_user_employee_id\n    $e.target.domain.name = $target_domain\n    $e.target.domain.prevalence.day_count < 5\n\n  outcome:\n    $hostname = $target_domain\n    $principal_emp_id = $principal_user_employee_id\n  \n  condition:\n    $e\n\n  export:\n    %ips_with_hostnames.write_row(\n        employeeid:$principal_emp_id,\n        hostname:$hostname\n    )\n  }\nSearch example:\nevents:\n  $e.principal.user.employee_id = $principal_user_employee_id\n  $e.target.domain.name = $target_domain\n  $e.target.domain.prevalence.day_count < 5\n\noutcome:\n  $hostname = $target_domain\n  $principal_emp_id = $principal_user_employee_id\n\nexport:\n  %ips_with_hostnames.write_row(\n    employeeid:$principal_emp_id,\n    hostname:$hostname\n  )\nExample: Understanding write_row\nIn the following example,\nuser\nand\nip\nare used as primary keys. Each detection that persists in the detections table results in one evaluation of the function call in the export section of the query.\nRule example:\nrule udm_write_data_table {\n  meta:\n    description = \"Write data table\"\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n    all $e.security_result.action != \"BLOCK\"\n    all $e.security_result.action != \"UNKNOWN_ACTION\"\n\n    $user = $e.principal.user.userid\n    $ip = $e.target.ip\n    $ts = $e.metadata.event_timestamp.seconds\n\n  match:\n    $user, $ip over 1h\n\n  outcome:\n    $first_seen = min($ts)\n\n  condition:\n    $e\n\n  export:\n    %successful_logins.write_row(user:$user, ip:$ip)\n  }\nSearch example:\nevents:\n  $e.metadata.event_type = \"USER_LOGIN\"\n  all $e.security_result.action != \"BLOCK\"\n  all $e.security_result.action != \"UNKNOWN_ACTION\"\n\n  $ts = $e.metadata.event_timestamp.seconds\n\noutcome:\n  $user = $e.principal.user.userid\n  $ip = $e.target.ip[0]\n\nexport:\n  %successful_logins.write_row(user:$user, ip:$ip)\nHere is the event data:\nmetadata: {\n  event_type: USER_LOGIN\n  event_timestamp: { seconds: 1283299200 }\n}\nprincipal: {\n  user: {\n    userid: \"charlie\"\n  }\n}\ntarget: {\n  ip: [\"192.0.2.135\", \"192.0.2.136\"]\n}\nsecurity_result: {\n  action: ALLOW\n}\nThe following detections are returned when this query is executed as a rule:\nDetection ID\nMatch $user\nMatch $ip\n0\ncharlie\n192.0.2.135\n1\ncharlie\n192.0.2.136\nThe data table contains the following:\nuser\nip\ncharlie\n192.0.2.135\ncharlie\n192.0.2.136\nThe following search query illustrates the support offered in Search for writing scalar values to data tables.\nevents:\n  $e.metadata.event_type = \"NETWORK_CONNECTION\"\n\nexport:\n  %summary_table.write_row(col_name: $e.metadata.product_name, Vendor_name: $e.metadata.vendor_name)\nEnrich entity graph with a data table\nYou can use data tables to add, remove, or replace the entities presented in an \nentity graph from rules. Use functions in the rule\nsetup\nsection to indicate how the \ndata table should be merged with, appended to, or used to remove entities from \nentity events referenced in the\nevents\nsection.\nYou can use the following rule template to modify an entity graph:\nrule entity_graph_template {\n\n  meta:\n    ...\n\n  setup:\n    // import the data table into entity graph\n    <enrichment_keyword> <join_condition>\n\n  events:\n    ...\n\n  match:\n    ...\n\n  condition:\n    ...\n}\nYou can use the following YARA-L 2.0 functions to enhance entity graph with a \ndata table:\ngraph_override\n: Overwrite the rows in \nthe entity graph that match the join condition with data from the data table.\nFor example:\n[graph_override](?tab=t.0#heading=h.v0fps7eke1if)\ngraph_append\n: Append the rows from the data table to the rows in the \nentity graph. The\ngraph_append\noperation requires an array that includes a \ndata table variable and an entity event variable rather than a join \ncondition.\nIn the following example,\n$g1\nis the entity graph variable and\nexample_table\nis the data table:\ngraph_append [$g1, %example_table]\nFor the\nappend\nfunction, data tables should include the following columns to validate the entity:\nstart_time\n(mapped to\nmetadata.interval.start_time.seconds\n)\nend_time\n(mapped to\nmetadata.interval.end_time.seconds\n)\nData table columns cannot be mapped to metadata fields using the web interface. For\nappend\nuse cases, data tables need to be created using Chronicle API (https://cloud.google.com/chronicle/docs/reference/rest/v1alpha/projects.locations.instances.dataTables/create)\ngraph_exclude\n: Remove the rows in the entity graph that match the\njoin\ncondition.\nFor example:\n[graph_exclude](?tab=t.0#heading=h.o0qbb5paki6g)\nThe join condition must be an equality expression between the data table column \nand the entity graph field. For the\ngraph_override\nand\ngraph_exclude\nfunctions, the syntax to access a data table is as follows:\n<data_table_name>.<column_name>\nAny filter specified for the\n<entity_variable>\nin the event section is applied \nafter its enhancement with the data table.\nAfter the entity in the entity graph is enriched with the entity in the data \ntable, the entity variable in the entity graph must be joined to the UDM entity.\nOverride entity graph with data from data table\nWith the\ngraph_override\nfunction, fields present in both the entity \ngraph and the data table are replaced with fields from the data table. Fields \npresent in the entity graph and not in the data table remain the same. Fields \nnot present in the entity graph but present in the data table are included.\nOnly those columns of the data table that are mapped override the columns \nof the entity graph. The columns that are unmapped are added to the\nadditional\nfield of the entity graph on which the data table is joined.\nExample: Match on single join\nIn the following example, the rows in the entity graph that match the join \ncondition between the data table column and the entity graph field \n(\n$g1.graph.entity.ip = %example_table.my_ip\n) are overridden by the data table.\nrule rule_override {\n  meta:\n    description = \"Override entity context with data table before joining with UDM event\"\n\n  setup:\n    //Rows in the entity graph that match the join condition are overridden by the data table\n    graph_override ($g1.graph.entity.ip = %example_table.my_ip)\n\n  events:\n    $e.metadata.event_type = \"NETWORK_CONNECTION\"\n    $e.security_result.action = \"ALLOW\"\n\n    // Filter will be applied after graph is overridden by data table\n    $g1.graph.entity.hostname = \"ftp01\"\n\n    // Accessing unmapped columns\n    $g1.graph.additional.fields[\"Owner\"] = \"alice\"\n\n    // Joining the UDM event with the enriched entity graph\n    $e.target.ip = $iocip\n    $g1.graph.entity.ip = $iocip\n\n  match:\n    $iocip over 1h\n\n  condition:\n    $e and $g1\n}\nTo use an unmapped column (say \"Owner\") of the data table, then an\nequivalent statement for\n$g1.graph.entity.owner = \"alice\" is $g1.graph.additional.fields[\"Owner\"] = \"alice\"\n. \nThis is because all unmapped columns of the data table go into the\nadditional\nfield of the entity graph\n($g1)\n.\nThe following tables illustrate an override operation where \nrows in the entity graph are enriched when the IP field in the data table matches \nthe IP field in the entity graph.\nExisting entity graph\nHostname\nIP\nMAC\nftp01\n10.1.1.4\n…:01\nwww01\n10.1.1.5\n…:02\nData table\nHostname\nIP\nMAC\nOwner\nftp01\n10.1.1.4\n…:bb\nalice\nh1\n10.1.1.6\n…:cc\nbob\nh2\n10.1.1.7\n…:dd\nchris\nh3\n10.1.1.4\n…:ee\ndoug\nEnriched entity graph\nHostname\nIP\nMAC\nOwner\nftp01\n10.1.1.4\n…:bb\nalice\nwww01\n10.1.1.5\n…:02\nh3\n10.1.1.4\n…:ee\ndoug\nExample: Match on multiple joins\nIn the following example, the rows in the entity graph that match the multiple \njoin conditions (\n$g1.graph.entity.ip = %example_table.my_ip\nand\n$g1.graph.entity.hostname = %example_table.my_hostname\n) are overridden by \nthe data table.\nrule rule_override {\nmeta:\n    description = \"Override Entity context with Data Table before joining with UDM event\"\nsetup:\n  // example with more than one condition\n  graph_override ($g1.graph.entity.ip = %example_table.my_ip and\n  $g1.graph.entity.hostname = %example_table.my_hostname) \nevents:\n  $e.metadata.event_type = \"NETWORK_CONNECTION\"\n  $e.security_result.action = \"ALLOW\"\n\n  // Filter will be applied after graph is overridden by data table\n  $g1.graph.entity.hostname = \"ftp01\"\n\n  // joining the UDM event with the enriched entity graph\n  $e.target.ip = $iocip\n  $g1.graph.entity.ip = $iocip\n\nmatch:\n  $iocip over 1h\n\ncondition:\n  $e and $g1\n}\nThe following tables illustrate an override operation in which the \nrows of the entity graph are enriched when both the IP field and the hostname \nfield in the data table match the IP field and the hostname field in the entity \ngraph.\nExisting entity graph\nHostname\nIP\nMAC\nftp01\n10.1.1.4\n…:01\nwww01\n10.1.1.5\n…:02\nData table\nHostname\nIP\nMAC\nOwner\nftp01\n10.1.1.4\n…:bb\nalice\nh1\n10.1.1.5\n…:cc\nbob\nh2\n10.1.1.6\n…:dd\nchris\nh3\n10.1.1.4\n…:ee\ndoug\nEnriched entity graph\nHostname\nIP\nMAC\nOwner\nftp01\n10.1.1.4\n…:bb\nalice\nwww01\n10.1.1.5\n…:02\nAppend data from the data table to entity graph\nWith the\ngraph_append\nfunction, no join condition is required.\nIn the following example, all rows in the data table are appended to the rows in \nthe entity graph.\nrule rule_append {\nmeta:\n  description = \"Data table append entity\"\n   \nsetup:\n  graph_append [$g1, %example_table]\n\nevents:\n    // filter UDM events\n  $e.metadata.event_type = \"NETWORK_CONNECTION\"\n  $e.security_result.action = \"ALLOW\"\n\n  // Join the filtered UDM events with the enriched graph\n  $e.target.ip = $iocip\n  $g1.graph.entity.ip = $iocip\n\nmatch:\n  $iocip over 1h\n\ncondition:\n  $e and $g1\n}\nThe following example table illustrates an append operation where the rows of \nthe data table are appended to the rows in the entity graph:\nExisting entity graph\nHostname\nIP\nMAC\nftp01\n10.1.1.4\n…:01\nwww01\n10.1.1.5\n…:02\nData table\nIP\nMAC\nOwner\n10.1.1.4\n…:01\nalice\n10.1.1.6\n…:cc\nbob\n10.1.1.7\n…:dd\nchris\n10.1.1.4\n…:ee\ndoug\nEnriched entity graph\nHostname\nIP\nMAC\nOwner\nftp01\n10.1.1.4\n…:01\nwww01\n10.1.1.5\n…:02\n10.1.1.4\n…:bb\nalice\n10.1.1.6\n…:cc\nbob\n10.1.1.7\n…:dd\nchris\n10.1.1.4\n…:ee\ndoug\nUse graph_exclude to remove rows from entity graph\nWith the\ngraph_exclude\nfunction, rows in the entity graph that \nmatch the join condition are removed from the entity graph.\nIn the following example, all rows in the entity graph that match the given join \ncondition (between the data table column and the entity graph field) are removed. \nNo rows from the data table are added to the entity graph.\nrule rule_exclude {\n\n    meta:\n    setup:\n      graph_exclude ($g1.graph.entity.ip = %example_table.ip)\n\n    events:\n        $e.metadata.event_type = \"NETWORK_CONNECTION\"\n        $e.security_result.action = \"ALLOW\"\n        $e.target.ip = $iocip\n        $g1.graph.entity.ip = $iocip\n\n    match:\n        $iocip over 1h\n\n    condition:\n        $e and $g1\n}\nThe following tables illustrate an exclude operation in which the \nrows of the entity graph that match the IP field of the data table are removed:\nExisting entity graph\nHostname\nIP\nMAC\nftp01\n10.1.1.4\n…:01\nwww01\n10.1.1.5\n…:02\nData table\nIP\nMAC\nOwner\n10.1.1.4\n…:bb\nalice\n10.1.1.6\n…:cc\nbob\n10.1.1.7\n…:dd\nchris\nEnriched entity graph\nHostname\nIP\nMAC\nwww01\n10.1.1.5\n…:02\nLimitations\nMaximum number of data tables for a Google SecOps account:\n1,000.\nData tables support only CSV data. Data tables support tab-separated values only when\nadding a new data table\nand importing a tab-separated values (TSV) file.\nData table fields don't support comma (\n,\n) characters.\nThe\nlimits\non the number of\nin\nstatements when referencing a reference list in a query\nalso apply to\nin\nstatements in a data table.\nMaximum number of\nin\nstatements in a query for\nString\nand\nNumber\ndata\ntype columns: 10.\nMaximum number of\nin\nstatements with regular expression operators: 5.\nMaximum number of\nin\nstatements with CIDR operators: 5.\nMaximum columns per data table: 1,000.\nMaximum rows per data table: 10 million.\nMaximum display limit in web page for data table rows in text and table\neditor view: 10,000 rows.\nMaximum data volume in a data table: 10 GB.\nPlaceholders aren't allowed in the setup section.\nUnmapped columns of a data table with data type set to\nstring\ncan only be\njoined with string fields of UDM event or UDM entity.\nUse only unmapped columns in a data table with a data type set to\ncidr\nor\nregex\nfor CIDR or regular expression.\nData table lookups: Regular expression wildcards aren't supported and search\nterms are limited to 100 characters.\nLimitations for data table joins in rules\nThe following limitations apply to data table joins in rules.\nFetching all event samples for detections isn't supported when using data \ntable joins with events.\nUnlike entities and UDM, data tables don't support placeholders. This leads to the following limitations:\nYou can't apply one set of filters to a data table and join it with a UDM entity.\nYou can't apply a different set of filters to the same data table while joining it with another UDM placeholder.\nFor example, a data table named\ndt\nwith three columns:\nmy_hostname\n,\norg\n, and\nmy_email\nand with the following rule:\nevents:\n  $e1.principal.hostname =  %dt.my_hostname\n  %dt.org =\"hr\"\n\n  $e2.principal.email =  %dt.my_email\n  %dt.org !=\"hr\"\nAll filters on a data table are applied first, and then the filtered rows \nfrom the data table are joined with UDM. In this case, the contradictory filters (\n%dt.org =\"hr\" and %dt.org !=\"hr\"\n) on the\ndt\ntable result in an empty data table, which is then joined with both\ne1\nand\ne2\n.\nLimitations using data tables with rules\nThe following limitations apply to data tables when used with rules.\nLimitations for run frequency\nReal-time run frequency isn't supported for rules with data tables.\nLimitations for output to data tables\nany\nand\nall\nmodifiers aren't supported for repeated field columns in data tables.\nArray indexing isn't supported for repeated fields columns in data tables.\nYou can only export outcome variables to a data table. You can't export event paths or data table columns directly.\nColumn lists must include the primary key columns for data tables.\nYou can have a maximum of 20 outcomes.\nIf a data table doesn't exist, a new table is created with the default\nstring\ndata type for all columns, following the order specified.\nA maximum of five rules can write to a data table concurrently.\nThere's no guarantee that a producer rule can add rows to a data table\nbefore a consumer rule for that data table starts.\nA single rule has a limit on the number of outcome rows. A maximum 10,000-row limit\napplies over the result and persisted data and to data tables.\nWhen you update a row, the new values for all non-key columns replace the old\nones. Any updates, including adding a new row, take approximately five minutes\nto become available for querying.\nLimitations for entity enrichment from data tables\nYou can apply only one enrichment operation (either\noverride\n,\nappend\n, or\nexclude\n) to a single entity graph variable.\nEach enrichment operation can use only one data table.\nYou can define a maximum of two enrichment operations of any type in the\nsetup\nsection of a YARA-L rule.\nIn the following example, an\noverride\noperation is applied to the entity graph \nvariable\n$g1\nand an\nappend\noperation is applied to the entity graph variable\n$g2\n.\nsetup:\n    graph_override($g1.graph.entity.user.userid = %table1.myids)\n    graph_append [$g2, %table1]\nIn the preceding example, the same data table (\ntable1\n) is used to enhance \ndifferent entity graphs. You can also use different data tables to enhance \nthe different entity graphs, as follows:\nsetup:\n    graph_override($g1.graph.entity.user.userid = %table1.myids)\n    graph_append [$g2, %table2]\nLimitations using data tables with Search\nThe following limitations apply to data tables when used with Search:\nYou can't run search queries on data tables using the Chronicle API. Queries are only supported through the web interface.\nA single query execution can output a maximum of 1 million rows to a data table or 1 GB, whichever limit comes first.\nSearch output to a data table skips event rows if they exceed 5 MB.\nEntity enrichment is not supported with Search.\nData tables are not supported for customer-managed encryption keys (CMEK) users.\nWrites are limited to 6 per minute per customer.\nAPI support is not available for Search-related data table operations.\nStatistics queries aren't supported with data table joins.\nData table and data table joins are only supported with UDM events, and not with entities.\nSupported:\n%datatable1.column1 = %datatable2.column1\nNot supported:\ngraph.entity.hostname = %sample.test\nYou can't include a\nmatch\nvariable in the\nexport\nsection of a statistics query.\nFor example, the following is not supported:\nmatch:\n      principal.hostname\n  export:\n      %sample.write_row(\n      row: principal.hostname\n    )\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:13:15.151100Z"
}