{
  "url": "https://docs.cloud.google.com/chronicle/docs/reference/use-rules-in-datatap/",
  "title": "Use rules to filter events in a DataTap configuration",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse rules to filter events in a DataTap configuration\nSupported in:\nGoogle secops\nSIEM\nIn a DataTap configuration, you can use Detection Engine rules as a filter to define the events that are published to a\nPub/Sub topic\n.\nTo use rules in a DataTap configuration, follow these steps:\nUse the Detection Engine API's\nCreateRule\nendpoint to \ncreate one or more\nsingle event rules\n. When creating each rule, specify a\ndata_tap_label\nin the request body. Keep the rules simple (under 100 lines). For general information about the Detection Engine API, such as how to authenticate, see\nChronicle Detection Engine API\n.\nUse the DataTap Configuration API's\nCreate\nendpoint to create a DataTap configuration that specifies a\nLABELED_UDM_EVENTS\nfilter.\nCreateRule\nCreate a new rule without setting the rule to live.\nRequest\nPOST https://backstory.googleapis.com/v2/detect/rules\nRequest body\n{\n  \"ruleText\": \"<rule text here>\"\n  \"labels\": \"<labels here>\"\n}\nBody parameters\nParameter Name\nType\nRequired\nDescription\nruleText\nstring\nRequired\nText of the new rule in YARA-L 2.0 format.\nlabels\nRuleLabels\nOptional\nA set of labels to apply on events that match the rule.\nlabels.label\nRuleLabel\nOptional\nA label to apply on events that match the rule.\nlabels.label.state\nenum\nOptional\nSpecifies the status of the label. Valid values are:\nENABLED\nDISABLED\nlabels.label.data_tap_label\nstring\nOptional\nThis label is used to filter the data published on a DataTap \n      configuration that specifies the\nLABELED_UDM_EVENTS\nfilter. If a rule applies a\ndata_tap_label\nto an event, then that event will be published for any\nLABELED_UDM_EVENTS\nDataTap configuration whose\ntopicId\nmatches the\nsink_name\nspecified in the\ndata_tap_label\n.\nlabels.label.data_tap_label.sink_name\nstring\nOptional\nThe name of the DataTap configuration. This should match the value of the\ndisplayName\nspecified in a DataTap configuration.\nSample request\nhttps://backstory.googleapis.com/v2/detect/rules\n{\n  \"ruleText\": \"rule singleEventRule2 {\n    meta:\n      author = \\\"securityuser\\\"\n      description = \\\"single event rule that should generate detections\\\"\n\n    events:\n      $e.metadata.event_type = \\\"NETWORK_DNS\\\"\n\n    condition:\n      $e\n  }\"\n  \"labels\": {\n    \"label\": [\n      {\n        \"state\": \"ENABLED\",\n        \"data_tap_label\": {\n          \"sink_name\": \"tap1\",\n        }\n      }\n    ]\n  }\n}\nResponse\nResponse fields\nThe response is the same as for\nGetRule\n, and it also includes the label fields.\nSample response\n{\n  \"ruleId\": \"ru_1f54ab4b-e523-48f7-ae25-271b5ea8337d\",\n  \"versionId\": \"ru_1f54ab4b-e523-48f7-ae25-271b5ea8337d@v_1605892700_409247000\",\n  \"ruleName\": \"singleEventRule2\",\n  \"metadata\": {\n    \"author\": \"securityuser\",\n    \"description\": \"single event rule that should generate detections\"\n  },\n  \"ruleText\": \"rule singleEventRule2 {\n      meta:\n        author = \\\"securityuser\\\"\n        description = \\\"single event rule that should generate detections\\\"\n      events:\n        $e.metadata.event_type = \\\"NETWORK_DNS\\\"\n      condition:\n        $e\n      }\",\n  \"ruleType\": \"SINGLE_EVENT\",\n  \"versionCreateTime\": \"2020-11-20T17:18:20.409247Z\",\n  \"compilationState\": \"SUCCEEDED\",\n  \"labels\": {\n    \"label\": [\n      {\n        \"state\": \"ENABLED\",\n        \"data_tap_label\": {\n          \"sink_name\": \"tap1\",\n        }\n      }\n    ]\n  }\n}",
  "scraped_at": "2026-03-07T13:12:03.989532Z"
}