{
  "url": "https://docs.cloud.google.com/chronicle/docs/yara-l/multievent-n-of/",
  "title": "Use N OF syntax with event variables",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse N OF syntax with event variables\nSupported in:\nGoogle secops\nSIEM\nThis document explains how to use the N OF syntax to\nwrite flexible and conditional logic within the\ncondition\nsection of your query.\nThe N OF syntax lets you combine multiple conditions, reducing the\noverall complexity of your query syntax:\nProvides a way to specify that a minimum number of boolean expressions from\na given list must evaluate to true.\nAvoids the need to specify every possible combination, reducing errors and\neffort.\nN OF syntax\nThe syntax for an N OF statement is a comma-separated list of boolean\nexpressions expressed as follows:\n[expr1, expr2, … , exprN]\nwhere\n[expr1, expr2, … , exprN]\nThe following sections show some variations of the N OF syntax.\nANY OF\nThe following example checks if at least one expression in the list is true.\nThis is the same as joining all expressions with\nor\n.\ncondition:\n  ANY OF [$e1, #e2 > 5, $outcome1 = \"FAILED\"]\nALL OF\nIf all the expressions in the following list are true, the example is true. This\nis the same as joining all expressions with\nand\n.\ncondition:\n  ALL OF [$e1, $e2, $outcome1 = \"SUCCESS\"]\nN of X\nThis is evaluated to true if at least\nN\nexpressions from the list are true.\ncondition:\n  2 of [$e1, $e2 > 0, $e3, arrays.contains($outcome_ips, \"1.2.3.4\")]\nExample rule: flag sensitive file access\nThe following rule flags a user if they successfully sign in (\n$e1\n). The rule\nthen checks if the session also meets one of two criteria: a sensitive file is\naccessed (\n$e2\n) or the total number of unique sensitive files accessed exceeds\n3\n.\nrule MultiEventNOf {\n  meta:\n    author = \"google-secops\"\n    description = \"Detects user login followed by sensitive file access or multiple sensitive files.\"\n  events:\n    $e1.principal.user.userid = $user\n    $e1.metadata.event_type = \"USER_LOGIN\"\n\n    $e2.principal.user.userid = $user\n    $e2.metadata.event_type = \"FILE_OPEN\"\n    re.regex($e2.target.file.full_path, `^/cns/sensitive/`)\n\n  match:\n    $user over 1h\n  outcome:\n    $sensitive_file_count = count_distinct($e2.target.file.full_path)\n  condition:\n    $e1 and ANY OF [$e2, $sensitive_file_count > 3]\n  }\nExample search: flag sensitive file access\nThe following example shows how you could reformat the\nexample\nrule\nas a search query.\n$e1.principal.user.userid = $user\n$e1.metadata.event_type = \"USER_LOGIN\"\n$e2.principal.user.userid = $user\n$e2.metadata.event_type = \"FILE_OPEN\"\nre.regex($e2.target.file.full_path, `^/cns/sensitive/`)\n\nmatch:\n  $user over 1h\noutcome:\n  $sensitive_file_count = count_distinct($e2.target.file.full_path)\ncondition:\n  $e1 and ANY OF [$e2, $sensitive_file_count > 3]\nKnown limitations\nRequired event existence\n: Expressions N OF syntax can't be\nunbounded. The existence of the event must be a requirement for the clause\nto be true (for example,\n$e1\nor\n#e1 > 0\n).\nVariable type mixing\n: You can't combine non-UDM variables with UDM event\nvariables within the same N OF list.\nWindow restriction\n: You can't use tumbling windows with N OF\nsyntax.\nWhat's next?\nCondition section syntax\nUse or in the condition section\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:14:04.433674Z"
}