{
  "url": "https://docs.cloud.google.com/chronicle/docs/yara-l/multievent-or/",
  "title": "Use or in the condition section",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse or in the condition section\nSupported in:\nGoogle secops\nSIEM\nThis document explains how to use the\nor\noperator to write flexible\nand concise detection logic within the\ncondition\nsection of your query.\nUsing\nor\nbetween event or placeholder variables lets you combine multiple conditions,\nreducing the overall complexity of your query syntax:\nChecks for the presence of either of the specified variables. For\nexample,\n$e1 or $e2\nrequires at least one instance of\n$e1\nor one\ninstance of\n$e2\n.\nor\nsyntax in condition section\nUse the\nor\nkeyword directly between variables. The following example is\nequivalent of\nCOUNT($e1)>0 or COUNT($e2)>0\n:\ncondition:\n  $e1 or $e2  // True if $e1 exists or $e2 exists\nExample rule: risky IP or bad hash execution\nThe following example rule detects a threat if a process launch from a risky IP\naddress is detected or a known bad hash is executed:\nrule MultiEventOr {\n  meta:\n    author = \"google-secops\"\n  events:\n    $e1.principal.ip = \"1.1.1.1\"\n    $e1.metadata.event_type = \"PROCESS_LAUNCH\"\n    $e2.target.file.sha256 = \"badhash...\"\n    $user = $e1.principal.user.userid\n    $user = $e2.principal.user.userid\n  match:\n    $user over 5m\n  condition:\n    $e1 or $e2\n}\nExample search: risky IP or bad hash execution\nThe following example shows how you could reformat the\nexample\nrule\nas a search query.\n$e1.principal.ip = \"1.1.1.1\"\n$e1.metadata.event_type = \"PROCESS_LAUNCH\"\n$e2.target.file.sha256 = \"badhash...\"\n$user = $e1.principal.user.userid\n$user = $e2.principal.user.userid\n\nmatch:\n  $user over 5m\n\ncondition:\n  $e1 or $e2\nKnown limitations\nResource consumption\n: When you use\nor\nbetween event variables, it\nconsumes more resources than using\nand\nand can result in longer query\nexecution times.\nEvent variable limit\n: For Search and Dashboards, you can use maximum of\n3 events in multi-event\nor\nsyntax. For Rules, you can use maximum of 2\nevents in multi-event\nor\nsyntax.\nRequired event existence\n: Expressions using\nor\ncan't be unbounded. The\nexistence of the event must be a requirement for the clause to be true (for\nexample,\n$e1\nor\n#e1 > 0\n).\nVariable type mixing\n: You can't combine non-UDM variables with UDM event\nvariables within the same\nor\nlist.\nWindow restriction\n: You can't use tumbling windows with\nor\nsyntax.\nWhat's next?\nCondition section syntax\nUse N OF syntax with event variables\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:14:03.166805Z"
}