{
  "url": "https://docs.cloud.google.com/chronicle/docs/yara-l/outcome-syntax/",
  "title": "Outcome section syntax",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nOutcome section syntax\nSupported in:\nGoogle secops\nSIEM\nThe\noutcome\nsection of a YARA-L query defines outcome variables that specify the output for a search and dashboard query and additional context and information to a detection when a rule is triggered. These variables can be used for various purposes such as displaying relevant data on dashboards and creating risk scores.\nDefine outcome section\nUse the\n$\ncharacter, followed by a variable name, to define an outcome variable in the\noutcome\nsection of a single query. You can define up to 20 outcome variables. The variable names themselves are arbitrary. For rules, outcome values are computed and aggregated based on each detection.\nEach outcome variable is assigned a value using an expression.\nThis rule searches for failed logins from a new location:\nrule failed_logins\n{\n  meta:\n   author = \"Security Team\"\n   description = \"Detects multiple failed user logins within 10-minute windows.\"\n   severity = \"HIGH\"\n\n  events:\n   $e.metadata.event_type = \"USER_LOGIN\"\n   $e.security_result.action = \"FAIL\"\n   $user = $e.target.user.userid\n\n  match:\n   $user over 10m\n\n  outcome:\n   $failed_login_count = count($e.metadata.id)\n   $first_fail_time = min($e.metadata.event_timestamp.seconds)\n\n  condition:\n   #e >= 5\n}\nThe\noutcome\nsection performs aggregations on the event and placeholder variables: count the failed logins, count the distinct IPs, and get the time the failure occurred.\noutcome:\n   $failed_login_count = count($e.metadata.id)\n   $first_fail_time = min($e.metadata.event_timestamp.seconds)\nIf you include and populate the special\n$risk_score\noutcome variable, its value (integer or float) is displayed on the\nAlerts and IoCs\npage for alerts generated by the query.\nIf you don't include a\n$risk_score\nvariable in the\noutcome\nsection of a query, one of the following default values is set:\nIf the query is configured to generate an alert, then\n$risk_score\nis set to 40.\nIf the query is not configured to generate an alert, then\n$risk_score\nis set to 15.\nThe value of\n$risk_score\nis stored in the\nsecurity_result.risk_score\nUDM field.\nrisk_score outcome variable\nGoogle SecOps Risk Analytics automatically associates detections\nand alerts back to entities related to that detection or alert. The\nrisk_score\noutcome variable is used to assign an amount of risk. If this value is not set,\nthe default detection or alert value is used. You can configure default values\nin Settings.\nTo ensure consistency across the platform, we recommend using the following\nscore ranges when assigning a\nrisk_score\nto your custom detections. This\nalignment helps standardize alert prioritization and response workflows.\nSeverity\nScore range\nDescription\nExample\nAlerting - Critical\n90 - 100\nActive compromise with the potential to have impact beyond a single user account or endpoint. Requires immediate review.\nMimikatz executed on Domain Controller.\nAlerting - High\n80 - 89\nActive compromise of a single endpoint or entity.  Should receive immediate review.\nProduction server calling out to recent, known C2.\nAlerting - Medium\n50 - 79\nPotential security issue requiring investigation. No confirmed compromise but escalation is possible.\nAn exposed credential, no signs of misuse.\nNon-Alerting - Low\n20 - 49\nLow-impact security event that, when combined with other indicators or observations, could lead to a more significant incident. No review generally needed, can be combined with other detections through composite rules to create an alert.\nInternal port scan.\nNon-Alerting Observations\n1 - 19\nGenerally, information based detections intended to build situational awareness of a threat. Generally does not require review; can be combined with other detections through composite rules to generate alerts.\nA login event, no signs of misuse.\nBecause\nrisk_score\nis an outcome variable, your rules can express nuance\ndepending on factors such as threat intelligence or other concurrent conditions.\nEntity risk scores can be used to generate risk-based alerts in near real time.\nFor more information\nOverview of Risk Analytics\n.\nrisk_entity_to_score outcome variable\nIn addition to the\nrisk_score\noutcome variable, you can also specify the\nrisk_entity_to_score\noutcome variable. This variable lets you explicitly\ndesignate which entity or entities from a rule detection should apply that\ndetection's risk score.\nYou can create multiple\nrisk_entity_to_score\nvariables by appending a unique\nstring to the variable and assign the risk score to specific entities. For\nexample:\n$risk_entity_to_score_source_asset = $e.principal.asset.hostname\n$risk_entity_to_score_targeted_user = $e.target.user.userid\nThese outcome variables assign the\nrisk_score\nspecified in the rule's\noutcome\nsection to the\n$e.principal.asset.hostname\nand\n$e.target.user.userid\nentities.\nExample: Rule detects logins to administrator accounts\nThis rule detects successful logins to high-privilege administrator accounts. It\nuses the\nrisk_entity_to_score\nkeyword to explicitly target the specific user\nbeing logged in. Using this variable, the detection ensures that the calculated\nrisk score applies to only to that user and not to other entities involved in\nthe event, such as the source IP address.\nFor details about how to write a multi-event rule, see\nMultiple event rule\n.\nrule suspicious_admin_privilege_escalation {\n // This rule matches single events. Rules can also match multiple events within\n // the same time window.\n\n meta:\n   // Allows for storage of arbitrary key-value pairs of rule details, such as \n   // who wrote it, what it detects on, and version control.\n   // The \"author\" and \"severity\" fields are special, since they are used as\n   // columns on the rules dashboard. To sort based on these fields on the \n   // dashboard, add them here.\n   // Severity value should be \"Low\", \"Medium\", or \"High\"\n   author = \"analyst123\"\n   description = \"Detects suspicious login to critical admin accounts.\"\n   severity = \"HIGH\"\n\n events:\n   $e.metadata.event_type = \"USER_LOGIN\"\n   $e.target.user.attribute.roles.name = \"ADMIN\"\n   $e.security_result.summary = \"Successful login with high-privilege access\"\n\n outcome:\n   // Multi-event rules require an aggregation function\n   // For example, risk_score = max(0)\n   // See https://cloud.google.com/chronicle/docs/detection/yara-l-2-0-overview#outcome_conditionals_example_rule\n   $risk_score = 80\n   $risk_entity_to_score = $e.target.user.userid\n   $source_ip = array_distinct($e.principal.ip)\n\n condition:\n   $e\n}\nExample: Rule monitors internal network connections\nThis rule checks for lateral movement by identifying network connections between\ninternal network segments. It uses\n$risk_entity_to_score prefix\nto assign risk\nto multiple entities within a single detection. Both the initiating host\n(\n$risk_entity_to_score_source_asset\n) and the targeted user\n(\n$risk_entity_to_score_targeted_user\n) have their risk scores updated. The risk\nengine records other outcome variables that don't use this specific prefix for\ncontext, but ignores them (their risk scores remain the same).\nFor details about how to write a multi-event rule, see\nMultiple event rule\nand\nOutcome conditionals example rule\n.\nrule lateral_movement_network_connection {\n // This rule matches single events. You can also match multiple events within\n // the same time window.\n\n meta:\n   // Allows for storage of arbitrary key-value pairs of rule details (for \n   // example, who wrote it, what it detects on, and version control).\n   // The \"author\" and \"severity\" fields are special, since they are used as\n   // columns on the rules dashboard. To sort based on these fields on the \n   // dashboard, add them here. Severity value should be \"Low\", \"Medium\" or \"High\"\n   author = \"analyst123\"\n   description = \"Detects lateral movement attempts between internal segments.\"\n   severity = \"MEDIUM\"\n\n events:\n   $e.metadata.event_type = \"NETWORK_CONNECTION\"\n   $e.principal.asset.hostname != \"\"\n   $e.target.user.userid != \"\"\n   // Can also use: $e.target.ip = /10\\..*/\n   net.ip_in_range_cidr($e.target.ip, \"10.0.0.0/8\")\n\n outcome:\n   // Multi-event rules require an aggregation function\n   // for example, risk_score = max(0)\n   // See https://docs.cloud.google.com/chronicle/docs/yara-l/yara-l-2-0-examples#outcome-conditionals-example-rule\n   $risk_score = 50\n   $risk_entity_to_score_source_asset = $e.principal.asset.hostname\n   $risk_entity_to_score_targeted_user = $e.target.user.userid\n   $target_ip_info = array_distinct($e.target.ip)\n\n condition:\n   $e\n}\nOutcome variable data types\nEach outcome variable can have a different data type, which is determined by the expression used to compute it. The following outcome data types are supported in Google SecOps:\ninteger\nfloats\nstring\nlists of integers\nlists of floats\nlists of strings\nConditional logic\nYou can use conditional logic to compute the value of an outcome. Conditionals\nare specified using the following syntax pattern:\nif(BOOL_CLAUSE, THEN_CLAUSE)\nif(BOOL_CLAUSE, THEN_CLAUSE, ELSE_CLAUSE)\nYou can read a conditional expression as \"if BOOL_CLAUSE is true, then return\nTHEN_CLAUSE, else return ELSE_CLAUSE\".\nBOOL_CLAUSE must evaluate to a boolean value. A BOOL_CLAUSE expression takes a\nsimilar form as expressions in the\nevents\nsection. For example, it can\ncontain:\nUDM field names with comparison operator:\nif($context.graph.entity.user.title = \"Vendor\", 100, 0)\nPlaceholder variable that was defined in the\nevents\nsection:\nif($severity = \"HIGH\", 100, 0)\nAnother outcome variable defined in the\noutcome\nsection:\nif($risk_score > 20, \"HIGH\", \"LOW\")\nFunctions that return a boolean:\nif(re.regex($e.network.email.from, `.*altostrat.com`), 100, 0)\nLook up in a\nreference list\n:\nif($u.principal.hostname in %my_reference_list_name, 100, 0)\nAggregation comparison:\nif(count($login.metadata.event_timestamp.seconds) > 5, 100, 0)\nThe THEN_CLAUSE and ELSE_CLAUSE must be the same data type. We support integers, floats, and strings.\nYou can omit the ELSE_CLAUSE if the data type is integer or a float. If omitted, the\nELSE_CLAUSE evaluates to 0. For example:\n`if($e.field = \"a\", 5)` is equivalent to `if($e.field = \"a\", 5, 0)`\nYou must provide the ELSE_CLAUSE if the data type is string or if the THEN_CLAUSE\nis a placeholder variable or outcome variable.\nMathematical operations\nYou can use mathematical operations to compute integer or float data type in the\noutcome\nand\nevents\nsections of a query. Google Security Operations supports addition, subtraction, multiplication, division, and modulus as top level operators in a computation.\nThe following snippet is an example computation in the\noutcome\nsection:\noutcome:\n  $risk_score = max(100 + if($severity = \"HIGH\", 10, 5) - if($severity = \"LOW\", 20, 0))\nMathematical operations are allowed on the following types of operands as long as\neach operand and the entire arithmetic expression is properly aggregated (See\nAggregations\n):\nNumeric event fields\nNumeric placeholder variables defined in the\nevents\nsection\nNumeric outcome variables defined in the\noutcome\nsection\nFunctions returning ints or floats\nAggregations returning ints or floats\nModulus is not allowed on floats.\nPlaceholder variables in outcomes\nWhen computing outcome variables, you can use placeholder variables which were\ndefined in the events section of your query. In this example, assume that\n$email_sent_bytes\nwas defined in the events section of the rule:\nExample: single-event with no match section\n// No match section, so this is a single-event query.\n\noutcome:\n  // Use placeholder directly as an outcome value.\n  $my_outcome = $email_sent_bytes\n\n  // Use placeholder in a conditional.\n  $other_outcome = if($file_size > 1024, \"SEVERE\", \"MODERATE\")\n\ncondition:\n  $e\nExample: multi-event with match section\nmatch:\n  // This is a multi event query with a match section.\n  $hostname over 5m\n\noutcome:\n  // Use placeholder directly in an aggregation function.\n  $max_email_size = max($email_sent_bytes)\n\n  // Use placeholder in a mathematical computation.\n  $total_bytes_exfiltrated = sum(\n    1024\n    + $email_sent_bytes\n    + $file_event.principal.file.size\n  )\n\ncondition:\n  $email_event and $file_event\nOutcome variables in outcome assignment expressions\nOutcome variables can be used to derive other outcome variables, similar to\nplaceholder variables defined in the\nevents\nsection. You can refer to an outcome\nvariable in the assignment of another outcome variable with a\n$\ntoken followed\nby the variable name. Outcome variables must be defined before they can be referenced\nin the query text. When used in an assignment expression, outcome variables must\nnot be aggregated (See\nAggregations\n).\nIn the following example, the outcome variable\n$risk_score\nderives its\nvalue from the outcome variable\n$event_count\n:\nExample: outcome variable derived from another outcome variable\nmatch:\n  // This is a multi event query with a match section.\n  $hostname over 5m\n\noutcome:\n  // Aggregates all timestamp on login events in the 5 minute match window.\n  $event_count = count($login.metadata.event_timestamp.seconds)\n\n  // $event_count cannot be aggregated again.\n  $risk_score = if($event_count > 5, \"SEVERE\", \"MODERATE\")\n\n  // This is the equivalent of the 2 outcomes combined.\n  $risk_score2 = if(count($login.metadata.event_timestamp.seconds) > 5, \"SEVERE\", \"MODERATE\")\n\ncondition:\n  $e\nOutcome variables can be used in any type of expression on the right-hand-side of an outcome assignment,\nexcept in the following expressions:\nAggregations\nArrays.length()\nfunction calls\nWith\nany\nor\nall\nmodifiers\nAggregations\nRepeated event fields are non-scalar values. That is, a single variable points to\nmultiple values. For example, the event field variable\n$e.target.ip\nis a repeated field\nand can have zero, one, or many ip values. It is a non-scalar value. Whereas the event field variable\n$e.principal.hostname\nis not a repeated field and only has 1 value (i.e. a scalar value).\nSimilarly, both non-repeated event fields and repeated event fields used in the\noutcome\nsection\nof a query with a match window are non-scalar values.\nExample: group events with match section and non-repeated field\nThe following query groups events using a `match` section and refers to a non-repeated event field in the `outcome` section:\nrule OutcomeAndMatchWindow{\n  ...\n  match:\n    $userid over 5m\n  outcome:\n    $hostnames = array($e.principal.hostname)\n  ...\n}\nAny 5-minute window the query executes over might contain zero, one, or many events. The outcome section\noperates on all events in a match window. Any event field variable referred to within the \noutcome section can point to zero, one, or many values of the field on each event in the match window.\nFor example, if a 5-minute window contains 5\n$e\nevents,\n$e.principal.hostname\nin the outcome section points to five different hostnames. The event field variable\n$e.principal.hostname\nis treated as a non-scalar value in the\noutcome\nsection of this query.\nBecause outcome variables must always yield a single scalar value, any non-scalar value which\nan outcome assignment depends on must be aggregated to yield a single scalar value.\nIn an outcome section, the following are non-scalar values and must be aggregated:\nEvent fields (repeated or non-repeated) when the query uses a\nmatch\nsection\nEvent placeholders (repeated or non-repeated) when the query uses a\nmatch\nsection\nRepeated event fields when the query doesn't use a\nmatch\nsection\nRepeated event placeholders when the query doesn't use a\nmatch\nsection\nScalar event fields, scalar event placeholders, and constants can be wrapped in\naggregation functions in queries that don't include a\nmatch\nsection. However, in\nmost cases, these aggregations return the wrapped value, making them unnecessary.\nAn exception is the\narray()\naggregation, which you can use to explicitly convert\na scalar value into an array.\nOutcome variables are treated like aggregations: they must not be re-aggregated\nwhen referred to in another outcome assignment.\nYou can use the following aggregation functions:\nAggregation Function\nDescription\nmax()\nOutputs the maximum over all possible values. Only works with integer and float.\nmin()\nOutputs the minimum over all possible values. Only works with integer and float.\nsum()\nOutputs the sum over all possible values. Only works with integer and float.\ncount_distinct()\nCollects all possible values, then outputs the distinct count of possible values.\ncount()\nBehaves like `count_distinct()`, but returns a non-distinct count of possible values.\narray_distinct()\nCollects all possible distinct values, then outputs a list of these values. It truncates the list of distinct values to 1,000 random elements. The deduplication to get a distinct list is applied first, then the truncation is applied.\narray()\nBehaves like array_distinct(), but returns a non-distinct list of values. It also truncates the list of values to 1,000 random elements.\nThe aggregate function is important when a rule includes a\ncondition\nsection\nthat specifies multiple events must exist, because the aggregate function will\noperate on all the events that generated the detection.\nExample: condition for multiple events\nThe following is an example of a condition for multiple events. If your outcome and condition section contains:\noutcome:\n  $asset_id_count = count($event.principal.asset_id)\n  $asset_id_distinct_count = count_distinct($event.principal.asset_id)\n\n  $asset_id_list = array($event.principal.asset_id)\n  $asset_id_distinct_list = array_distinct($event.principal.asset_id)\n\ncondition:\n  #event > 1\nSince the `condition` section requires there to be more than one `event` for each\ndetection, the aggregate functions will operate on multiple events. Suppose the\nfollowing events generated one detection:\nevent:\n  // UDM event 1\n  asset_id=\"asset-a\"\n\nevent:\n  // UDM event 2\n  asset_id=\"asset-b\"\n\nevent:\n  // UDM event 3\n  asset_id=\"asset-b\"\nThen the values of your outcomes will be:\n$asset_id_count = 3\n$asset_id_distinct_count = 2\n$asset_id_list = `[\"asset-a\", \"asset-b\", \"asset-b\"]\n$asset_id_distinct_list = `[\"asset-a\", \"asset-b\"]\nLimitations\nThe\noutcome\nsection can't reference a new placeholder variable which wasn't already defined in the\nevents\nsection or in the\noutcome\nsection.\nThe\noutcome\nsection can't use event variables that have not been defined in the\nevents\nsection.\nThe\noutcome\nsection can use an event field that was not used in the\nevents\nsection, given that the event variable that the event field belongs to was already defined in the\nevents\nsection.\nThe\noutcome\nsection can only correlate event variables that have already been correlated in the\nevents\nsection. Correlations happen when two event fields from different event variables are equated.\nSee\nOverview of YARA-L 2.0\nfor examples of\noutcome\nsection.\nSee\nCreate context-aware analytics\nfor details on detection deduping with the\noutcome\nsection.\nWhat's next\nCondition section syntax\nOptions section syntax\nAdditional information\nExpressions, operators, and constructs used in YARA-L 2.0\nFunctions in YARA-L 2.0\nBuild composite detection rules\nExamples: YARA-L 2.0 queries\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:13:57.097318Z"
}