{
  "url": "https://docs.cloud.google.com/chronicle/docs/yara-l/nested-if/",
  "title": "Use nested if statements for more complex logic",
  "content": "Home\nDocumentation\nSecurity\nGoogle Security Operations\nGuides\nStay organized with collections\nSave and categorize content based on your preferences.\nUse nested if statements for more complex logic\nSupported in:\nGoogle secops\nSIEM\nYou can use\nif\nstatements in both the\noutcome\nand\nevents\nsections. You can also use\nif\nstatements within\nthe\nthen\nelse\nclauses of another\nif\nstatement. This capability lets you\nintroduce more complicated logic to your query.\nThis syntax is supported in Rules, Search, and Dashboards.\nSyntax\nif(BOOL_CLAUSE, THEN_CLAUSE, ELSE_CLAUSE)\nNested\nif\nexamples\nSearch example: outcome section\nThis example assigns an outcome score based on\nprincipal.hostname\n.\n$nested_if.principal.hostname != \"\"\noutcome:\n    $score = max(\n        if($nested_if.principal.hostname = /win-adfs/,\n           5,\n          if($nested_if.principal.hostname = /server/,\n             3,\n            if($nested_if.principal.hostname = /win-atomic/,\n               1,\n               0))))\nSearch example: events section\nThis example assigns the placeholder IP to\ntarget.ip\nor\nprincipal.ip\nso long as\nthey're non-empty. If the IP values are missing, it assigns\nno_valid_ip\n.\nevents:\n    $e.metadata.event_type = \"NETWORK_CONNECTION\"\n    $ip = if($e.target.ip != \"\",\n            $e.target.ip,\n            if($e.principal.ip != \"\",\n              $e.principal.ip,\n              \"no_valid_ip\"))\nmatch:\n   $ip\nRule example: nested\nif\nin\noutcome\nsection\nrule nested_if_outcome_example {\nmeta:\n\nevents:\n    $e.metadata.event_type = \"NETWORK_CONNECTION\"\n    $e.principal.ip = $ip\nmatch:\n   $ip over 5m\noutcome:\n    $score = max(\n        if($e.principal.hostname = /win-adfs/,\n           5,\n          if($e.principal.hostname = /server/,\n             3,\n            if($e.principal.hostname = /win-atomic/,\n               1,\n               0))))\n  condition:\n    $e\n}\nRule example: nested\nif\nin\nevents\nsection\nrule nested_if_events_example {\n\nmeta:\n\nevents:\n    $e.metadata.event_type = \"NETWORK_CONNECTION\"\n    $ip = if($e.target.ip != \"\",\n            $e.target.ip,\n            if($e.principal.ip != \"\",\n              $e.principal.ip,\n              \"no_valid_ip\"))\nmatch:\n   $ip over 5m\n\n  condition:\n    $e\n}\nKnown limitation\nThe\nif()\nstatement is a function in YARA-L 2.0 and subject to the function\ndepth limit of 20.\nNeed more help?\nGet answers from Community members and Google SecOps professionals.",
  "scraped_at": "2026-03-07T13:14:01.963710Z"
}